{"id":21553,"date":"2019-12-24T13:47:52","date_gmt":"2019-12-24T18:47:52","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=advisor_blog&#038;p=21553"},"modified":"2020-01-08T11:21:14","modified_gmt":"2020-01-08T16:21:14","slug":"networking-tips-immigrants","status":"publish","type":"advisor_blog","link":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/","title":{"rendered":"Networking Tips for Immigrants"},"content":{"rendered":"<p>“Networking” is the first suggestion most immigrants hear when they start looking for a job in the United States. But how do you network successfully when you are still learning about your new country and its culture?<\/p>\n<p>When you don’t know many people in your new city—especially if you are still learning English—it can be stressful to approach professionals who can influence your career. It can also be intimidating to ask others for their time and advice, much less asking outright for a job interview or referral.<\/p>\n<p>But networking doesn’t have to induce anxiety. It can be an enjoyable and productive experience for everyone involved.<\/p>\n<p>Here’s something important to keep in mind: Although networking might feel uncomfortable based on your cultural upbringing, it is very natural (and even expected) in the U.S.<\/p>\n<p>Professionals who have lived and worked in this country for several years know that networking is part of the job search process. In fact, they are usually happy to help if they can. It is likely that a friend or colleague also helped them find a job at some point.<\/p>\n<p>Below are more tips for immigrants who are trying to enhance their job search by networking.<\/p>\n<blockquote><p>Want to Skip Ahead?<\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/canada-on-demand-understanding-the-hiring-process.html\" target=\"_blank\" rel=\"noopener noreferrer\">Webinar: Understanding the Hiring Process<\/a><\/p><\/blockquote>\n<h4>Don’t Attend Events Just to Network<\/h4>\n<p>Networking is a practice that immigrants are encouraged to adopt so that they can find a good job and expand their circle of acquaintances.<\/p>\n<p>But networking for the sake of networking doesn’t work, and it doesn’t yield results.<\/p>\n<p>For example, even if your event is meant to help job seekers connect with professionals in their field, you should not attend thinking that you will simply ask for favors and hand out your résumé. Your participation will be more about making connections, with a mutual exchange of conversation and information.<\/p>\n<p>Get to know the other people who attend the event, without thinking about your end goal. Let them get to know you on a personal level, as well. It might not be apparent right away what you can do for one another’s careers, but it always helps to have new contacts. Remember that everyone there is in a similar position, and this is a good time to form a true bond with someone who is making an effort to expand their network—just like you.<\/p>\n<p>If you put networking before connecting with people, you will fail to bond with any group significantly enough for them to want to help you.<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/how-to-conquer-a-networking-event\/\" target=\"_blank\" rel=\"noopener noreferrer\">Conquer Your Next Networking Event<\/a><\/p><\/blockquote>\n<h4>Take the ‘Work’ Out of ‘Networking’ Events<\/h4>\n<p>Not all networking events are all about work. You should attend workshops, meetups, and even book groups in order to expand your social network. However, if you enter those groups with the sole purpose of trying to get a job, you won’t fit into that space. If it seems like you have a hidden agenda, you could come across as an interloper.<\/p>\n<p>Instead, it’s best to network with a purpose. Create a <a href=\"https:\/\/venngage.com\/features\/mind-map-maker\/\" target=\"_blank\" rel=\"noopener noreferrer\">mind map<\/a> of your various interests and tailor your networking efforts accordingly. This will give you something to talk about with the other people who are attending. And, despite the outcome, you will still have a good time simply by attending an event that you enjoy.<\/p>\n<p>Attend events that align with your interests so that you can fit in better and connect with the right people. This will not only lead you to the right job opportunities, it can also help you form lasting friendships and expand your social circles.<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/make-the-most-of-in-person-networking-events\/\" target=\"_blank\" rel=\"noopener noreferrer\">Make the Most of Networking Events<\/a><\/p><\/blockquote>\n<h4>Expand Your Areas of Interest<\/h4>\n<p>It is useful to join groups and clubs that are relevant to your personal interests when you’re settling into a new city, a new country, and a new culture. This way, you will meet people who share genuine interests with you. This will give you a common ground to start conversations and bond—so you don’t have to focus on talking about work.<\/p>\n<p>However, it can’t hurt to expand your areas of interest if you want to reach wider groups.<\/p>\n<p>You might discover that the people who share your hobbies are not the same kind of people who work in your field or can help you make professional connections. In this case, you might think about the common interests shared by people in your area of work. For example, <a href=\"https:\/\/knowledge.wes.org\/globaltalentbridge-eguide-career-pathways-in-architecture-using-your-foreign-education-in-the-united-states.html\" target=\"_blank\" rel=\"noopener noreferrer\">architects<\/a> are visual people who might enjoy art museums. You might traditionally prefer big sporting events; however, consider attending a meet-and-greet at a museum occasionally to see if the type of people you meet there will help round out your architecture network.<\/p>\n<p>You might also think about the popular interests of your city, where people are likely to gather and mingle. Where do people like to meet? Attend big public events like the city’s film festivals, art fairs, and concerts.<\/p>\n<p>It’s also important to have something to talk about outside of your shared area of interest and work. Following the news is also a great way to learn what’s important to your community. You can also learn more about local figures—like business leaders, artists, and politicians. This will give you a wide range of topics to talk about when you meet people.<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/immigrants-advice-moving-to-us\/?section=advisor-featured\" target=\"_blank\" rel=\"noopener noreferrer\">Real Immigrants Share Their Advice on Moving to the U.S.<\/a><\/p><\/blockquote>\n<h4>Attend Job Fairs<\/h4>\n<p>Job fairs—as the name suggests—are set up to help people find jobs. But that is not the only reason why you should attend them. They are also great places to meet like-minded people and can help get your credentials out there.<\/p>\n<p>Not every job fair you attend will have positions available that suit your skills or interests. However, the recruiters there might be looking for someone like you in the future.<\/p>\n<p>Take the time to speak briefly with recruiters and employers at the fair who are connected to your professional field or a company that you like. Even a brief chat, and a handshake, will make you more memorable than any phone call or email. This means you are more likely to come to mind when a suitable position becomes vacant. And if you apply for a job in the future, or follow up on your job fair visit, they will recall your in-person conversation.<\/p>\n<p>It always matters when a candidate shows genuine interest and is willing to make an effort.<\/p>\n<p>In addition to meeting official recruiters at the fair, you can also meet other job seekers who might have information about opportunities in your field. So don’t just talk to the people behind the tables and booths.<\/p>\n<p>If you are attending job fairs, remember that they are professional environments. Treat them as you would a formal interview. Wear formal clothes and shoes, and bring multiple copies of your updated <a href=\"https:\/\/cultivatedculture.com\/resume-templates\/\" target=\"_blank\" rel=\"noopener noreferrer\">résumé<\/a> and business cards (which you can use <a href=\"https:\/\/venngage.com\/templates\/business-cards\" target=\"_blank\" rel=\"noopener noreferrer\">business card templates<\/a> to create).<\/p>\n<p>Remember to ask for business cards from everyone you meet. You might not follow up with everyone you spoke to, but it is good to have their details for future networking opportunities.<\/p>\n<h4>New Contacts: How to Follow Up<\/h4>\n<p>You do not have to follow up with every person you speak to at networking events.<\/p>\n<p>But you should follow up if you made a sincere connection, or if a potential job referral or interview is imminent. And it’s important for you to follow up in the right way.<\/p>\n<p>First, it’s important to collect business cards or ask for contact information while you are networking. You might also want to make your own notes about your conversation later the same day. It can be difficult to remember every single person you meet and what you liked about them, especially if you attend a busy meetup event or job fair. Staying organized is key. This will help you keep names and titles straight, and it will help you refer to specific points about your conversation when you reconnect with that person when you follow up.<\/p>\n<p>(Remember: Your contact probably also spoke to a lot of people at the event when you met. It is useful to gently remind them of who you were by referring to your conversation. This also shows that you were paying attention and respected their time. These are both reasons that prove you are a standout job candidate.)<\/p>\n<p>Making an impression goes beyond your initial interactions with people. It is a process. After you have attended an event and met someone, you want them to remember you. The most common way to follow up is to send a <a href=\"https:\/\/blog.mailshake.com\/networking-follow-up-email\/\" target=\"_blank\" rel=\"noopener noreferrer\">networking follow-up email<\/a> within 48 hours of speaking to them.<\/p>\n<p>If you truly made a connection, and if you feel like it would be appropriate, your next step might be to request another meeting in person with your new contact. (You might want to see how they reply to your follow-up email, first.) If you feel comfortable moving forward, suggest meeting at an event or activity that you will both enjoy. Specifically, this is why it helps to get to know someone and learn about their interests before talking about jobs or asking for favors.<\/p>\n<p>Remember not to be too insistent. If they don’t want to meet up, perhaps they didn’t get as much from the interaction as you did. Leave the invitation open, but reply to their response with understanding and grace. There will always be someone else that you can meet with instead.<\/p>\n<h4>Are They Interested? How to Tell<strong> <\/strong><\/h4>\n<p>How can you tell if a new contact is interested in moving forward?<\/p>\n<p>For new immigrants, this can be particularly challenging. You may face a language barrier, and cultural differences might make it hard to read body language when you meet in person. You can also miss subtleties in tone when it comes to online communications.<\/p>\n<p>However, learning how to listen and gauge someone’s interest is a basic requirement of human interaction. And it is massively important for immigrants trying to network. Plus, it will help you when you do secure a job and enter the workforce.<\/p>\n<p>Primarily, you will learn the most by engaging in social engagements as often as possible and paying attention to others. Listeners are generally more appreciated than talkers—yes, even in the United States! Listening is also an excellent way to understand people. This will also let you watch their body language to see if it agrees with what they are saying, so you can start to truly gauge their interest.<\/p>\n<p>Listening closely will make it easier for you to continue conversations with people at a later date. You can absorb enough information to make your future interactions more meaningful.<\/p>\n<p>Additionally, being a good listener makes you more likable—which means the people you want to network with will also want to spend time with you. And thus, your network will grow.<\/p>\n<h4>Join a Professional Association<\/h4>\n<p>It can be difficult for immigrants to know where to start networking. However, there are some professional organizations that focus on bringing immigrants together with mentors.<\/p>\n<p>Immigrant organizations and newcomer centers are prime places for networking. They host a number of events with experts and provide resources and advice to new immigrants.<\/p>\n<p>In most areas of North America, you should also be able to find professional associations related to your intended profession—from <a href=\"https:\/\/knowledge.wes.org\/globaltalentbridge-eguide-career-pathways-in-engineering-using-your-foreign-education-in-the-united-states.html\" target=\"_blank\" rel=\"noopener noreferrer\">engineering<\/a> to <a href=\"https:\/\/knowledge.wes.org\/GlobalTalentBridge-eguide-career-pathways-in-accounting-using-your-foreign-education-in-the-united-states.html\" target=\"_blank\" rel=\"noopener noreferrer\">accounting<\/a>, from <a href=\"https:\/\/knowledge.wes.org\/GlobalTalentBridge-Eguide-Career-Pathways-Nursing.html\" target=\"_blank\" rel=\"noopener noreferrer\">health care<\/a> to <a href=\"https:\/\/knowledge.wes.org\/globaltalentbridge-e-guide-career-pathways-in-information-technology.html\" target=\"_blank\" rel=\"noopener noreferrer\">IT<\/a>.<\/p>\n<p>If you join a professional network, you can meet people in your field who will share tips for entering the industry, such as getting a <a href=\"https:\/\/knowledge.wes.org\/wesadvisor-webinar-archive-the-lifetime-value-of-a-wes-credential-evaluation.html\" target=\"_blank\" rel=\"noopener noreferrer\">credential equivalency report<\/a>. They can also provide advice for either finding a title similar to the role you had back home or one that makes the most of your <a href=\"https:\/\/www.wes.org\/advisor-blog\/transferable-skills-to-build-your-career\/\" target=\"_blank\" rel=\"noopener noreferrer\">transferable skills<\/a>.<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/building-resilience-professional-networking\/\" target=\"_blank\" rel=\"noopener noreferrer\">Build Resilience Through Professional Networking<\/a><\/p><\/blockquote>\n<h4>Network on Social Media<\/h4>\n<p>Today, everyone is using social media. As a new immigrant, you should be <a href=\"https:\/\/vyper.io\/blog\/12-social-media-marketing-strategies-you-should-use-in-2019\/\" target=\"_blank\" rel=\"noopener noreferrer\">optimizing your social media to expand your network<\/a>.<\/p>\n<p>In the United States, every professional uses LinkedIn for social networking. It is essential that you create a <a href=\"https:\/\/blog.lempod.com\/12-linkedin-profile-tips\/\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn profile<\/a> and regularly update your skills, work experience, and education.<\/p>\n<p>With an updated LinkedIn account, you can start looking for jobs on the platform and connect with recruiters in your industry. You can also learn about who you already know who is connected to people in your field.<\/p>\n<p>It’s best to try to build connections with people on LinkedIn before telling them that you want a job—this is a longer process, but it will be more fruitful. You should also consider joining groups on LinkedIn that are related to your profession and your interests. This will make networking easier.<\/p>\n<p>However, LinkedIn is not the only place where you need to work on your social media presence.<\/p>\n<p>The same goes for Facebook: Joining groups in your field will help you connect with people who could eventually help you land a job. On Twitter, follow industry experts and professionals in your field. They might post about new job openings at their companies or in related organizations.<\/p>\n<p>Beyond the realm of social media, there are also a variety of <a href=\"https:\/\/www.tamoco.com\/blog\/ultimate-app-monetization-guide\/\" target=\"_blank\" rel=\"noopener noreferrer\">mobile apps<\/a> that are designed for networking. Apps like Meetup, Shapr, and Eventbrite are free to join and can help you find groups, events, and people that have the same interests as you.<\/p>\n<p>These can be used beyond the professional realm, which will make networking even easier. You can undertake activities for fun but end up getting hired by one of your new friends (or one of their contacts).<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/personal-brand-social-media\/\" target=\"_blank\" rel=\"noopener noreferrer\">Build Your Personal Brand on Social Media<\/a><\/p><\/blockquote>\n<h4>Continue Your Education<\/h4>\n<p>If you have just arrived in the country and need to find a job, you might be hesitant to suspend your job search or spend money on academic courses.<\/p>\n<p>But investing in your education is a good idea for some new immigrants in the U.S. This can be a good way to <a href=\"https:\/\/www.wes.org\/advisor-blog\/transferable-skills-career-success\/\" target=\"_blank\" rel=\"noopener noreferrer\">bridge your skills<\/a>, meet people, and stand out to employers.<\/p>\n<p>At a college or university, you will meet people who are interested in your field of work and might already have some experience. You will also have access to the school’s <a href=\"https:\/\/www.wes.org\/advisor-blog\/job-search-tips-career-adviser\/\" target=\"_blank\" rel=\"noopener noreferrer\">career advisers<\/a> and career centers, as well as other resources for newcomers to the U.S.<\/p>\n<p>Additionally, as an international student, you might have access to scholarships or <a href=\"https:\/\/knowledge.wes.org\/WESAdvisor-Webinar-Archive-Securing-Financial-Aid.html\" target=\"_blank\" rel=\"noopener noreferrer\">financial aid<\/a> that can reduce the cost of tuition.<\/p>\n<p>For some <a href=\"https:\/\/www.wes.org\/advisor-blog\/regulated-and-non-regulated-professions\/\" target=\"_blank\" rel=\"noopener noreferrer\">regulated professions<\/a>, continuing your education is necessary to continue working in your field. You might need to take a few courses to earn your equivalent license in the U.S.<\/p>\n<blockquote><p>Get the Free E-Guide<\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/wesadvisor-eguide-professional-development-strategies.html\" target=\"_blank\" rel=\"noopener noreferrer\">Professional Development Strategies<\/a><\/p><\/blockquote>\n<h4>Volunteering and Mentorship<\/h4>\n<p>As a new immigrant, the best way to meet people—and to eventually get a job—is to volunteer.<\/p>\n<p><a href=\"https:\/\/blog.purplepass.com\/find-and-hire-volunteers-using-these-4-programs\" target=\"_blank\" rel=\"noopener noreferrer\">Volunteering is a very popular activity<\/a> in North America, and many successful professionals volunteer for at least one organization at some point in their professional development track.<\/p>\n<p>There are several ways that you can volunteer. You can offer your services to a nonprofit organization or participate in a group that doesn’t pay (for example, a community garden). You can do work related to your professional interests. Or you can join an organization that isn’t directly related to your field, simply to give back to the community. Some companies have a list of organizations that their staff already works with as part of an established volunteer program.<\/p>\n<p>Another option is to pursue <a href=\"https:\/\/www.wes.org\/advisor-blog\/definition-of-mentorship\/\" target=\"_blank\" rel=\"noopener noreferrer\">mentoring<\/a>. You will need to find someone who is more established and well-connected in your field of work who is willing to dedicate their time to your professional development.<\/p>\n<p>Your mentor might not be able to help you find a position directly. But they can help you determine where you need to work on your skills, determine a career direction, learn what titles to pursue, and connect you with other professionals. Often, these individuals were mentored in the past and want to pass along the knowledge they gained. One day, if you are mentored, you might wish to mentor an up-and-coming professional in your field.<\/p>\n<p>Whether you pursue volunteering or mentoring, you will have the chance to meet new people within the scope of your work and beyond. This will help your social and professional networking.<\/p>\n<h4>In Conclusion<\/h4>\n<p>Networking is a great way to meet new people once you arrive in the U.S. More importantly, this is the primary way that professionals in this country find jobs.<\/p>\n<p>However, you must remember to network with purpose. You don’t need to just meet new people; you need to actually get to know them.<\/p>\n<p>Diversify your interests and keep your social media updated to reach more people. After you make new contacts, make sure you follow up.<\/p>\n<p>The networking tips in this article will help you expand your circle of friends and colleagues. But they will also help you improve your confidence and integrate more with your local community.<\/p>\n<p>Lastly, it is importantly to remember that this process does not end when you get a job. These networking tips will have a lasting impact on your overall success.<\/p>\n<p>Everything you learn during this process will help you fit into your company culture, <a href=\"https:\/\/knowledge.wes.org\/canada-on-demand-how-to-connect-with-employers.html\" target=\"_blank\" rel=\"noopener noreferrer\">impress your boss<\/a>, and accomplish your goals once you are hired. Good luck!<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/100-tips-for-immigrants\/?section=advisor-featured\">100 Tips for Immigrants<\/a><\/p><\/blockquote>\n","protected":false},"featured_media":21554,"comment_status":"closed","ping_status":"closed","template":"","format":"standard","advisor_categories":[200],"advisor_tags":[75,446,435,5,478],"better_featured_image":{"id":21554,"alt_text":"networking","caption":"","description":"","media_type":"image","media_details":{"width":635,"height":424,"file":"2019\/12\/iStock-524387548-e1576176428860.jpg","sizes":{"medium":{"file":"iStock-524387548-e1576176428860-300x200.jpg","width":300,"height":200,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860-300x200.jpg"},"thumbnail":{"file":"iStock-524387548-e1576176428860-150x150.jpg","width":150,"height":150,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860-150x150.jpg"},"team":{"file":"iStock-524387548-e1576176428860-185x185.jpg","width":185,"height":185,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860-185x185.jpg"},"people":{"file":"iStock-524387548-e1576176428860-394x276.jpg","width":394,"height":276,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860-394x276.jpg"},"insight":{"file":"iStock-524387548-e1576176428860-541x362.jpg","width":541,"height":362,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860-541x362.jpg"},"large":{"file":"iStock-524387548-1024x683.jpg","width":1024,"height":683,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-1024x683.jpg"},"medium_large":{"file":"iStock-524387548-768x512.jpg","width":768,"height":512,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-768x512.jpg"},"1536x1536":{"file":"iStock-524387548-1536x1024.jpg","width":1536,"height":1024,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-1536x1024.jpg"},"2048x2048":{"file":"iStock-524387548-2048x1366.jpg","width":2048,"height":1366,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-2048x1366.jpg"}},"image_meta":{"aperture":"5","credit":"Getty Images","camera":"NIKON D800","caption":"Happy young businesswoman shaking hands with male customer in office.","created_timestamp":"1461678631","copyright":"baona","focal_length":"50","iso":"200","shutter_speed":"0.0166666666667","title":"Businesswoman shaking hands","orientation":"1","keywords":["White Collar Worker","Businesswoman","Young Women","Women","Females","Men","Males","Two People","Copy Space","Job Interview","Young Adult","Adult","Smiling","Handshake","Talking","Sitting","Customer","Beauty","Chinese Ethnicity","Asian Ethnicity","Meeting","Cooperation","Discussion","Communication","Agreement","Happiness","Confidence","Face To Face","Business","Selective Focus","Indoors","Cheerful","Sales Occupation","Manager","Business Person","Financial Advisor","Occupation","People","Day","Window","Office","Place of Work","Interview","Suit","Well-dressed","Desk","Table","beautiful woman","Corporate Business"]}},"post":21553,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg"},"acf":{"author_name":"Ronita Mohan","author":{"ID":20839,"post_author":"42","post_date":"2019-10-31 13:25:09","post_date_gmt":"2019-10-31 17:25:09","post_content":"Ronita Mohan is a Content Marketer at Venngage.","post_title":"Ronita Mohan","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"ronita-mohan","to_ping":"","pinged":"","post_modified":"2020-02-03 11:43:29","post_modified_gmt":"2020-02-03 16:43:29","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=20839","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"},"external_contributor":true},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Networking Tips for Immigrants<\/title>\n<meta name=\"description\" content=\"Networking: It&#039;s the most important part of your job search. Here are the tips new immigrants need to know to successfully network in the U.S.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Networking Tips for Immigrants\" \/>\n<meta property=\"og:description\" content=\"Networking: It&#039;s the most important part of your job search. Here are the tips new immigrants need to know to successfully network in the U.S.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2020-01-08T16:21:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"635\" \/>\n\t<meta property=\"og:image:height\" content=\"424\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/\",\"url\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/\",\"name\":\"Networking Tips for Immigrants\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg\",\"datePublished\":\"2019-12-24T18:47:52+00:00\",\"dateModified\":\"2020-01-08T16:21:14+00:00\",\"description\":\"Networking: It's the most important part of your job search. Here are the tips new immigrants need to know to successfully network in the U.S.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg\",\"width\":635,\"height\":424,\"caption\":\"networking\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Advisor Blog\",\"item\":\"https:\/\/www.wes.org\/advisor-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Networking Tips for Immigrants\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Networking Tips for Immigrants","description":"Networking: It's the most important part of your job search. Here are the tips new immigrants need to know to successfully network in the U.S.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/","og_locale":"en_US","og_type":"article","og_title":"Networking Tips for Immigrants","og_description":"Networking: It's the most important part of your job search. Here are the tips new immigrants need to know to successfully network in the U.S.","og_url":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/","og_site_name":"World Education Services","article_modified_time":"2020-01-08T16:21:14+00:00","og_image":[{"width":635,"height":424,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/","url":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/","name":"Networking Tips for Immigrants","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg","datePublished":"2019-12-24T18:47:52+00:00","dateModified":"2020-01-08T16:21:14+00:00","description":"Networking: It's the most important part of your job search. Here are the tips new immigrants need to know to successfully network in the U.S.","breadcrumb":{"@id":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/12\/iStock-524387548-e1576176428860.jpg","width":635,"height":424,"caption":"networking"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/advisor-blog\/networking-tips-immigrants\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Advisor Blog","item":"https:\/\/www.wes.org\/advisor-blog\/"},{"@type":"ListItem","position":3,"name":"Networking Tips for Immigrants"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/21553"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/advisor_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=21553"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/21553\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/21554"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=21553"}],"wp:term":[{"taxonomy":"advisor_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_categories?post=21553"},{"taxonomy":"advisor_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_tags?post=21553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}