{"id":18207,"date":"2019-06-12T14:49:49","date_gmt":"2019-06-12T18:49:49","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=advisor_blog&#038;p=18207"},"modified":"2020-01-10T14:05:29","modified_gmt":"2020-01-10T19:05:29","slug":"tips-to-avoid-visa-scams","status":"publish","type":"advisor_blog","link":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/","title":{"rendered":"10 Tips to Avoid Visa Scams in the U.S."},"content":{"rendered":"<p>Are you planning to further your education or seek employment in the United States?<\/p>\n<p>It is possible to make your dreams come true—but there are also a lot of people who might try to take advantage of you along the way. Criminals have gotten very sophisticated about creating legal and financial traps that can prevent you from obtaining a visa and fulfilling your goals.<\/p>\n<p>Learning about common scams is the best way to avoid the mistakes that might ruin your future.<\/p>\n<p>Here are 10 of the most common visa scams, as well as tips to avoid them:<\/p>\n<h4><strong>1. Educate yourself about the Diversity Immigrant Visa Program. <\/strong><\/h4>\n<p>The <a href=\"https:\/\/travel.state.gov\/content\/travel\/en\/us-visas\/immigrate\/diversity-visa-program-entry.html\" target=\"_blank\" rel=\"noopener noreferrer\">Diversity Immigrant Visa Program<\/a> (DV Program) is a unique program that is only available to citizens of countries that have traditionally low rates of migration to the U.S. If you qualify, you can pursue additional online resources and start the application process. Keep in mind that there is no cost to apply for the DV Program—so any website or individual that tries to charge you is probably running a scam.<\/p>\n<p>Because DV Program candidates are selected randomly from among those who apply, using “visa consultants” is no guarantee of success. Paid agents can help you complete the online application form, and locate credible information about the program, but you must complete the next step yourself. That is an interview, and it will take place at your local embassy or consulate. When you complete your interview, you will receive a confirmation number. You will use it to continue monitoring your application. Be aware of the limitations of paid visa consultants if you are applying to the DV Program.<\/p>\n<p>Learn more about these steps and this visa opportunity at <a href=\"https:\/\/travel.state.gov\/content\/travel\/en\/us-visas\/immigrate\/diversity-visa-program-entry.html\" target=\"_blank\" rel=\"noopener noreferrer\">Travel.State.Gov<\/a>.<\/p>\n<h4><strong>2. Consider that you are fully accountable for your own actions. <\/strong><\/h4>\n<p>You can only get a student visa if you testify that your reason for entering the United States is to go to school; you must also promise to comply with immigration authorities. The choices you make once you get here are your responsibility—which means that making mistakes can jeopardize your visa.<\/p>\n<p>For example, you will not be able to claim ignorance if it turns out that the school you enroll in is not a legitimate institution. You need to make sure you are enrolling in a legitimate, <a href=\"https:\/\/ope.ed.gov\/dapip\/#\/home\" target=\"_blank\" rel=\"noopener noreferrer\">accredited<\/a> institution before you arrive. The U.S. Department of Homeland Security recently set up fake universities as part of undercover attempts to expose visa fraud. According to news reports, both recruiters and students were detained by Immigration and Customs Enforcement. Students could have been deported if it was determined that they were at fault for participating in this scam.<\/p>\n<blockquote><p>Watch Now: Get Verified Credentials<\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/canada-on-demand-how-to-use-a-credential-evaluation-for-education-employment-licensing.html\">How to Use Your Credential Evaluation<\/a><\/p><\/blockquote>\n<h4><strong>3. Beware of fake schools—or “visa mills.”<\/strong><\/h4>\n<p>As the tip above mentioned, it is your responsibility to verify the credibility of the school you are hoping to attend. There is a very common scam where a fake company poses as a college in order to attract international students. This setup is known as a “visa mill.&#8221;<\/p>\n<p>These fraudulent organizations claim to be accredited schools, but their real aim is to take money from people who are desperate for student visas. You might even think that a school seems suspicious, but decide to apply anyway as long as it still counts toward a student visa. This is not a good idea, since using that real visa to attend a fake school is actually a crime in the United States.<\/p>\n<p>One possible consequence for any student who is found guilty of deliberately using one of these fake companies is deportation—so make sure the school you want to attend is legitimate and can legally accept international students.<\/p>\n<p>Red flags include not being able to find comprehensive information about classes online, not easily locating information about student organizations or alumni, and not being able to make direct contact with various relevant personnel.<\/p>\n<p>Learn more about this scam in our research article: &#8220;<a href=\"https:\/\/wenr.wes.org\/2017\/12\/diploma-mills-9-strategies-for-tackling-one-of-higher-educations-most-wicked-problems\">Diploma Mills: 9 Strategies for Tackling One of Higher Education&#8217;s Most Wicked Problems<\/a>.&#8221;<\/p>\n<h4><strong>4. Fulfill the obligations of your specific visa category.<\/strong><\/h4>\n<p>The main visa categories for students coming to the U.S. are: F, J, and M.<\/p>\n<p>The <strong>F-1 visa<\/strong> is for those planning to attend an accredited institution full time. That institution must be authorized by the U.S. government to accept international students. Such students are not allowed to work off-campus during their first academic year; however, they can work on campus for a limited number of hours each week. There are other conditions as well. For example, after the first year of study, international full-time students can accept only specific categories or types of employment. Employed or not, they must maintain their student status.<\/p>\n<p>The <strong>J-1 classification<\/strong> is also popularly known as the visa for exchange visitors. According to <a href=\"https:\/\/www.uscis.gov\/working-united-states\/students-and-exchange-visitors\/exchange-visitors\" target=\"_blank\" rel=\"noopener noreferrer\">U.S. Citizenship and Immigration Services (USCIS)<\/a>, the J-1 allows international persons into the U.S. to participate in specifically approved programs “for the purpose of teaching, instructing or lecturing, studying, observing, conducting research, consulting, demonstrating special skills, receiving training, or to receive graduate medical education or training.” The J-1 is a nonimmigrant visa classification. At the end of the program, the J-1 visa holder must return home, as the lawful period of stay has ended.<\/p>\n<p>The <strong>M-1 visa<\/strong> type is for vocational or other non-academic study. Any employment must be authorized in advance and relate to the specific area of study.<\/p>\n<p>The visa process is controlled by the U.S. government, but the sponsoring entity (for example, an employer) is expected to assist in all the various steps, including providing documentary proof. Carefully read and understand the terms of your visa. Not every student visa holder is entitled to work in the U.S.<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/f-1-visa-interview\/\">Preparing for the F-1 Visa Interview<\/a><\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/employment-options-students-f-1-visa\/\">Employment Options for Students on the F-1 Visa<\/a><\/p><\/blockquote>\n<h4><strong>5. Be wary of resources that promise you a positive outcome.<\/strong><\/h4>\n<p>It is impossible to predict the outcome of an application for a student, work, or immigrant visa.<\/p>\n<p>Many factors go into a successful application. Sometimes additional documents are requested at the last minute to aid in making a final determination. Wait periods vary widely between form types and individual circumstances—and these cannot be influenced by outside specialists.<\/p>\n<p>If you are being asked to pay large sums of money, ostensibly to ensure success, that is a red flag. Always beware of outcome-focused scams.<\/p>\n<h4><strong>6. Make use of free resources.<\/strong><\/h4>\n<p>U.S. embassies, U.S. government offices, and many local libraries offer free resources on current scholarships, grants, fellowships, and other opportunities. If you are coming to the U.S. for school, you can also consult with resources on-campus.<\/p>\n<p>Another valuable resource is the USCIS <a href=\"https:\/\/www.uscis.gov\/\">website<\/a>, which offers a lot of information about visa types. All immigration forms are available for free download through the site. However, they do update forms and information regularly, so check the site often. Never pay to receive copies of immigration forms. Beware of anyone offering to sell you information that is freely available from USCIS.<\/p>\n<h4><strong>7. Do not put cost and speed above common sense.<\/strong><\/h4>\n<p>International students sometimes put their trust in people or organizations that promise rapid results. They want the promises that these organizations make to be true so badly that they trust them—and pay them—even against their better judgment.<\/p>\n<p>Some people can actually help connect students with support, resources, and processing; and their prices might seem low. However, they may fail to communicate important information, such as the fact that visa fees are non-refundable, and that there are related costs (for example, the cumulative costs of getting documentation copied and notarized, getting overseas education assessed by accredited agencies, and so on).<\/p>\n<p>Though they are not running a scam, they are not trustworthy sources of information, either. Students might do better by choosing an advisor or organization that costs more up-front, because they are more honest about how much processing a visa can cost.<\/p>\n<blockquote><p>More Information: Read the E-Guide<\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/WESAdvisor-Eguide-Funding-Your-Education.html\">Funding Your Education<\/a><\/p><\/blockquote>\n<h4><strong>8. Explore your options early on. <\/strong><\/h4>\n<p>If you think you would like to remain in the U.S. after completing your studies, it is important to explore your options early. Some options are time sensitive, such as seeking asylum. Others might require a waiver from the government in your home country.<\/p>\n<p>To change from one student visa category to another, you must apply and submit many required documents. The institution you attend cannot arbitrarily change your visa’s terms and conditions, so make sure you are getting the best, most accurate advice where this is concerned.<\/p>\n<p>Your school’s office for International Student and Scholar Services should be able to either provide guidance or put you in contact with someone who can handle your specific situation.<\/p>\n<h4><strong>9. Avoid sharing personal information.<\/strong><\/h4>\n<p>Do not disclose information about your personal identity or pay fees without thoroughly checking that the request is legitimate. You might start getting emails from unscrupulous sites saying that they can expedite the visa process as soon as you send certain information or pay certain fees. (If you have already seen messages like this, do not believe them. Only U.S. immigration authorities can control the speed with which they complete applications.)<\/p>\n<p>Of course there are also traditional threats that everyone faces, like identity fraud and financial theft—so it does not hurt to be overly cautious as you prepare to move or study abroad. When it comes to applying for student visas, arranging for transportation, and working with schools, you will be working with numerous institutions that are unfamiliar; you might even be communicating in a second language. Find a secure place, like a physical folder or online spreadsheet, to keep track of the names of people and companies with whom you are already working or may need to contact at a later date. Then you will know if someone you’ve never heard of is suddenly reaching out to you.<\/p>\n<p>There may also be scam artists using the names of real companies, so be sure to look up people’s names, titles, and even email addresses online before trusting that they are who they say they are—especially if they are asking for money or making promises that sound too good to be true.<\/p>\n<h4><strong>10. Do your research—but trust your instincts.<\/strong><\/h4>\n<p>If there is a last piece of advice to offer, it would be this: Trust your instincts.<\/p>\n<p>When all else fails, you can usually trust your own intuition to lead you away from scam artists and toward the more ethical, rational choices that will help you pursue a successful path in the U.S.<\/p>\n<blockquote><p>Next Steps: Watch the Webinar<\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/wesadvisor-webinar-archive-us-undergraduate-admissions-for-international-students.html\">U.S. Undergraduate Admissions for International Students<\/a><\/p><\/blockquote>\n","protected":false},"featured_media":18221,"comment_status":"closed","ping_status":"closed","template":"","format":"standard","advisor_categories":[548],"advisor_tags":[397,485,5,471],"better_featured_image":{"id":18221,"alt_text":"visa scams","caption":"","description":"","media_type":"image","media_details":{"width":635,"height":422,"file":"2019\/06\/iStock-637192206-e1560190876600.jpg","sizes":{"medium":{"file":"iStock-637192206-e1560190876600-300x199.jpg","width":300,"height":199,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600-300x199.jpg"},"thumbnail":{"file":"iStock-637192206-e1560190876600-150x150.jpg","width":150,"height":150,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600-150x150.jpg"},"team":{"file":"iStock-637192206-e1560190876600-185x185.jpg","width":185,"height":185,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600-185x185.jpg"},"people":{"file":"iStock-637192206-e1560190876600-394x276.jpg","width":394,"height":276,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600-394x276.jpg"},"insight":{"file":"iStock-637192206-e1560190876600-541x362.jpg","width":541,"height":362,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600-541x362.jpg"},"medium_large":{"file":"iStock-637192206-768x510.jpg","width":768,"height":510,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-768x510.jpg"},"large":{"file":"iStock-637192206-1024x680.jpg","width":1024,"height":680,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-1024x680.jpg"}},"image_meta":{"aperture":"2.8","credit":"Getty Images","camera":"Canon EOS 6D","caption":"young asian man student with sweater holding mobile in library","created_timestamp":"1483442047","copyright":"gong hangxu","focal_length":"150","iso":"100","shutter_speed":"0.005","title":"young asian man student holds mobile phone","orientation":"1","keywords":["Male Beauty","Student","Portrait","Men","Males","Hands-free Device","Computer Network","Electron","Global Communications","Music","Young Adult","Smiling","Massaging","Holding","Headset","Chinese Ethnicity","Japanese Ethnicity","Asian Ethnicity","Communication","Confidence","Modern","Education","Technology","Science","Lifestyles","Indoors","Side View","Human Hand","Library","School Building","Campus","University","Book","Internet","Mobile Phone","Telephone","Equipment","Drink","Eyeglasses","Bag","Sweater"]}},"post":18207,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg"},"acf":{"author_name":"Nadine C. Atkinson-Flowers","author":{"ID":14751,"post_author":"86","post_date":"2018-12-21 19:24:27","post_date_gmt":"2018-12-22 00:24:27","post_content":"Nadine C. Atkinson-Flowers practices law in Jamaica and is an immigration attorney in the U.S. She is also an Expert Ambassador for WES.","post_title":"Nadine C. Atkinson-Flowers","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"nadine-c-atkinson-flowers","to_ping":"","pinged":"","post_modified":"2020-02-03 13:32:01","post_modified_gmt":"2020-02-03 18:32:01","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=14751","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"},"external_contributor":true},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Tips to Avoid Visa Scams in the U.S. - World Education Services (WES)<\/title>\n<meta name=\"description\" content=\"Want to work or study in the United States? Don&#039;t miss your chance because of a visa scam. Learn 10 common visa scams, and tips to avoid them.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Tips to Avoid Visa Scams in the U.S.\" \/>\n<meta property=\"og:description\" content=\"Want to work or study in the United States? Don&#039;t miss your chance because of a visa scam. Learn 10 common visa scams, and tips to avoid them.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2020-01-10T19:05:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"635\" \/>\n\t<meta property=\"og:image:height\" content=\"422\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/\",\"url\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/\",\"name\":\"10 Tips to Avoid Visa Scams in the U.S. - World Education Services (WES)\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg\",\"datePublished\":\"2019-06-12T18:49:49+00:00\",\"dateModified\":\"2020-01-10T19:05:29+00:00\",\"description\":\"Want to work or study in the United States? Don't miss your chance because of a visa scam. Learn 10 common visa scams, and tips to avoid them.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg\",\"width\":635,\"height\":422,\"caption\":\"visa scams\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Advisor Blog\",\"item\":\"https:\/\/www.wes.org\/advisor-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"10 Tips to Avoid Visa Scams in the U.S.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"10 Tips to Avoid Visa Scams in the U.S. - World Education Services (WES)","description":"Want to work or study in the United States? Don't miss your chance because of a visa scam. Learn 10 common visa scams, and tips to avoid them.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/","og_locale":"en_US","og_type":"article","og_title":"10 Tips to Avoid Visa Scams in the U.S.","og_description":"Want to work or study in the United States? Don't miss your chance because of a visa scam. Learn 10 common visa scams, and tips to avoid them.","og_url":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/","og_site_name":"World Education Services","article_modified_time":"2020-01-10T19:05:29+00:00","og_image":[{"width":635,"height":422,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/","url":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/","name":"10 Tips to Avoid Visa Scams in the U.S. - World Education Services (WES)","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg","datePublished":"2019-06-12T18:49:49+00:00","dateModified":"2020-01-10T19:05:29+00:00","description":"Want to work or study in the United States? Don't miss your chance because of a visa scam. Learn 10 common visa scams, and tips to avoid them.","breadcrumb":{"@id":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/06\/iStock-637192206-e1560190876600.jpg","width":635,"height":422,"caption":"visa scams"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/advisor-blog\/tips-to-avoid-visa-scams\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Advisor Blog","item":"https:\/\/www.wes.org\/advisor-blog\/"},{"@type":"ListItem","position":3,"name":"10 Tips to Avoid Visa Scams in the U.S."}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[{"locale":"zh_CN","id":19173,"post_title":"避免在美国遭遇签证骗局的 10 个小贴士","href":"https:\/\/www.wes.org\/zh-hans\/tips-to-avoid-visa-scams\/"}],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/18207"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/advisor_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=18207"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/18207\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/18221"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=18207"}],"wp:term":[{"taxonomy":"advisor_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_categories?post=18207"},{"taxonomy":"advisor_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_tags?post=18207"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}