{"id":18937,"date":"2019-07-18T09:50:42","date_gmt":"2019-07-18T13:50:42","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=advisor_blog&#038;p=18937"},"modified":"2020-11-05T16:47:46","modified_gmt":"2020-11-05T21:47:46","slug":"scholarships-loans-international-students","status":"publish","type":"advisor_blog","link":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/","title":{"rendered":"Scholarships and Loans for International Students in the U.S."},"content":{"rendered":"<p>Pursuing a degree in the United States is expensive. That is well known if you already live in the country—but the steep costs of higher education can be especially prohibitive for international students.<\/p>\n<p>WES Advisor spoke with Maureen Klovers, Director of Social Impact at MPOWER Financing, about some of the financial challenges that international students face. Below, she offers advice that can help international students overcome financial barriers to make their dreams a reality.<\/p>\n<h4>Do You Need to Be a U.S. Citizen to Receive Financial Aid?<\/h4>\n<p><strong>Maureen:<\/strong> Only permanent residents qualify for federal Sallie Mae loans in the United States. The interest rate on a Sallie Mae loan is quite low, so if you and your parent(s) are permanent residents, you should definitely explore this option. Unfortunately, this option is not available for immigrants or international students.<\/p>\n<p>International students are also unable to qualify for most need-based financial aid programs. However, some universities will award merit-based scholarships to international students. In addition, many universities will allow international students, particularly graduate students, to serve as research or teaching assistants. These positions often cover tuition and award participants with a small stipend to help cover basic living expenses.<\/p>\n<p>Finally, both undergraduate and graduate students may work up to 20 hours a week. These hours are typically completed as on-campus “work-study” jobs. Assistantships and <a href=\"https:\/\/www.wes.org\/advisor-blog\/finding-an-on-campus-job\/\">on-campus jobs<\/a> are great ways to reduce the costs of attending college in the United States. Plus, the experience will be a great addition to your CV!<\/p>\n<h4>Do International Student Scholarships Exist—and How Can I Get One?<\/h4>\n<p><strong>Maureen:<\/strong> There are several scholarships available to international students. You will have to put forth a little extra effort, though, as they are relatively rare and hard to find. MPOWER offers several <a href=\"https:\/\/www.mpowerfinancing.com\/scholarships\/\" target=\"_blank\" rel=\"noopener noreferrer\">scholarships exclusively for international students<\/a>. In addition to our company’s options, I also highly recommend <a href=\"https:\/\/www.iefa.org\/scholarships\" target=\"_blank\" rel=\"noopener noreferrer\">IEFA<\/a> and <a href=\"https:\/\/www.fastweb.com\/college-scholarships\" target=\"_blank\" rel=\"noopener noreferrer\">FastWeb<\/a>, which provide access to 1.5 million scholarships worth $3.4 billion USD. Try entering your school, your degree\/major, and your country of origin as search terms.<\/p>\n<p>Here are two important tips:<\/p>\n<ol>\n<li>First, seek scholarships for which you will be a competitive candidate. Look for opportunities with very narrow eligibility criteria; if you qualify, you will find yourself competing against a much smaller pool.<\/li>\n<li>Next, write an amazing essay! If English is not your primary language, have a native English speaker proofread your essay before you submit it. As a scholarship provider, I cannot tell you how many poorly written essays we receive (along with many terrific ones, of course). Great work really does stand out from the rest!<\/li>\n<\/ol>\n<blockquote><p><strong>Read the Free E-Guide!<\/strong><\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/WESAdvisor-Eguide-Funding-Your-Education.html\">Funding Your Education in the U.S.<\/a><\/p><\/blockquote>\n<h4>Many Banks and Private Lenders Will Not Work with International Students. Why?<\/h4>\n<p><strong>Maureen:<\/strong> Traditional banks and private lenders see international students as too risky for their business model. That’s because nearly all international students (and most immigrants) do not possess the three things that banks use to assess their risk.<\/p>\n<p>The three typical criteria for a loan are:<\/p>\n<ul>\n<li><strong>Credit scores:<\/strong> A high credit score means the applicant has a history of making timely payments on debt. Therefore, they are more likely to do so in the future. Banks avoid loaning money to people with either a poor credit score or no credit score. In many countries, credit scores are not tracked. And U.S. banks often are unable to access or accept credit reports from other countries. (As a helpful hint, credit scores might also be called “FICO scores” in the U.S.)<\/li>\n<li><strong>Collateral:<\/strong> Traditional banks lend only when an applicant has collateral with a value equal to (or generally exceeding) the amount loaned. Collateral is an asset, such as a home, car, or other piece of personal property. A piece of collateral can be pledged against the loan and then seized by the bank if the applicant fails to make payments. If the borrower fails to make payments, the bank can seize the asset, sell it, and recoup its losses. As we have stated, higher education in the U.S. can be very expensive—so the families of students from developing countries typically do not have enough collateral to cover the value of the loan. However, even if they do, U.S. banks find it legally difficult to seize property in a foreign country, which means the collateral arrangement simply does not work.<\/li>\n<li><strong>Cosigner:<\/strong> If someone does not have enough collateral or established credit history, banks might accept a cosigner. Cosigners are individuals with good credit or collateral who are willing to verify a loan recipient’s trustworthiness—essentially, they state that they are so confident of the borrower’s integrity, they are willing to pay the person’s debt if the individual defaults. Cosigners are often used to authorize education loans; they are typically the student’s parents. But this is not usually an option for international students because banks are looking for in-country cosigners with significant assets.<\/li>\n<\/ul>\n<p>If you do not meet any of these loan criteria, it does not mean you cannot get a loan in the U.S.<\/p>\n<p>For example, MPOWER turned this model on its head. We do look at credit scores when available—but we do not penalize students who have no credit. We also do not require collateral or a cosigner. Instead, we estimate each student’s future earning potential and offer loans based on their future ability to pay. We may also consider a student’s major and their existing GPA. Good students who are training to work in high-demand fields are often excellent candidates for a loan.<\/p>\n<blockquote><p><strong>What Is Your U.S. GPA?<\/strong><\/p>\n<p><a href=\"https:\/\/applications.wes.org\/igpa-calculator\/\">Find Out: Try the iGPA Calculator<\/a><\/p><\/blockquote>\n<h4>What Are Other Ways International Students Can Secure Financing for School?<\/h4>\n<p><strong>Maureen:<\/strong> To finance their futures, most international students have to rely on friends and family.<\/p>\n<p>They usually pay for study abroad through a mix of:<\/p>\n<ul>\n<li>Gifts or loans from family members<\/li>\n<li>Personal savings, often from working several years between undergraduate and graduate studies<\/li>\n<li>Loans from banks in their home country (although these banks typically require collateral, so this is usually only an option for students from middle-upper and upper-income families)<\/li>\n<li>Scholarships (see below)<\/li>\n<li>Loans from innovative student lenders in North America, like MPOWER Financing<\/li>\n<\/ul>\n<p>It might help to know that MPOWER is the only lender that provides fixed-rate, no-cosigner loans to international students. In fact, U.S. News and World Report rated our product as <a href=\"https:\/\/loans.usnews.com\/student-loans\" target=\"_blank\" rel=\"noopener noreferrer\">the best loan for international students<\/a>.<\/p>\n<h4>Are Undocumented Immigrants Eligible for Financial Aid, Loans, and Scholarships?<\/h4>\n<p><strong>Maureen:<\/strong> Yes, undocumented immigrants are eligible for financial aid, loans, and scholarships. However, it is much more difficult for them to find and qualify for these resources.<\/p>\n<p>Here are a few tips that can help undocumented immigrants find financial aid:<\/p>\n<ul>\n<li>Check if you live in one of the <a href=\"https:\/\/www.ncsl.org\/research\/immigration\/tuition-benefits-for-immigrants.aspx\" target=\"_blank\" rel=\"noopener noreferrer\">17 states and territories that offer in-state tuition<\/a> to undocumented students enrolled in public universities. In some cases, undocumented immigrants in those regions might also qualify for university-funded financial aid.<\/li>\n<li>Contact your intended university’s Office for Undocumented Student Services. Not all universities have these, and sometimes they have different names, but they are great resources.<\/li>\n<li>Check out scholarships available from <a href=\"https:\/\/www.thedream.us\/scholarships\/\" target=\"_blank\" rel=\"noopener noreferrer\">us<\/a>, <a href=\"https:\/\/collegetrack.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">College Track<\/a>, and <a href=\"https:\/\/www.goldendoorscholars.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Golden Door Scholars<\/a>.<\/li>\n<li>All of <a href=\"https:\/\/www.mpowerfinancing.com\/scholarships\" target=\"_blank\" rel=\"noopener noreferrer\">MPOWER’s scholarship programs<\/a> are available to students who qualify under “Deferred Action for Childhood Arrivals” (DACA). Consider applying if you have DACA status.<\/li>\n<\/ul>\n<h4>What Is a Good Interest Rate, How Much Should You Borrow, and How Long Should It Take to Pay Back?<\/h4>\n<p><strong>Maureen:<\/strong> Great question. But the short answer to all three parts is actually: “It depends.”<\/p>\n<p>A “good interest rate” will vary according to your situation. If you do not have collateral or a cosigner, 12 percent is a good interest rate. But if you do, you can probably get a much lower interest rate. Regardless, you should always try to secure the lowest interest rate possible.<\/p>\n<p>A longer repayment period is generally better, too, as this will keep your monthly payments lower; however, you will want to pay off the loan early if you find the means. You might be able to save hundreds or thousands of dollars in interest payments.<\/p>\n<hr \/>\n<p style=\"border: 3px solid #1f9055; padding: 1em; text-align: center;\"><strong><u>Example: How Student Loan Interest Rates Work<\/u><\/strong><\/p>\n<p>Let’s pretend you borrow $20,000 USD at a 12 percent annual interest rate.<\/p>\n<p>We can say that the loan term or repayment period is 10 years. In this case, your monthly payment would be $286.94 USD.<\/p>\n<p>But remember, there are two parts to every monthly payment:<\/p>\n<ul>\n<li><strong>Principal: <\/strong>a portion of the actual amount borrowed<\/li>\n<li><strong>Interest: <\/strong>the money the lender earns from the loan<\/li>\n<\/ul>\n<p>The first month, your interest payment will be $200 USD and your principal repayment will be $86.94 USD. The next month, your interest payment will be slightly lower: Now the 12 percent is calculated based on the remaining balance of $19,913.06 USD.<\/p>\n<p>Each month, more of your $286.94 USD will go toward paying off the principal portion of the loan.<\/p>\n<p>This trend continues throughout the life of the loan. At the beginning of the loan, you are paying mostly interest; at the end, you are paying mostly principal.<\/p>\n<p>Now, let’s consider what happens if you get a terrific job and pay off your loan after three years:<\/p>\n<p>At the end of 36 months, with a fixed monthly loan payment of $286.94 USD, you will have paid off $6,584.74 USD in interest. If you pay off the remaining principal balance of $16,254.90 USD, you will not have to make any more payments.<\/p>\n<p>But if you continue on your current schedule, you will pay an additional $7,848.50 USD in interest as you pay off those $286.94 USD increments!<\/p>\n<p>In three years, you will have paid back $26,584.74 USD on your $20,000 USD student loan. For many people, that’s a worthwhile amount to obtain an education in the United States. But in 10 years, you will have paid back $34,433.24 USD. That is a significantly higher amount.<\/p>\n<p>Just remember: It is always in your best interest to pay off your balance early!<\/p>\n<hr \/>\n<p>The key to understanding loan options is to focus on what your monthly payments will be—in school and after you graduate—and ask yourself if you will be able to afford these payments. One note of caution, though: if a lender is offering a variable interest rate, you will not be able to estimate future payments.<\/p>\n<hr \/>\n<p style=\"border: 3px solid #1f9055; padding: 1em; text-align: center;\"><strong><u>About Variable Interest Rates<\/u><\/strong><\/p>\n<p>Variable interest rates change based on market fluctuations. They are determined by two components:<\/p>\n<ul>\n<li>the<strong> benchmark<\/strong><\/li>\n<li>the<strong> spread<\/strong><\/li>\n<\/ul>\n<p>Lenders usually peg the &#8220;benchmark&#8221; to an index, such as the <a href=\"https:\/\/www.investopedia.com\/terms\/l\/libor.asp\" target=\"_blank\" rel=\"noopener noreferrer\">London Interbank Offered Rate (LIBOR)<\/a>. Your &#8220;spread&#8221; might be 7 percent. In this case, your variable interest rate would be quoted as “<strong>LIBOR + 7%<\/strong>.” The means if LIBOR is 4 percent, then your interest rate is 11 percent—which might not sound bad, compared to a fixed rate of 12 percent. But if LIBOR shoots up to 7 percent, your interest rate will be 14 percent!<\/p>\n<hr \/>\n<p>On the other hand, a fixed rate means you will always pay the same interest rate, so you will know exactly what your loan payments will be. That’s why we recommend a fixed-interest rate loan (which is the only kind of loan we provide).<\/p>\n<h4>What Is the Most Important Advice for International Students Seeking Financial Aid?<\/h4>\n<p><strong>Maureen:<\/strong> The most important piece of advice is simply to understand what you are agreeing to before you commit to any financial arrangements. Be realistic about your abilities to pay back a loan, and make sure that you do everything possible to earn yourself a scholarship that can save you thousands of dollars.<\/p>\n<p>Although finding financial aid can be a tedious process, it can also reward you with life-altering opportunities. It is important to understand your options as an international student and be sure you understand the terms and conditions to which you are agreeing. This is especially important in a new country, where you might be working with lenders or bankers who do not speak your primary language.<\/p>\n<p>Information is the key to success when it comes to taking out loans as an international student. We hope that some of the information provided here will help you locate financial aid and scholarships so that you can pursue a degree at the college or university of your choice in the United States.<\/p>\n<p>Good luck!<\/p>\n<blockquote><p><strong>Next: Explore Student Loans in Canada<\/strong><\/p>\n<p><a href=\"https:\/\/knowledge.wes.org\/wesa-e-guide-financial-aid-at-canadian-universities-and-colleges.html\">Financial Aid at Canadian Colleges and Universities<\/a><\/p><\/blockquote>\n","protected":false},"featured_media":19092,"comment_status":"closed","ping_status":"closed","template":"","format":"standard","advisor_categories":[135],"advisor_tags":[448,480,397,5],"better_featured_image":{"id":19092,"alt_text":"loans for international students","caption":"","description":"","media_type":"image","media_details":{"width":635,"height":423,"file":"2019\/07\/iStock-953632560-e1563205784879.jpg","sizes":{"medium":{"file":"iStock-953632560-e1563205784879-300x200.jpg","width":300,"height":200,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879-300x200.jpg"},"thumbnail":{"file":"iStock-953632560-e1563205784879-150x150.jpg","width":150,"height":150,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879-150x150.jpg"},"team":{"file":"iStock-953632560-e1563205784879-185x185.jpg","width":185,"height":185,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879-185x185.jpg"},"people":{"file":"iStock-953632560-e1563205784879-394x276.jpg","width":394,"height":276,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879-394x276.jpg"},"insight":{"file":"iStock-953632560-e1563205784879-541x362.jpg","width":541,"height":362,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879-541x362.jpg"},"medium_large":{"file":"iStock-953632560-768x512.jpg","width":768,"height":512,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-768x512.jpg"},"large":{"file":"iStock-953632560-1024x683.jpg","width":1024,"height":683,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-1024x683.jpg"}},"image_meta":{"aperture":"5","credit":"Getty Images\/iStockphoto","camera":"Canon EOS 5DS R","caption":"Handshake of african american male apprentice after job interview at office of company","created_timestamp":"1521130263","copyright":"","focal_length":"73","iso":"400","shutter_speed":"0.005","title":"Handshake of african american male apprentice after job interview","orientation":"1","keywords":[]}},"post":18937,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg"},"acf":{"author_name":"WES Advisor","author":{"ID":3295,"post_author":"10","post_date":"2017-04-14 17:53:55","post_date_gmt":"2017-04-14 17:53:55","post_content":"WES Advisor is an initiative of World Education Services, a non-profit organization with over 45 years of experience in international education. We provide advice and resources for international students and skilled immigrants to help them make informed decisions about education, employment, immigration, and integration opportunities in the U.S. and Canada.","post_title":"WES Advisor","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"wes-advisor","to_ping":"","pinged":"","post_modified":"2020-02-03 14:41:12","post_modified_gmt":"2020-02-03 19:41:12","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=3295","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"},"external_contributor":false},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Scholarships and Loans for International Students in the U.S.<\/title>\n<meta name=\"description\" content=\"You don&#039;t need to be rich to study abroad in the United States. Find scholarships and loans for international students. Here&#039;s what you need to know...\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Scholarships and Loans for International Students in the U.S.\" \/>\n<meta property=\"og:description\" content=\"You don&#039;t need to be rich to study abroad in the United States. Find scholarships and loans for international students. Here&#039;s what you need to know...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2020-11-05T21:47:46+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"635\" \/>\n\t<meta property=\"og:image:height\" content=\"423\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/\",\"url\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/\",\"name\":\"Scholarships and Loans for International Students in the U.S.\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg\",\"datePublished\":\"2019-07-18T13:50:42+00:00\",\"dateModified\":\"2020-11-05T21:47:46+00:00\",\"description\":\"You don't need to be rich to study abroad in the United States. Find scholarships and loans for international students. Here's what you need to know...\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg\",\"width\":635,\"height\":423,\"caption\":\"loans for international students\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Advisor Blog\",\"item\":\"https:\/\/www.wes.org\/advisor-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Scholarships and Loans for International Students in the U.S.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Scholarships and Loans for International Students in the U.S.","description":"You don't need to be rich to study abroad in the United States. Find scholarships and loans for international students. Here's what you need to know...","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/","og_locale":"en_US","og_type":"article","og_title":"Scholarships and Loans for International Students in the U.S.","og_description":"You don't need to be rich to study abroad in the United States. Find scholarships and loans for international students. Here's what you need to know...","og_url":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/","og_site_name":"World Education Services","article_modified_time":"2020-11-05T21:47:46+00:00","og_image":[{"width":635,"height":423,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/","url":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/","name":"Scholarships and Loans for International Students in the U.S.","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg","datePublished":"2019-07-18T13:50:42+00:00","dateModified":"2020-11-05T21:47:46+00:00","description":"You don't need to be rich to study abroad in the United States. Find scholarships and loans for international students. Here's what you need to know...","breadcrumb":{"@id":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2019\/07\/iStock-953632560-e1563205784879.jpg","width":635,"height":423,"caption":"loans for international students"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/advisor-blog\/scholarships-loans-international-students\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Advisor Blog","item":"https:\/\/www.wes.org\/advisor-blog\/"},{"@type":"ListItem","position":3,"name":"Scholarships and Loans for International Students in the U.S."}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[{"locale":"zh_CN","id":19727,"post_title":"在美国际学生的奖学金和贷款","href":"https:\/\/www.wes.org\/zh-hans\/scholarships-loans-international-students\/"}],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/18937"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/advisor_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=18937"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/18937\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/19092"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=18937"}],"wp:term":[{"taxonomy":"advisor_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_categories?post=18937"},{"taxonomy":"advisor_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_tags?post=18937"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}