{"id":2834,"date":"2016-09-29T16:21:18","date_gmt":"2016-09-29T16:21:18","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=advisor_blog&#038;p=2834"},"modified":"2020-01-08T12:23:31","modified_gmt":"2020-01-08T17:23:31","slug":"ace-a-video-or-phone-interview","status":"publish","type":"advisor_blog","link":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/","title":{"rendered":"How to Ace a Video or Phone Interview"},"content":{"rendered":"<p>Congratulations! After successfully submitting an application with a beautifully written <a href=\"https:\/\/www.wes.org\/advisor-blog\/how-to-write-a-great-cover-letter\/\">cover letter<\/a> and <a href=\"https:\/\/www.wes.org\/advisor-blog\/12-tips-writing-effective-resume\/\">résumé<\/a>, a recruiter or HR professional has requested an initial phone or video interview with you. Although it can be easy to become overwhelmed by the prospect of an interview, by following these steps, you can effectively prepare yourself, and ensure that you ace it.<\/p>\n<h4>Find a Suitable Location<\/h4>\n<p>One of the most important tasks you can do in preparation for your interview with a potential employer is ensuring you are in an environment that promotes the best experience possible. You should be in a quiet setting with minimal or no background noise. If you are currently working, schedule a break during the time of your phone call, and try to take your call in a conference or break room, or if you have a car on the premises, take the phone call there. Many libraries also have study rooms you can reserve, which can also be a good place to take calls if you book it ahead of time<\/p>\n<p>For a video interview, you want to be mindful of what the interviewer is going to see in the background. You should have a neutral background or something that promotes positivity and productivity, like a room with blank white walls, or an office setting. A background with posters of rock bands wouldn’t be a good choice. A friend of mine who was once interviewing to be a librarian did a Skype interview. For her background, she had a series of bookshelves–it was a rather creative idea.<\/p>\n<h4>Test Your Equipment<\/h4>\n<p>Before your scheduled phone call or video interview, make sure the equipment you will be using works. Test out Skype with a friend to make sure there are no Internet connection issues on your end. If you’re using headphones, test them out (especially if they are Bluetooth)–make sure you can hear the person on the other end and that they can hear you as well. If you are doing a Skype call, check the web camera. Do a practice interview with a friend or a family member so he or she can give you feedback on how you sound, how you sit, how the background looks, etc. If your Skype username is unprofessional, you should probably either change it or create a new one that is more professional. If all goes well, then you are ready for the interview!<\/p>\n<h4>Do Your Prep Work<\/h4>\n<p>The best part about a phone or video interview is that you can technically “cheat.” Before the interview, have your résumé on hand in case you need to rely on it to explain your experience or map out how your skills relate to the job you are interviewing for. Be sure to research the company and have a brief summary written so you don’t blank out when the interviewer asks you about the company. When doing your research, jot down a few questions about the company (it’s always good to have a couple of questions prepared so that you have something to ask the interviewer).<\/p>\n<p>It’s also a good idea to research some of the most common questions recruiters and HR professionals ask during phone interviews. If you type out the answers beforehand and print it out, it can be a great point of reference. About 15 minutes before the interview, review the questions and the answers you want to provide. But remember, your “cheat sheet” is there for you as a backup; the goal is to answer the questions without reading off the paper, so you sound more natural and conversational.<\/p>\n<p>If you are doing a video interview, avoid constantly looking down at a piece of paper in an effort to make eye contact. Instead, here’s a little trick: Get a large LINED post-it note pad. Write out your interview answers and talking points beforehand and stick these notes along the edges of your computer. That way, you have a point of reference at eye-level. Make sure the notes are not covering any part of your camera.<\/p>\n<p>Finally, dress like you are going to an actual in-person interview. Wear professional clothes such as a nice button down shirt or blouse with professional pants or a skirt. You might be tempted to wear just a professional looking top and leave your pajama bottoms on for maximum comfort, but you should wear a professional outfit to prepare for all contingencies, and also get you in a professional mindset. What if you have to stand during the video interview to retrieve something or adjust the camera? You would look like quite the goofball in a mismatched outfit.<\/p>\n<p>One other factor you have to consider when doing a video interview is lighting. Find lighting that shows you well you don’t want anything too dark but you also don’t want anything too bright either. If possible, pick a place that has adequate sunlight; natural light is more becoming than fluorescent lighting.<\/p>\n<p>Five minutes before the video interview, the best thing you can do is mentally prepare yourself. Breathe deeply, meditate, or look at something funny—anything to relax you. Once you are relaxed, you can let the conversation flow more freely. Disable any potential distractions such as ringers on your phone, outside sounds, and any noisy programs on your computer (social media sites, music sites, etc.). Have a glass of water nearby in case your mouth or throat gets dry.<\/p>\n<h4>During the Interview<\/h4>\n<p>The first question the interviewer is almost always going to ask is “is this still a good time to talk?” He or she is making small talk in order to help calm your nerves. Once that is out of the way, the interviewer will probably start by asking you about your work history. For this, it is a good idea to start from the beginning and work your way to your most current experiences. That way, you are showing them how much you have progressed in your career and how you got to where you are today. For each position, point out a specific achievement that you take great pride in.<\/p>\n<p>During the phone interview, remember to speak into the receiver, and be careful to not breathe into the phone (it creates a lot of feedback). If you are a fast talker, slow down. The answers you provide should be brief but detailed. And smile when you’re on the phone! Believe it or not, it does make a difference in your tone of voice. Remember the questions asked and provide full answers. It can be easy to go off on a tangent about unrelated topics, so keep yourself in check. The best way to respond to a question is to answer straightaway and pad it with an example.<\/p>\n<p><strong>For example:<\/strong><\/p>\n<p>Question: Have you ever made a big mistake at work?<\/p>\n<p>Answer: Yes. When I was with the John Doe Consulting company, I provided a client<br \/>\nwith the wrong information without checking on the accuracy of the statement. This<br \/>\nmisinformation led to thousands of dollars lost for the client. To put it mildly, he<br \/>\nwas not happy. I apologized profusely and quickly rectified the situation the best I<br \/>\ncould. Moving forward, I always double- or even triple-check the accuracy of my<br \/>\ninformation and try to think ahead in terms of the impact the information I’m<br \/>\nsharing might have.<\/p>\n<p>The answer above is informative, brief, and most importantly, it answers the question in more ways than one.<\/p>\n<p>When answering questions during a video interview, look directly at the interviewer and not at the mini-screen in the corner that shows your side of the video. If you are easily distracted, minimize or close your mini-screen. Remember, a video interview is like an actual interview–you want to give the impression of eye contact. If it is a panel interview, look at each person when answering the questions. The purpose of this action is to ensure that everyone is engaged. Convey your enthusiasm for the position by smiling, gesturing (not overwhelmingly so), and providing examples to connect your experience with the company’s mission. Acknowledge that you are actively listening by nodding once in a while, and following up with a clarifying question, or summarizing what you heard to confirm the content.<\/p>\n<p>During the interview, be sure not to mention anything about where you are from, what your relationship status is, whether you have kids, what your age is, and any other personal details about yourself that you would not typically share with a stranger.<\/p>\n<p>At the end of the interview, it’s best to have a few of your own questions lined up. Ask about the company, the staff, the culture, any specifics about the responsibilities of the position, the environment, the reporting structure, and finally, ask, “What are the next steps? If I don’t hear from you by next week, would it be okay to follow up with you?” At this point in time it is too early to ask about the salary ranges for the position and the benefits, so save those questions for a later time.<\/p>\n<h4>Take Care of Post-Interview Tasks<\/h4>\n<p>You are finally done with the interview. Congratulations! Now you can relax. Drink some water, change into more comfortable clothes, and breathe a sigh of relief because that was a huge undertaking you just went through.<\/p>\n<p>Send a follow-up email to the interviewer expressing your gratitude for his or her time. Mention that you are thankful, reiterate how interested you are in the position, and further emphasize why you believe you are a good fit for the role.<\/p>\n<p><strong>For example:<\/strong><\/p>\n<p><em>Hello Jane,<\/em><\/p>\n<p><em>Thank you so much for taking time out of your busy schedule to speak with me today.<\/em><br \/>\n<em>It was an absolute pleasure. I enjoyed learning more about the role and the<\/em><br \/>\n<em>company.<\/em><\/p>\n<p><em>After speaking with you today, I have more confidence that I am a great fit for the<\/em><br \/>\n<em>position of accounting clerk. My supervisors have praised me for my high levels of<\/em><br \/>\n<em>accuracy, my eye for detail, and my ability to pick up new information quickly. I<\/em><br \/>\n<em>would be honored to bring those skills and more to this position.<\/em><\/p>\n<p><em>Please feel free to reach out to me for further questions. I look forward to hearing<\/em><br \/>\n<em>from you again.<\/em><\/p>\n<p><em>Best regards,<\/em><br \/>\n<em>John Doe<\/em><\/p>\n<p>Typically, the recipient of the email will not respond; however, you can count on the fact that they look for the “thank you” emails.<\/p>\n<p>If you have not heard from the recruiter or HR professional in a couple of days, it is perfectly okay to follow up with them via email. However, it is not okay to follow up with them every single day. Some companies’ recruiting processes are slower than others, so it could take a while for them to get back to you.<\/p>\n<p>You will not always get an invitation for a face-to-face interview after every phone\/video interview you have. You will receive some rejections, but don’t worry because this is perfectly normal. Although it may be disappointing, it ultimately may not be a good fit for you, and the company just did you a favor. Take every rejection in stride, and think of every phone or video interview you go into as practice for the perfect company. Eventually, you will find a match that is ideal for both sides.<\/p>\n<p><strong>Common Questions Recruiters and HR Professionals Ask<\/strong><\/p>\n<ul>\n<li>Tell me about yourself.<\/li>\n<li>Why do you want to leave your current position?<\/li>\n<li>Always respond positively (i.e., I love this company but I am ready to move on to a bigger company with advancement opportunities).<\/li>\n<li>Why did you choose this field?<\/li>\n<li>Where do you see yourself in five or ten years?<\/li>\n<li>The recruiters are testing your longevity and loyalty. Are you able to stick with a company for a long time once hired?<\/li>\n<li>What are your greatest strengths? What are your greatest weaknesses?\n<ul>\n<li>It’s so easy to brag about your strengths. It is so difficult to state a weakness that doesn’t make you look like a less-than-ideal candidate. No matter what, do not ever say you are “too much of a perfectionist” or “you work too hard.” The recruiters are looking for a more human side of you and want to know that you are aware of your weaknesses and willing to work on them.<\/li>\n<\/ul>\n<\/li>\n<li>Please describe your ideal work environment.<\/li>\n<li>Do you prefer working in groups or working alone?<\/li>\n<li>I would suggest saying that you are adaptable and flexible so you can do both with no problem.<\/li>\n<li>How familiar are you with <em>XYZ<\/em> software\/system?<\/li>\n<li>What do you know about this company?\n<ul>\n<li>I have said this before and I will say it again–always do your research beforehand.<\/li>\n<\/ul>\n<\/li>\n<li>Why do you want to work for us? What can you bring to the table?<\/li>\n<li>What are your salary expectations?\n<ul>\n<li>It’s always best to give them a minimum salary. Additionally, state that you are open to negotiations.<\/li>\n<\/ul>\n<\/li>\n<li>If hired, how soon can you start?<\/li>\n<\/ul>\n<p>If you are interested in opportunities at World Education Services, check out the following resources:<\/p>\n<ul>\n<li>Visit the <a href=\"https:\/\/www.wes.org\/careers-at-wes\/\" target=\"_blank\" rel=\"noopener noreferrer\">WES Job Portal<\/a><\/li>\n<\/ul>\n","protected":false},"featured_media":4420,"comment_status":"open","ping_status":"closed","template":"","format":"standard","advisor_categories":[200],"advisor_tags":[75,407],"better_featured_image":{"id":4420,"alt_text":"A woman conduction a phone interview","caption":"close-up of a businesswoman wearing a headset","description":"","media_type":"image","media_details":{"width":635,"height":423,"file":"2016\/09\/blog_20160929_56381269.jpg","sizes":{"medium":{"file":"blog_20160929_56381269-300x200.jpg","width":300,"height":200,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-300x200.jpg"},"thumbnail":{"file":"blog_20160929_56381269-150x150.jpg","width":150,"height":150,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-150x150.jpg"},"testimonial-thumb":{"file":"blog_20160929_56381269-90x90.jpg","width":90,"height":90,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-90x90.jpg"},"carousel-post-thumb":{"file":"blog_20160929_56381269-540x277.jpg","width":540,"height":277,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-540x277.jpg"},"team":{"file":"blog_20160929_56381269-185x185.jpg","width":185,"height":185,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-185x185.jpg"},"people":{"file":"blog_20160929_56381269-394x276.jpg","width":394,"height":276,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-394x276.jpg"},"insight":{"file":"blog_20160929_56381269-541x362.jpg","width":541,"height":362,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269-541x362.jpg"}},"image_meta":{"aperture":"0","credit":"Getty Images\/Stockbyte","camera":"","caption":"close-up of a businesswoman wearing a headset","created_timestamp":"0","copyright":"","focal_length":"0","iso":"0","shutter_speed":"0","title":"56381269","orientation":"1","keywords":[]}},"post":2834,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg"},"acf":{"author_name":"Annie Paul","author":{"ID":3441,"post_author":"10","post_date":"2017-04-18 18:11:53","post_date_gmt":"2017-04-18 18:11:53","post_content":"Annie Paul is the Senior Human Resources Generalist at World Education Services.","post_title":"Annie Paul","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"annie-paul","to_ping":"","pinged":"","post_modified":"2020-02-03 14:35:59","post_modified_gmt":"2020-02-03 19:35:59","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=3441","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"},"external_contributor":true},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Ace a Video or Phone Interview - World Education Services<\/title>\n<meta name=\"description\" content=\"It can be easy to become overwhelmed by the prospect of a phone or video interview, following these steps and you can ensure that you ace it.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Ace a Video or Phone Interview\" \/>\n<meta property=\"og:description\" content=\"It can be easy to become overwhelmed by the prospect of a phone or video interview, following these steps and you can ensure that you ace it.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2020-01-08T17:23:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"635\" \/>\n\t<meta property=\"og:image:height\" content=\"423\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/\",\"url\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/\",\"name\":\"How to Ace a Video or Phone Interview - World Education Services\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg\",\"datePublished\":\"2016-09-29T16:21:18+00:00\",\"dateModified\":\"2020-01-08T17:23:31+00:00\",\"description\":\"It can be easy to become overwhelmed by the prospect of a phone or video interview, following these steps and you can ensure that you ace it.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg\",\"width\":635,\"height\":423,\"caption\":\"close-up of a businesswoman wearing a headset\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Advisor Blog\",\"item\":\"https:\/\/www.wes.org\/advisor-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"How to Ace a Video or Phone Interview\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How to Ace a Video or Phone Interview - World Education Services","description":"It can be easy to become overwhelmed by the prospect of a phone or video interview, following these steps and you can ensure that you ace it.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/","og_locale":"en_US","og_type":"article","og_title":"How to Ace a Video or Phone Interview","og_description":"It can be easy to become overwhelmed by the prospect of a phone or video interview, following these steps and you can ensure that you ace it.","og_url":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/","og_site_name":"World Education Services","article_modified_time":"2020-01-08T17:23:31+00:00","og_image":[{"width":635,"height":423,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/","url":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/","name":"How to Ace a Video or Phone Interview - World Education Services","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg","datePublished":"2016-09-29T16:21:18+00:00","dateModified":"2020-01-08T17:23:31+00:00","description":"It can be easy to become overwhelmed by the prospect of a phone or video interview, following these steps and you can ensure that you ace it.","breadcrumb":{"@id":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2016\/09\/blog_20160929_56381269.jpg","width":635,"height":423,"caption":"close-up of a businesswoman wearing a headset"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/advisor-blog\/ace-a-video-or-phone-interview\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Advisor Blog","item":"https:\/\/www.wes.org\/advisor-blog\/"},{"@type":"ListItem","position":3,"name":"How to Ace a Video or Phone Interview"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/2834"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/advisor_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=2834"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/2834\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/4420"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=2834"}],"wp:term":[{"taxonomy":"advisor_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_categories?post=2834"},{"taxonomy":"advisor_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_tags?post=2834"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}