{"id":8762,"date":"2017-09-12T18:26:30","date_gmt":"2017-09-12T18:26:30","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=advisor_blog&#038;p=8762"},"modified":"2020-01-27T14:04:21","modified_gmt":"2020-01-27T19:04:21","slug":"hr-manager-hiring-process","status":"publish","type":"advisor_blog","link":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/","title":{"rendered":"Ask a Human Resources Manager: The Hiring Process"},"content":{"rendered":"<p>As a job seeker, it can often feel like you are on the outside looking in during the hiring process. To help shed some light on what happens from the employer’s side of things, we sat down with World Education Services’ very own Tanika Clouden. Tanika recently joined WES Canada as the human resources (HR) manager and HR business partner to evaluation services in the WES Canada office.<\/p>\n<p>Tanika joined WES from Pearson, Canada, where she spent 11 years developing her skills and acquired a passion for talent acquisition and management. Tanika earned a bachelor’s degree in sociology from the University of Toronto, and holds a master’s degree in management and strategic leadership from New England College. She also has a graduate certificate in HR management from Seneca College.<\/p>\n<p>As a human resources professional, Tanika serves as a link between management and employees, providing specialized services to all staff members. Her main goal is to foster positive relationships, increase job satisfaction, and ensure all customer or client needs are met while strengthening the company goals and values—all while striving for effective growth.<\/p>\n<p>Keep reading to find out more about the hiring process, the difference between human resources and a hiring manager, and why company culture is often more important than country differences.<\/p>\n<h4>Let’s start at the beginning of a typical hiring process by talking about résumés. As an HR manager, what are the most common ways résumés end up on your desk?<\/h4>\n<p>In 2017, you can get résumés from so many sources. We get them from <a href=\"https:\/\/www.indeed.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Indeed<\/a>, <a href=\"https:\/\/www.monster.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Monster<\/a>, <a href=\"https:\/\/www.careerbuilder.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">CareerBuilder<\/a>—all of the traditional sites. We also utilize <a href=\"https:\/\/www.linkedin.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn<\/a> for more senior roles, especially roles that will eventually have direct reports. In the past, I have also used <a href=\"https:\/\/twitter.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter<\/a> and <a href=\"https:\/\/www.instagram.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram<\/a> for social media roles, those marketing roles that tend to be more creative and require more fluency with those tools. I’ve seen people apply for jobs through messages on <a href=\"https:\/\/www.facebook.com\/\">Facebook<\/a>, but more so for entry level roles. It really all depends on the type of role we are posting for. Of course, for larger companies—companies where people really know the brand—you’ll get a lot from your own website and career portal. Again, it all depends on the industry.<\/p>\n<p>Once all these résumés have come through these different platforms, we look at whether the applicant has the skill set listed in the job description. We ask ourselves, “Does this person, from LinkedIn, from Twitter, from our own website, have the basic skills from that job description provided by the hiring manager?” If they do, they make the long list that we then go through to come up with the short list which we will present to the hiring manger.<\/p>\n<p>Typically, talent acquisition is handled by human resources first and then we will pass candidates on to the hiring manager. You aren’t really going to get in front of the hiring manager without that combined partnership between the hiring manager and human resources.<\/p>\n<h4>Can you tell us a little bit about the difference between a hiring manager and a human resources manager?<\/h4>\n<p>You know, I get this question a lot! It helps to think about it in terms of the hiring manager being the leader of the team, the direct supervisor of the role being advertised. The hiring manager really has the final say on the new hire, and who will eventually be reporting to them. As a human resources manager, I can share my opinions on which candidates I would recommend, but the hiring manager doesn’t always have to take my advice.<\/p>\n<p>We both have a responsibility in the hiring process, but we work as a team to ensure the best candidate for the company joins the team.<\/p>\n<h4>It is important for job seekers to be aware of the partnership between HR and the hiring manager, but is often overlooked by eager applicants. Do you feel that candidates can lose out on opportunities by ignoring this partnership? For example, if there are specific instructions for how to respond to a job posting, can it reflect negatively on a candidate if they disregard those instructions and try to move in their own channels?<\/h4>\n<p>When people disregard instructions and try to do things their own way, it really shows me as a human resources manager that this person isn’t paying attention to the details and following the correct process. That is the key.<\/p>\n<p>Applicants aren’t aware of all the conversations that those in human resources have with the hiring manager as to why something is posted internally or why we’d want them to apply through specific portals. We have reasons for giving applicants different directions about how to apply for a position; how people follow instructions in the hiring process often tells us how they might respond to instruction as an employee.<\/p>\n<p>There are also ethical reasons for why we accept applications through specific channels. We want to make sure things are equitable, fair, and transparent. The hiring process can tell you a lot about an organization. In a good hiring process, there isn’t a situation where a hiring manager would be independently selecting and hiring an applicant without feedback and input from human resources.<\/p>\n<h4>Let’s talk a little bit about what happens once a job seeker has submitted their résumé. We hear a lot from people that they get frustrated by a lack of engagement from companies once they have applied for a position. What is the average response time a person should expect once they have submitted a résumé?<\/h4>\n<p>Really, it can take a month, it can take six months. I’ve hired for senior director level roles where we know it is going to take a longer period of time to go through applicants and determine who to reach out to, but there are also entry-level roles that we need only two weeks to fill. It all depends on how in depth we are going in our hiring process and the requirements for each role.<\/p>\n<h4>So it is important for applicants to remember that there IS a hiring process.<\/h4>\n<p>Exactly. We are assessing the skills sets against the job description, against the fit and the culture of the organization, and against the needs of the hiring manager. Each hiring manager has a specific vision of who they need to fill their role and often they are looking for a very narrow cookie cutter outline of that person. Humans aren’t cookie cutters, and it is our job in human resources to help the hiring manager identify and recognize those transferable skills that they might not be thinking about.<\/p>\n<p>Response times can also depend on the number of responses we get on each posting. The volume of the applications we receive continues to grow because it is a tough job market and a lot of people are applying for anything and everything they see. As the volume of applicants grows, the time it takes for us to look through them all grows too. A lot of applicants also expect an immediate response…but it takes time for us to find the right fit, the right person.<\/p>\n<h4>Have you ever seen promising candidates lose out on roles because of their response to the length of a hiring process?<\/h4>\n<p>You know, I have, definitely. People get frustrated or impatient and then start to make a bad impression on the ones making the hiring decision. My goal in a good hiring process is to set applicants up for success and let them know what the hiring process is going to look like. I want to make sure I am engaging the talent that I have identified as being in the top tier of applicants. As a job seeker, it is also important to consider what the closing date is on each position you are applying for. If you apply for something that doesn’t close for another month, you need to give the employer some time to get back to you. They might not be sending out immediate responses if they have a specific timeline they are working toward.<\/p>\n<h4>Our audience on WES Advisor is a mix of skilled immigrants and international students. What practical advice can you share for job seekers who are trying to find work in a new country with a different culture around work and hiring?<\/h4>\n<p>I think it is most important to think about things in terms of “global” and “local.” The steps in a hiring process tend to be relatively similar everywhere you go, but it’s the atmosphere and the culture that is different. For example, in New York, a more aggressive approach to a job search might be more welcome than in Toronto, but each company is also different. When an individual is searching, it is important to research and get a feel for the organization they are applying to.<\/p>\n<h4>There is such a focus on cultural differences between countries; is it more useful to focus on the culture of each company you are applying to?<\/h4>\n<p>Yes, understanding company culture is key. There are so many organizations that you could be working for, and each one has a different style and environment…a different culture. Google isn’t WES, WES isn’t Bell, Bell isn’t Verizon. Company differences are always going to be more impactful on a job search than differences an individual might notice based on their experience working in other countries.<\/p>\n<h4>Excellent points, especially for a skilled immigrant for whom it can be intimidating to search for a new job in an unfamiliar environment. Thinking about your job search on a company-by-company basis can make the whole process much more manageable than trying to figure out the entire Canadian or American labour market all at once. Thank you for sharing your insights, Tanika.<\/h4>\n<p>Thank you!<\/p>\n<p>If you enjoyed reading this article, please be sure to check back next month for our next installment of “Ask an HR Manager.” You can submit questions for this column to <a href=\"mailto:gtbcanada@wes.org\">gtbcanada@wes.org<\/a>.<\/p>\n<blockquote><p>Related Reading<\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/12-tips-writing-effective-resume\">12 Tips for Writing an Effective Résumé<\/a><\/p>\n<p><a href=\"https:\/\/www.wes.org\/advisor-blog\/how-to-write-a-great-cover-letter\">How to Write a Great Cover Letter<\/a><\/p><\/blockquote>\n","protected":false},"featured_media":8763,"comment_status":"open","ping_status":"closed","template":"","format":"standard","advisor_categories":[200],"advisor_tags":[75,435],"better_featured_image":{"id":8763,"alt_text":"hiring process","caption":"","description":"","media_type":"image","media_details":{"width":635,"height":423,"file":"2017\/09\/blog_20170912-iStock-537540846.jpg","sizes":{"medium":{"file":"blog_20170912-iStock-537540846-300x200.jpg","width":300,"height":200,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-300x200.jpg"},"thumbnail":{"file":"blog_20170912-iStock-537540846-150x150.jpg","width":150,"height":150,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-150x150.jpg"},"testimonial-thumb":{"file":"blog_20170912-iStock-537540846-90x90.jpg","width":90,"height":90,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-90x90.jpg"},"carousel-post-thumb":{"file":"blog_20170912-iStock-537540846-540x277.jpg","width":540,"height":277,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-540x277.jpg"},"team":{"file":"blog_20170912-iStock-537540846-185x185.jpg","width":185,"height":185,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-185x185.jpg"},"people":{"file":"blog_20170912-iStock-537540846-394x276.jpg","width":394,"height":276,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-394x276.jpg"},"insight":{"file":"blog_20170912-iStock-537540846-541x362.jpg","width":541,"height":362,"mime-type":"image\/jpeg","source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846-541x362.jpg"}},"image_meta":{"aperture":"1.8","credit":"Getty Images\/iStockphoto","camera":"NIKON D810","caption":"Shot of a group of people raising their hands in a seminar","created_timestamp":"1464912000","copyright":"PeopleImages","focal_length":"85","iso":"200","shutter_speed":"0.004","title":"The audience has the answer","orientation":"1","keywords":["Student","Presenter","Businesswoman","Businessman","Young Women","Women","Females","Young Men","Men","Males","Group Of People","Seminar","Presentation","Training Class","Lens Flare","Public Speaker","Young Adult","Asking","Sitting","Standing","Looking","Working","Showing","Teaching","Meeting","Expertise","Dedication","Cooperation","Teamwork","Partnership","Togetherness","Part Of","Education","Business","Human Hand","Audience","Business Person","Office Worker","Instructor","Occupation","People","Workshop","Office","Place of Work","Business Meeting","Team","Consultant","Conference","Corporate Business","Coworker"]}},"post":8762,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg"},"acf":{"author_name":"Shaunna-Marie Kerr","author":{"ID":3412,"post_author":"10","post_date":"2017-04-18 16:11:11","post_date_gmt":"2017-04-18 16:11:11","post_content":"Shaunna-Marie Kerr is a Senior Manager at WES Global Talent Bridge Canada.","post_title":"Shaunna-Marie Kerr","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"shaunna-marie-kerr","to_ping":"","pinged":"","post_modified":"2021-04-28 18:12:51","post_modified_gmt":"2021-04-28 22:12:51","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=3412","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"},"external_contributor":false},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Ask a Human Resources Manager: The Hiring Process<\/title>\n<meta name=\"description\" content=\"It can often feel like you are on the outside looking in during the hiring process. Read on to learn what happens from the employer’s side of things.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Ask a Human Resources Manager: The Hiring Process\" \/>\n<meta property=\"og:description\" content=\"It can often feel like you are on the outside looking in during the hiring process. Read on to learn what happens from the employer’s side of things.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2020-01-27T19:04:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"635\" \/>\n\t<meta property=\"og:image:height\" content=\"423\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/\",\"url\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/\",\"name\":\"Ask a Human Resources Manager: The Hiring Process\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg\",\"datePublished\":\"2017-09-12T18:26:30+00:00\",\"dateModified\":\"2020-01-27T19:04:21+00:00\",\"description\":\"It can often feel like you are on the outside looking in during the hiring process. Read on to learn what happens from the employer’s side of things.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg\",\"width\":635,\"height\":423,\"caption\":\"hiring process\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Advisor Blog\",\"item\":\"https:\/\/www.wes.org\/advisor-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Ask a Human Resources Manager: The Hiring Process\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Ask a Human Resources Manager: The Hiring Process","description":"It can often feel like you are on the outside looking in during the hiring process. Read on to learn what happens from the employer’s side of things.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/","og_locale":"en_US","og_type":"article","og_title":"Ask a Human Resources Manager: The Hiring Process","og_description":"It can often feel like you are on the outside looking in during the hiring process. Read on to learn what happens from the employer’s side of things.","og_url":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/","og_site_name":"World Education Services","article_modified_time":"2020-01-27T19:04:21+00:00","og_image":[{"width":635,"height":423,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/","url":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/","name":"Ask a Human Resources Manager: The Hiring Process","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg","datePublished":"2017-09-12T18:26:30+00:00","dateModified":"2020-01-27T19:04:21+00:00","description":"It can often feel like you are on the outside looking in during the hiring process. Read on to learn what happens from the employer’s side of things.","breadcrumb":{"@id":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2017\/09\/blog_20170912-iStock-537540846.jpg","width":635,"height":423,"caption":"hiring process"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/advisor-blog\/hr-manager-hiring-process\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Advisor Blog","item":"https:\/\/www.wes.org\/advisor-blog\/"},{"@type":"ListItem","position":3,"name":"Ask a Human Resources Manager: The Hiring Process"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[{"locale":"zh_CN","id":13008,"post_title":"询问人力资源经理：北美招聘流程","href":"https:\/\/www.wes.org\/zh-hans\/hr-manager-hiring-process\/"}],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/8762"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/advisor_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=8762"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor-blogs\/8762\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/8763"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=8762"}],"wp:term":[{"taxonomy":"advisor_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_categories?post=8762"},{"taxonomy":"advisor_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/advisor_tags?post=8762"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}