{"id":962,"date":"2017-01-31T15:01:21","date_gmt":"2017-01-31T15:01:21","guid":{"rendered":"https:\/\/www.wes.org\/\/?page_id=962"},"modified":"2023-05-08T04:37:04","modified_gmt":"2023-05-08T08:37:04","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/www.wes.org\/terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"","protected":false},"excerpt":{"rendered":"<p>The typical processing time for World Education Services (WES) evaluations is approximately seven (7) business days from the day that a completed application (including all required documents, information and full payment of fees) is received by WES and compiled for internal review and processing.  Processing times may vary depending on a number of factors, including the volume of applications that WES has received, the complexity of the application, and other factors.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/student-default.php","meta":{"footnotes":""},"categories":[],"tags":[],"better_featured_image":null,"acf":{"intro_title":"WES Terms and <span>Conditions","intro_text":"<h2>Section 1. Introduction<\/h2>\n<p>These terms and conditions (these “<strong>Terms and Conditions<\/strong>”) govern your use of the World Education Services (<strong>“WES”, “we”, “us” or “our”<\/strong>) credential evaluation services, as further described herein (collectively, including the WES website and all associated materials, content, and services, the “<strong>Services<\/strong>”).<\/p>\n<p><strong>By using the Services, you acknowledge that you have read, understand, and agree to be bound by, and accept these Terms and Conditions. WES reserves the right to use your information in a manner consistent with these Terms and Conditions. Please review these Terms and Conditions carefully. If you do not agree to be bound by these Terms and Conditions, you should not access or use the Services. These Terms and Conditions constitute a legally binding agreement between you and WES.<\/strong><\/p>\n<p><strong>These Terms and Conditions contain a mandatory arbitration provision that, as set forth in Section 8 entitled “Dispute Resolution &amp; Arbitration Agreement” below, to the fullest extent permissible by law requires you to arbitrate claims you may have against WES on an individual basis, meaning you cannot bring claims against WES in court, and confirms your agreement to a class action waiver in arbitration. It affects your legal rights. Please read it carefully.<\/strong><\/p>\n<p><strong>WES may, from time to time, modify these Terms and Conditions. When WES makes changes, it will post the revised Terms and Conditions. Your use of the Services following any such modification constitutes your agreement to the modified Terms and Conditions. You should visit this page frequently to learn of any changes to these Terms and Conditions.<\/strong><\/p>\n<h2>Section 2. WES Website<\/h2>\n<h3>2.1 Account Registration<\/h3>\n<p>To access the Services, you may be asked to provide certain registration details or other information. It is a condition of your use of the Services that all information you provide on the Services is correct, current, and complete and that you update such information as necessary to maintain it in an up-to-date and accurate fashion. WES reserves the right, in its sole discretion, to deny use to anyone, for any reason whatsoever, as permitted by applicable law.<\/p>\n<p>You also acknowledge that your account is personal to you and agree not to provide any other person with access to the Services or portions of it using your username, password, or other security information. You agree to accept responsibility for all activities that occur through use of your account, username and password. You agree to notify WES of any breach of security on your account. WES will not be liable for losses incurred as a result of an unauthorized use of a password, or user profile.<\/p>\n<p>You are responsible for the protection of the password that you use to access the Services and for any activities or actions under your password. We encourage the use of strong passwords with your account.<\/p>\n<h3>2.2 Security<\/h3>\n<p>As a condition of use, you agree not to use any Services for any purposes that are disruptive, unlawful or prohibited, or otherwise negatively impact WES. These activities include but are not limited to:<\/p>\n<ul>\n<li>dishonest, illegal, abusive, harassing, harmful or fraudulent activity;<\/li>\n<li>hiding your identity, impersonating another person or misrepresenting your affiliation with a person or entity;<\/li>\n<li>unlawful publication of any material, or other conduct, which violates any rights of any third party;<\/li>\n<li>uploading viruses, worms, Trojan horses or other malicious programs or software agents through or to any Services;<\/li>\n<li>attempting to circumvent any technological measure implemented by us or any third party to protect the Services;<\/li>\n<li>advertising or promoting another website, product, or service or soliciting users for other websites, products or services, whether directly or indirectly;<\/li>\n<li>reverse engineering, decompiling, disassembling or deciphering any underlying code or algorithms of any Services;<\/li>\n<li>other interference with the proper operation of the Services; and<\/li>\n<li>advocating, encouraging, or assisting any third party in doing any of the foregoing.<\/li>\n<\/ul>\n<p>WES reserves the right to block, suspend, interrupt or otherwise limit, permanently or temporarily, at its sole discretion and without prior notice, access to the Services from users or sources that violate these Terms and Conditions or which pose any risk to the Services or WES generally, as determined by WES at its sole discretion.<\/p>\n<p>WES provides you with the capability to communicate with us by e-mail for the sending and receiving of information. However, e-mails are not encrypted and there are risks that unauthorized persons can illegally access e-mailed information. Moreover, e-mails may contain viruses, bugs, Trojan horses or other computer code, files or programs intended to damage, detrimentally interfere with, surreptitiously intercept, limit the functionality of any computer software, hardware or telecommunications equipment. WES shall not be liable for any claims, losses, expenses or damages of any nature resulting from e-mails received from WES, or from any other electronic communications with us or the Services.<\/p>\n<h2>Section 3. Basic Services<\/h2>\n<h3>3.1 User Materials<\/h3>\n<ol type=\"a\">\n<li>As part of your use of the Services(via the applicable authorized functionality of the Services), you may upload, post, distribute, disseminate, or send to us content or materials, including but not limited to, documents, academic transcripts, references, and other content (collectively, <strong>“User Materials”<\/strong>) which we, at our discretion, may make available through the Services.<\/li>\n<li>You hereby grant WES an irrevocable, perpetual, nonexclusive, transferable royalty-free worldwide right and license to use, copy, modify, disclose, publicly display, publicly perform, distribute, evaluate, translate, create derivative works from, and store (and you hereby waive all moral rights you may have with respect to) the User Materials (regardless of the medium, technology, or form in which it is used) on or in connection with the Services. For example, and without in any way limiting the generality of the foregoing sentence, WES may use the User Materials to validate academic credentials, issue advisory opinions, complete your application, and verify the legitimacy of other User Materials.<\/li>\n<li>You warrant that: (1) you own all rights to your User Materials or, alternatively, that you have he right to give us the rights described above; and (2) your User Materials do not infringe the intellectual property rights, privacy rights, publicity rights, or other legal rights of any third party.<\/li>\n<li>We may refuse to accept or transmit User Materials for any reason. We may remove User Materials from the Services for any reason.<\/li>\n<\/ol>\n<h3>3.2 User Responsibilities<\/h3>\n<p>By submitting User Materials to us, you:<\/p>\n<ol type=\"a\">\n<li><strong>Sole Responsibility.<\/strong> Acknowledge and agree that you are solely responsible for the form, content and accuracy of such User Materials;<\/li>\n<li><strong>No Violations.<\/strong> Represent and warrant that (i) WES’s receipt and permitted use of such User Materials does not and will not breach any agreement, violate any law, or violate any third party’s rights (including without limitation any third party’s intellectual property rights), and (ii) such User Materials are true and accurate in all respects;<\/li>\n<li><strong>Consent to Document Retention.<\/strong> Expressly consent to WES’s retention of User Materials for so long as reasonably necessary for WES’s legitimate purposes, including without limitation providing, maintaining, supporting and improving the Services to or for you, offering and delivering new Services to you and keeping a record that validates the outcome of evaluations and assessments we complete on your behalf. To withdraw your consent, please visit the <a href=\"https:\/\/www.wes.org\/privacy-policy\/delete-my-wes-account\/\">Delete My WES Account<\/a> page.<\/li>\n<li><strong>Free Use.<\/strong> Agree that WES is free to use, in any manner, all or part of such User Materials on an unrestricted basis without the obligation to notify, identify or compensate you or anyone else; and<\/li>\n<li><strong>License.<\/strong> Grant WES the license set forth in Section 3.1(b), without any duty by WES to anyone whatsoever.<\/li>\n<\/ol>\n<h3>3.3 WES Procedures and Policies:<\/h3>\n<p>You acknowledge and agree to the following WES rights, procedures and policies in connection with WES’s provisioning of the Services:<\/p>\n<ol type=\"a\">\n<li><strong>Complete Documentation:<\/strong> In order to provide the Services, WES requires complete, true and accurate documentation, including all relevant documentation from all relevant formal foreign educational credentials. Document requirements are specific to each country. All documents received become the property of WES and will not be released to the applicant. For requirements by country of education, <a href=\"https:\/\/www.wes.org\/ca\/required-documents\/\">click here<\/a>.<\/li>\n<li><strong>Document Verification:<\/strong> WES reserves the right to verify all User Materials with issuing institution(s) at any time. WES uses reasonable efforts to verify User Materials for authenticity based upon the information available to WES and WES’s reasonable judgment.  WES reserves the right not to evaluate documents from certain institutions in its sole and absolute discretion.<\/li>\n<li><strong>Document Processing:<\/strong> WES will endeavor to process User Materials within the applicable time period (as published by WES) after a completed application (including all required documents, information and full payment of fees) is received by WES and compiled for internal review and processing. <strong>Processing times may vary depending on several factors, including but not limited to the volume of applications that WES has received, the complexity of the application, and other factors, and WES makes no warranty regarding processing times.<\/strong><\/li>\n<li><strong>Requests for additional materials after initial review of application:<\/strong> If submitted User Materials are incomplete or additional information is required in order to prepare an accurate evaluation report, WES will issue a document request. WES reserves the right to have official records sent directly to our office by the issuing institution, and\/or to verify documents with issuing institution(s) at any time. An evaluation report will be prepared only after all requested materials have been received to the satisfaction of WES.  WES reserves the right to refuse to prepare an evaluation report for any reason, in its sole and absolute discretion.<\/li>\n<li><strong>Forged\/altered documents:<\/strong> If it has been determined, in WES’s sole and absolute discretion, that any document submitted includes factual inaccuracies or has been altered, forged, or tampered with, WES reserves the right to cancel the application without notice to the applicant.  Upon cancellation, the documents in question, including originals, shall become the property of WES and no evaluation report will be prepared. All recipients indicated on the application form and other appropriate authorities will be notified. The application fee from these forged\/altered documents and applications will not be refunded.  In cases where WES, as part of a quality control or other review process, determines that any document related to a previously issued evaluation report includes factual inaccuracies or has been altered, forged, or tampered with, the evaluation report will be rescinded. All recipients of the rescinded evaluation report and other appropriate authorities will be notified.<\/li>\n<li><strong>Documents from institutions that are not legitimate:<\/strong> If WES determines that any document submitted for evaluation was obtained from an institution that is not legitimate, WES will issue a report indicating that the document and institution are not legitimate. <span class=\"underline\">NO OTHER EVALUATION REPORT WILL BE ISSUED FOR THAT APPLICATION<\/span>. All recipients indicated on the application form and other appropriate authorities will be notified. The application fee will not be refunded.<\/li>\n<li><strong>Translations:<\/strong> WES does not provide translation services. User Materials must be translated into English or French before you send us your application. Check whether the school or university that you attended in your home country will translate your documents for you. Translations prepared by government ministries or consulates of your home country are also acceptable. If these options are not available, you should contact a professional translation service either in your home country or in Canada.<\/li>\n<li><strong>Evaluation recognition:<\/strong> Most applicants are referred to WES by academic institutions, government agencies, licensing boards, or employers. When this is not the case, applicants are advised to consult with the institution, licensing board, or agency to which they intend to submit the report to confirm that a report from WES will be recognized and accepted. No refunds will be granted if the receiving entity does not accept the evaluation.<\/li>\n<li><strong>Advisory opinion:<\/strong> The evaluation reports provided by WES are advisory in nature and are not binding upon any institution or agency.  Only the receiving institution can determine whether the applicant meets their requirements for admission or credit transfer.<\/li>\n<li><strong>Reassessments of educational equivalencies: <\/strong>Evaluations are based upon the information and resources currently available to professional evaluators in North America. WES reserves the right to reassess educational equivalencies as additional information becomes available.<\/li>\n<li><strong>Change from Course-by-Course to Document-by-Document report:<\/strong> If WES determines that a Course-by-Course evaluation report cannot be prepared, a Document-by-Document report will be issued and the difference in fees will be refunded.<\/li>\n<li><strong>Electronic delivery:<\/strong> Many institutions and boards receive WES reports electronically, and in some cases, this may be the only method of delivery. In such cases, the delivery fee still applies.<\/li>\n<li><strong>File cancellations:<\/strong> A processing fee applies upon cancellation. Completed evaluations cannot be cancelled and are not subject to a refund.<\/li>\n<li><strong>Returned checks:<\/strong> All returned checks are subject to a returned check fee.<\/li>\n<li><strong>Deactivation of applications:<\/strong> All applications that remain incomplete 180 days after the payment date of the original application will, at the sole discretion of WES, be deemed “inactive.” No refunds or credits will be issued once the application is deemed inactive. User Materials will be retained for the purpose of providing you with Services in the future. To have your User Materials deleted, please visit the <a href=\"https:\/\/www.wes.org\/privacy-policy\/delete-my-wes-account\/\">Delete My WES Account<\/a> page.<\/li>\n<li><strong>Reactivation of applications:<\/strong> A reactivation fee will be required to be paid to reactivate \/ reopen and further process applications that have been deemed inactive. Reactivated applications must be completed within 180 days of the reactivation payment date or they will be deemed inactive. Reactivated applications remain subject to all Terms and Conditions.<\/li>\n<li><strong>Original documents:<\/strong> WES discourages submission of original academic documents. Any original documents received by WES will not be returned and will be destroyed by WES at its sole discretion.<\/li>\n<\/ol>\n<h3>3.4 Trailblazers<\/h3>\n<p>From time to time, individuals who have immigrated to an applicable country (each, a “<strong>Trailblazer<\/strong>”) may communicate with, advise or provide content, testimonials, education or training to users through or in connection with the Services (collectively, “<strong>Trailblazer Activities<\/strong>”). Any Trailblazer Activities are within the applicable Trailblazer’s discretion, and WES shall not be responsible or liable for any acts or omissions of any Trailblazer. WES shall not be deemed to supervise, direct or control any Trailblazer or Trailblazer Activities. You are solely responsible for any decision you make relating to any Trailblazer or Trailblazer Activities.<\/p>\n<h3>3.5 Additional Services<\/h3>\n<p>WES may offer additional services from time to time (the <strong>“Additional Services”<\/strong>) containing additional terms and conditions. The following terms and conditions are attached to these Terms and Conditions and are incorporated by reference:<\/p>\n<ul>\n<li>Schedule 1: Special Terms for Educational Credential Assessment (IRCC)<\/li>\n<\/ul>\n<p>With respect to the Additional Services, in the event of a conflict between the provisions of these Terms and Conditions and the terms and conditions applicable to Additional Services, the terms and conditions applicable to the Additional Services shall prevail with respect to such Additional Services to the extent necessary to resolve such conflict.<\/p>\n<h2>Section 4. Limitation of Liability<\/h2>\n<p>TO THE FULLEST EXTENT PERMISSIBLE BY LAW, IN NO EVENT SHALL WES OR ITS AFFILIATES, OFFICERS, DIRECTORS, EMPLOYEES, LICENSORS, REPRESENTATIVES OR CONTRACTORS UNDER ANY CIRCUMSTANCES BE LIABLE TO YOU OR ANY THIRD PARTY ARISING OUT OF OR RELATED TO THESE TERMS AND CONDITIONS, THE SERVICES OR ANY USER MATERIALS, REGARDLESS OF WHETHER ADVISED OF THE POSSIBILITY OF SUCH DAMAGES OR WHETHER ANY LIMITED REMEDY FAILS OF ITS ESSENTIAL PURPOSE, FOR (1) ANY SPECIAL, INDIRECT, CONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES; (2) ANY LOSS OF PROFITS, LOSS OF BUSINESS OPPORTUNITIES, LOSS OF DATA OR LOSS OF GOODWILL; (3) ANY UNAVAILABILITY OF OR INABILITY TO USE THE SERVICES AND\/OR ANY OTHER WES PRODUCTS AND\/OR SERVICES; (4) THE COST OF PROCUREMENT OF SUBSTITUTE GOODS AND SERVICES RESULTING FROM ANY GOODS, DATA, INFORMATION, CONTENT AND\/OR ANY OTHER WES PRODUCTS AND\/OR SERVICES PURCHASED OR OBTAINED FROM OR THROUGH THE SERVICES; (5) THE FAILURE TO REALIZE ANY SPECIFIC EVALUATION OR VERIFICATION OUTCOME, HAPPINESS, OR OTHER BENEFIT OR RELATED OUTCOME; (6) ANY EVENTS, MATERIALS, ACTIVITIES, CIRCUMSTANCES, DELAYS OR FAILURES BEYOND WES’ CONTROL; (7) ANY THIRDPARTY PRODUCTS (OR OTHER MATERIALS), SERVICES, OR ACTIVITIES; OR (8) MORE THAN FIVE HUNDRED CANADIAN DOLLARS (CAD$500.00) IN THE AGGREGATE.<\/p>\n<p>THIS LIMITATION APPLIES TO ALL CAUSES OF ACTION, INCLUDING, BUT NOT LIMITED TO, BREACH OF CONTRACT, BREACH OF WARRANTY, INTELLECTUAL PROPERTY INFRINGEMENT, NEGLIGENCE, STRICT LIABILITY, MISREPRESENTATION AND ANY AND ALL OTHER TORTS. YOU HEREBY RELEASE WES FROM ANY AND ALL OBLIGATIONS, LIABILITIES AND CLAIMS IN EXCESS OF THE LIMITATIONS STATED HEREIN. THE LIMITATION OF LIABILITY SET FORTH ABOVE IS A FUNDAMENTAL ELEMENT OF THE BASIS OF THE AGREEMENT BETWEEN YOU AND WES. ACCESS TO THE SERVICES AND\/OR ANY OTHER WES PRODUCTS AND\/OR SERVICES WOULD NOT BE PROVIDED TO YOU WITHOUT SUCH LIMITATIONS.<\/p>\n<p>Certain jurisdictions do not allow the exclusion or limitation of certain damages. If these laws apply to you, some or all of the above disclaimers, exclusions or limitations may not apply and you may have additional rights. To the extent we may not, as a matter of applicable law, limit our liabilities, the extent of our liability will be the minimum permitted under such law.<\/p>\n<h2>Section 5. Warranty Disclaimer<\/h2>\n<p>YOU EXPRESSLY UNDERSTAND AND AGREE THAT:<\/p>\n<ol type=\"a\">\n<li>YOUR USE OF THE SERVICES, ANY TRAILBLAZER ACTIVITIES AND ANY DELIVERABLE, ACCREDITATION, OR OTHER MATERIALS IS AT YOUR SOLE RISK. THE SERVICES, ANY TRAILBLAZER ACTIVITIES AND ANY MATERIALS PROVIDED BY WES ARE PROVIDED BY WES ON AN “AS IS”, “AS AVAILABLE” BASIS, AND WITHOUT ANY WARRANTIES OR CONDITIONS OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION THE IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABLE QUALITY, ACCURACY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NONINFRINGEMENT, WHETHER ARISING OUT OF STATUTE, IN LAW OR FROM A COURSE OF DEALING OR USAGE OR TRADE. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM WES OR THROUGH THE SERVICES OR ANY TRAILBLAZER ACTIVITIES WILL CREATE ANY WARRANTY THAT IS NOT EXPRESSLY MADE IN THESE TERMS AND CONDITIONS.<\/li>\n<li>WES MAKES NO REPRESENTATIONS OR WARRANTIES, OF ANY KIND, WHETHER EXPRESS OR IMPLIED, THAT: (I) THE SERVICES, ANY TRAILBLAZER ACTIVITIES OR ANY MATERIALS WILL MEET YOUR REQUIREMENTS; (II) THE SERVICES, ANY TRAILBLAZER ACTIVITIES OR ANY MATERIALS WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE; (III) THE RESULTS THAT MAY BE OBTAINED FROM YOUR USE OF THE SERVICES, ANY TRAILBLAZER ACTIVITIES OR ANY MATERIALS WILL BE ACCURATE OR RELIABLE OR SERVE ANY SPECIFIC PURPOSE; OR (IV) THE QUALITY OF ANY INFORMATION OR OTHER MATERIAL OBTAINED BY YOU THROUGH THE SERVICES, ANY TRAILBLAZER ACTIVITIES OR ANY MATERIALS WILL MEET YOUR EXPECTATIONS.<\/li>\n<li>ANY CONTENT OR OTHER MATERIAL DOWNLOADED OR OTHERWISE OBTAINED THROUGH YOUR USE OF THE SERVICES OR ANY TRAILBLAZER ACTIVITIES IS DONE AT YOUR OWN DISCRETION AND RISK AND THAT YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR SYSTEMS, EQUIPMENT OR DATA, INCLUDING LOSS OF DATA, THAT RESULTS FROM SUCH DOWNLOADS OR ACCESS.<\/li>\n<li>WES DOES NOT PROVIDE ANY LEGAL, PROFESSIONAL OR OTHER ADVICE, AND USERS SHOULD NOT RELY ON ANY SERVICES, TRAILBLAZER ACTIVITIES OR WES MATERIALS WHEN MAKING ANY PERSONAL, PROFESSIONAL OR OTHER DECISIONS. THE SERVICES, TRAILBLAZER ACTIVITIES AND WES MATERIALS ARE NOT A REPLACEMENT FOR YOUR OWN INDEPENDENT INVESTIGATION, EVALUATION, ANALYSIS, AND COMPREHENSION OF ANY RELEVANT FACTS, FACTORS, OR CIRCUMSTANCES. FOR CLARITY, WES DOES NOT WARRANT THAT ANY INFORMATION PROVIDED BY (OR ANY CREDENTIAL, BACKGROUND OR OTHER INFORMATION RELATED TO) ANY TRAILBLAZER IS TRUE, ACCURATE OR COMPLETE.<\/li>\n<\/ol>\n<h2>Section 6. Notice of Privacy Policy<\/h2>\n<p>You agree that by accepting these Terms and Conditions, you are consenting to the collection, use and disclosure of your personal information and other practices as described in our <a href=\"https:\/\/www.wes.org\/privacy-policy\/\">Privacy Policy<\/a>.<\/p>\n<h2>Section 7. Indemnity<\/h2>\n<p>You shall indemnify and hold harmless WES and its affiliates, officers, directors, employees, consultants, representatives and agents from and against any duties, taxes, payments, fines, expenses, losses, damages, claims, proceedings, actions, demands and liabilities, whether threatened or pending (collectively, <strong>“Claims”<\/strong>), including without limitation reasonable legal, accounting and other professional fees, brought as a result of or in connection with (a) your use (or any use under your account) of the Services, except to the extent such Claims are caused by, and would not have occurred but for, WES’ gross negligence or willful misconduct in the course of its performance of the Services hereunder; (b) your breach of these Terms and Conditions; (c) any User Materials related to you or your account; or (d) any Trailblazer Activities related to you or your account.<\/p>\n<h2>Section 8. Dispute Resolution &amp; Arbitration Agreement (“Arbitration Agreement”)<\/h2>\n<p><strong>TO THE FULLEST EXTENT PERMISSIBLE BY LAW, YOU AND WES AGREE TO GIVE UP ANY RIGHTS TO LITIGATE CLAIMS IN A COURT OR BEFORE A JURY OR TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE ACTION WITH RESPECT TO A CLAIM. OTHER RIGHTS THAT YOU WOULD HAVE IF YOU WENT TO COURT, SUCH AS ACCESS TO DISCOVERY, MAY BE UNAVAILABLE OR LIMITED IN ARBITRATION.<\/strong><\/p>\n<h3>8.1 Scope of the Arbitration Agreement<\/h3>\n<p>Mindful of the high cost of legal disputes, not only in dollars but in time and energy, both you and WES agree that, to the fullest extent permissible by law, any legal dispute between you and WES concerning or arising in any way out of your use of the Services, WES’s provision of the Services, or any communications between you and WES, shall be resolved through binding individual arbitration unless you opt out of this Arbitration Agreement using the process explained below. Accordingly, you understand and agree that you are waiving your right to sue or go to court to assert or defend your rights. However, either you or WES may bring any individual claim in small claims court consistent with the jurisdictional and dollar limits that may apply, as long as it is brought and maintained as an individual claim. The term “dispute” means any dispute, action, claim, or other controversy between you and WES, whether in contract, warranty, tort, statute, regulation, ordinance, or any other legal or equitable basis. “Dispute” will be given the broadest possible meaning allowable under law.<\/p>\n<h3>8.2 Informal Dispute Resolution<\/h3>\n<p>Either party asserting a dispute shall first try in good faith to resolve it by providing written notice as specified below to the other party describing the facts and circumstances (including any relevant documentation) and allowing the receiving party 30 days in which to respond. Notice shall be made by first class or registered mail (1) to WES Attention: Legal Department, Bowling Green Station, P.O. Box 5087, New York, NY 10274-5087, or (2) to WES, Attention: Legal Department, 2 Carlton Street, Suite 1400. Toronto, Ontario M5B 1S3 or (3) at the billing address on file with WES. Both you and WES agree that this dispute resolution procedure is a condition precedent which must be satisfied before initiating any arbitration against the other party.<\/p>\n<h3>8.3 Right to Opt Out of this Arbitration Agreement<\/h3>\n<p>You may opt out of this Arbitration Agreement within the first 30 days after you use the Services. You may also opt out of this Arbitration Agreement within 30 days after we notify you regarding a material change to this Arbitration Agreement. You may opt out by sending an email to WES at <a href=\"mailto:privacy@wes.org\">privacy@wes.org<\/a> or by sending a letter (1) to WES, Attention: Legal Department, Bowling Green Station, P.O. Box 5087, New York, NY 10274-5087 or (2) to WES, Attention: Legal Department, 2 Carlton Street, Suite 1400. Toronto, Ontario M5B 1S3. You should include your printed name, mailing address, and the words “Reject Arbitration.”<\/p>\n<h3>8.4 How Arbitration Works<\/h3>\n<p>Either party may initiate arbitration, which shall be conducted by the American Arbitration Association (“AAA”) pursuant to its Consumer Arbitration Rules (“AAA Rules”), as modified by this Arbitration Agreement. The AAA Rules are available on the AAA’s website www.adr.org, or by calling the AAA at (800) 778-7879. In the event the AAA is unavailable or unwilling to hear the dispute, the parties shall agree to, or the court shall select, another arbitration provider. Unless you and WES agree otherwise, any arbitration hearing shall take place in the county of your residence (as determined by your billing address on file with WES). If you live outside the United States, any arbitration will take place in New York, New York. Except for a dispute determined to be initiated in bad faith or frivolous by the arbitrator, WES will pay all filing, administrative, arbitrator and hearing costs and waives any rights it may have to recover an award of attorneys’ fees and expenses against you.<\/p>\n<h3>8.5 Waiver of the Right to Bring Class Action and Representative Claims<\/h3>\n<p>All arbitrations shall proceed on an individual basis. The arbitrator is empowered to resolve the dispute with the same remedies available in court, including public injunctive relief. You and WES also agree that each may bring claims against the other in arbitration only in your or their respective individual capacities and in so doing you and WES hereby waive the right to a trial by jury, to assert or participate in any class action lawsuit or class action arbitration, any private attorney general lawsuit or private attorney general arbitration, and any joint or consolidated lawsuit or joint or consolidated arbitration of any kind. If a court decides that applicable law precludes enforcement of any of this paragraph’s limitations as to a particular cause of action, then that cause of action (and only that cause of action) must remain in court and be severed from any arbitration.<\/p>\n<h3>8.6 Governing Law and Other Terms<\/h3>\n<p>This Arbitration Agreement shall be governed by, and interpreted, construed, and enforced in accordance with, the Federal Arbitration Act and, where applicable, the law of the State of New York. WES will provide notice of any material changes to this Arbitration Agreement. The terms of this Arbitration Agreement shall survive after your relationship with WES and\/or use of the Services ends. Any arbitration will be confidential, and neither you nor we may disclose the existence, content or results of any arbitration, except as may be required by law or for purposes of enforcement of the arbitration award. Judgment on any arbitration award may be entered in any court having proper jurisdiction.<\/p>\n<p>Except as set forth above, if any portion of this Arbitration Agreement is deemed invalid or unenforceable, it will not invalidate the remaining portions of the Arbitration Agreement. Only the arbitrator is authorized to make determinations as to the scope, validity, or enforceability of this Agreement, including whether any dispute falls within its scope. However, the parties agree that any issue concerning the validity of the class action\/representative waiver above must be decided by a court, and an arbitrator does not have authority to consider the validity of the waiver.<\/p>\n<h3>8.7 Canada<\/h3>\n<p>In the event that this Arbitration Agreement or any other portion of this Section 8 is unenforceable by operation of the federal laws of Canada or the laws of any of the Canadian provinces therein (as and if applicable), all disputes, controversies and claims arising out of, in connection with, or in relation to the Services or these Terms and Conditions, as between any Canadian resident and WES, will be governed by, interpreted, construed and enforced in accordance with the laws of the Province of Ontario, Canada, and the applicable federal laws of Canada, excluding any rules of private international law or the conflicts of laws that would lead to the application of any other laws.<\/p>\n<h2>Section 9. Miscellaneous<\/h2>\n<h3>9.1 Intellectual Property<\/h3>\n<p>WORLD EDUCATION SERVICES® is a registered trademark of WES. All rights reserved.<\/p>\n<p><span class=\"underline\">Trademark<\/span>. All logos, trademarks, service marks, trade names, and other proprietary indicia appearing on or in connection with the Services belong exclusively to WES (as between you and WES) and are protected from reproduction, imitation, dilution, or confusing or misleading uses under national and international trademark laws. The unauthorized use of these trademarks, or any related materials, is expressly prohibited.<\/p>\n<p><span class=\"underline\">Copyright<\/span>. Except for your User Materials, all copyright rights in the text, images, photographs, graphics, user interface, music, and other content provided in connection with the Services, and the selection, coordination, and arrangement of such content, are owned by WES or its third-party licensors to the fullest extent provided under the U.S. Copyright Act and all international copyright laws. Under applicable copyright laws (and these Terms and Conditions), you are prohibited from copying, reproducing, modifying, distributing, displaying, performing, or transmitting any of the contents of the Services for any purposes (other than those expressly authorized in writing by WES).<\/p>\n<p>Except as otherwise specifically permitted in these Terms and Conditions (or expressly authorized in writing by WES), you will not broadcast, duplicate, copy, reproduce, edit, manipulate, modify, publish, rent, sell, publicly display, perform, distribute, transmit, or circulate to anyone the contents of the Services. WES reserves all rights not expressly granted to you in these Terms and Conditions.<\/p>\n<h3>9.2 Third-Party Content<\/h3>\n<p>The Services, Trailblazer Activities and WES materials may contain links to third-party websites, services, or other events or activities that are not owned or controlled by WES and such links may provide access to content that is offensive, inaccurate, inappropriate or otherwise problematic. Links to such third-party websites are provided solely for your convenience and WES does not endorse, approve of or control any content accessed through such links and you acknowledge and agree that WES will not be responsible or liable to you in any way whatsoever for any content or other materials hosted and served from any site other than the WES website.<\/p>\n<h3>9.3 Applicable Law<\/h3>\n<h4>Residents of Canada<\/h4>\n<p>If you are a resident of Canada, subject to the Arbitration Agreement, (a) you acknowledge and agree that your use of the Services, any Trailblazer Activities and any User Materials is governed by the laws of the Province of Ontario and the federal laws of Canada applicable therein, excluding any rules of private international law or conflicts of laws that would lead to the application of any other laws; and (b) you and WES agree to submit to the personal and exclusive jurisdiction of the courts located in the City of Toronto in the Province of Ontario.<\/p>\n<h4>Residents of the United States and All Other Countries<\/h4>\n<p>If you are not a resident of Canada, subject to the Arbitration Agreement, (i) you acknowledge and agree that your use of the Services, any Trailblazer Activities and any User Materials is governed by the laws of New York and the federal laws of the United States applicable therein, excluding any rules of private international law or conflicts of laws that would lead to the application of any other laws; and (ii) you and WES agree to submit to the personal and exclusive jurisdiction of the courts located in New York, New York.<\/p>\n<h3>9.4 General Provisions<\/h3>\n<p>These Terms and Conditions (including our Privacy Policy and any other terms or documents incorporated herein) represent the entire, final agreement between the parties regarding the subject matter hereof. Should any part of these Terms and Conditions be held invalid or unenforceable, that portion shall be construed consistent with applicable law (and, to the fullest extent permissible, consistent with its original intent) and the remaining portions shall remain in full force and effect. Our failure to enforce any provision of these Terms and Conditions shall not be deemed a waiver of such provision nor of the right to enforce such provision. The failure of WES to enforce any provisions of these Terms and Conditions or to respond to a breach by you or other parties will not in any way waive WES’ right to enforce subsequently any terms or conditions of these Terms and Conditions or to respond to similar breaches. The parties do not intend that any agency or partnership relationship be created through execution or operation of these Terms and Conditions. Headings used in these Terms and Conditions are for convenience only and have no legal or contractual significance. These Terms and Conditions will be binding on and will inure to the benefit of the legal representatives, successors, heirs, and assigns of both parties, as the case may be. WES may assign these Terms and Conditions in whole or in part at any time without your consent. You may not assign these Terms and Conditions or delegate any of your obligations hereunder.<\/p>\n<h3>9.5 Changes to Services<\/h3>\n<p>WES may discontinue any Services at any time and for any reason, without notice. We may change the contents, operation, or any other features or functionality of the Services at any time for any reason, without notice. We may discontinue or restrict your use of the Services at any time for any reason, without notice.<\/p>\n<h2>Section 10. Contact Us<\/h2>\n<p>We endeavor, as reasonably practical, to listen to or read, as applicable, messages sent to us in accordance herewith and to reply to such messages. The information you provide is used to respond to your questions or comments. If you have any questions about these Terms and Conditions, the Services or the practices of WES, please feel free to <a href=\"https:\/\/www.wes.org\/contact-us\/\">contact us<\/a>.<\/p>\n","intro_item_headline":"","intro_item_text":"","intro_item_image":false,"intro_more_button":"","intro_more_button_cta_link":"","intro_more_button_new_window":[],"intro_more_button_content":"","main_content_title":"","main_content_item_1_headline":"","main_content_item_1_text":"","main_content_item_1_image":false,"main_content_item_1_cta_text":"","main_content_item_1_cta_link":"","item_1_cta_link_new_window":[],"main_content_item_2_headline":"","main_content_item_2_text":"","main_content_item_2_image":false,"main_content_item_2_cta_text":"","main_content_item_2_cta_link":"","item_2_cta_link_new_window":[],"main_content_item_3_headline":"","main_content_item_3_text":"","main_content_item_3_image":false,"main_content_item_3_cta_text":"","main_content_item_3_cta_link":"","item_3_cta_link_new_window":[],"main_content_item_4_headline":"","main_content_item_4_text":"","main_content_item_4_image":false,"main_content_item_4_cta_text":"","main_content_item_4_cta_link":"","item_4_cta_link_new_window":[],"main_content_item_5_headline":"","main_content_item_5_text":"","main_content_item_5_image":false,"main_content_item_5_cta_text":"","main_content_item_5_cta_link":"","item_5_cta_link_new_window":[],"main_content_item_6_headline":"","main_content_item_6_text":"","main_content_item_6_image":false,"main_content_item_6_cta_text":"","main_content_item_6_cta_link":"","item_6_cta_link_new_window":[],"main_content_item_7_headline":"","main_content_item_7_text":"","main_content_item_7_image":false,"main_content_item_7_cta_text":"","main_content_item_7_cta_link":"","item_7_cta_link_new_window":[],"evaluation_reports":false,"main_content_item_8_headline":"","main_content_item_8_text":"","main_content_item_8_image":false,"main_content_item_8_cta_text":"","main_content_item_8_cta_link":"","item_8_cta_link_new_window":[],"main_content_item_9_headline":"","main_content_item_9_text":"","main_content_item_9_image":false,"main_content_item_9_cta_text":"","main_content_item_9_cta_link":"","item_9_cta_link_new_window":[],"main_content_item_10_headline":"","main_content_item_10_text":"","main_content_item_10_image":false,"main_content_item_10_cta_text":"","main_content_item_10_cta_link":"","item_10_cta_link_new_window":[],"page_maf":false,"alert_msg":"default","custom_body_class":"terms-conditions","hide_language_switcher":true},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms and Conditions - World Education Services<\/title>\n<meta name=\"robots\" content=\"index, follow, max-image-preview:large, max-video-preview:-1, nosnippet\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/terms-and-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms and Conditions\" \/>\n<meta property=\"og:description\" content=\"The typical processing time for World Education Services (WES) evaluations is approximately seven (7) business days from the day that a completed application (including all required documents, information and full payment of fees) is received by WES and compiled for internal review and processing. Processing times may vary depending on a number of factors, including the volume of applications that WES has received, the complexity of the application, and other factors.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/terms-and-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2023-05-08T08:37:04+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/terms-and-conditions\/\",\"url\":\"https:\/\/www.wes.org\/terms-and-conditions\/\",\"name\":\"Terms and Conditions - World Education Services\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"datePublished\":\"2017-01-31T15:01:21+00:00\",\"dateModified\":\"2023-05-08T08:37:04+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/terms-and-conditions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/terms-and-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/terms-and-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms and Conditions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Terms and Conditions - World Education Services","robots":{"index":"index","follow":"follow","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1","snippet":"nosnippet"},"canonical":"https:\/\/www.wes.org\/terms-and-conditions\/","og_locale":"en_US","og_type":"article","og_title":"Terms and Conditions","og_description":"The typical processing time for World Education Services (WES) evaluations is approximately seven (7) business days from the day that a completed application (including all required documents, information and full payment of fees) is received by WES and compiled for internal review and processing. Processing times may vary depending on a number of factors, including the volume of applications that WES has received, the complexity of the application, and other factors.","og_url":"https:\/\/www.wes.org\/terms-and-conditions\/","og_site_name":"World Education Services","article_modified_time":"2023-05-08T08:37:04+00:00","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/terms-and-conditions\/","url":"https:\/\/www.wes.org\/terms-and-conditions\/","name":"Terms and Conditions - World Education Services","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"datePublished":"2017-01-31T15:01:21+00:00","dateModified":"2023-05-08T08:37:04+00:00","breadcrumb":{"@id":"https:\/\/www.wes.org\/terms-and-conditions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/terms-and-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/terms-and-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Terms and Conditions"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/962"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=962"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/962\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=962"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/categories?post=962"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/tags?post=962"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}