{"id":1217,"date":"2017-02-23T17:33:49","date_gmt":"2017-02-23T17:33:49","guid":{"rendered":"https:\/\/www.wes.org\/?page_id=1217"},"modified":"2023-09-04T10:06:15","modified_gmt":"2023-09-04T14:06:15","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.wes.org\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"","protected":false},"excerpt":{"rendered":"<p>World Education Services (WES) collects information required to evaluate educational credentials. WES recognizes the importance of protecting the privacy of the persons who submit their credentials for evaluation. Any information shared between applicants and WES is protected in accordance with applicable laws and the policies stated below.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/policies-default-template.php","meta":{"footnotes":""},"categories":[1],"tags":[],"better_featured_image":null,"acf":{"intro_title":"Privacy <span>Policy<\/span>","intro_text":"<p>Last modified: September 4, 2023<\/p>\n<p>World Education Services (<strong>“WES” or “we” or “us”<\/strong>) respects your privacy and is committed to protecting it. This <strong>Privacy Policy<\/strong> describes the types of information we may collect from you and others and our practices for using, maintaining, protecting, and disclosing that information. We collect information from you through our <strong>Website<\/strong>, <strong>https:\/\/www.wes.org<\/strong> and through our Mobile Application (the “<strong>Application<\/strong>”<u>)<\/u>, including when you request information from us or apply for our credential evaluation and verification services (collectively referred to as our “<strong>Services<\/strong>.”) We also collect information about you from other sources when we provide our Services that you request. This policy does not apply to information collected by any external websites that may be accessible from or on our Website or our Application.<\/p>\n<p>Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Services. By accessing or using our Website or using our Application, you agree to this Privacy Policy. This policy may change from time to time (see <strong>Changes to Our Privacy Policy<\/strong>). Your continued use of our Services after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates.<\/p>\n<h2>1. Categories of Personal Data Collected<\/h2>\n<p>This Policy addresses how we collect, use and protect any information about you including personal information that directly or indirectly identifies you (“<strong>Personal Data<\/strong>”). We limit the collection of Personal Data to what is reasonably required to fulfill the purposes for which it was collected. Depending on your interaction with us, we may collect, use, store, disclose and transfer your Personal Data, including:<\/p>\n<ul>\n<li><strong>Personal Identifiers<\/strong>, such as your name, postal address, e-mail address, telephone number, date of birth and financial information related to your use of our Website or Application;<\/li>\n<li><strong>Professional or employment-related information and other information you submit to us, <\/strong>such as your student ID number, educational documents (degree certificates, diploma supplements, academic transcripts, institution confirmations, and other similar documents that may vary depending on the country where you were educated), your WES reference number, your Grade Point Average (GPA), professional license, certification type, license or certification number, country of residence and education, security questions and answers, and other information that may be present on a document when you or an organization you request submits documentation to our Services; and<\/li>\n<li><strong>Internet or other network activity information<\/strong>, such as information about your internet connection, your IP address and location data, the equipment you use to access our Website or use our Application (operating system, mobile device type, and\/or browser type) and Website or Application usage details, including password credentials for accessing our Website or Application.<\/li>\n<\/ul>\n<h2>2. Collection of Personal Data<\/h2>\n<p>We will generally collect Personal Data directly from you, when you browse our Website, or when you interact with us directly, as deemed necessary for the purposes described below.<\/p>\n<p><em>Information You and Third Parties Provide to Us<\/em><\/p>\n<p>WES is the Data Controller of your Personal Data as defined in the European Union General Data Protection Regulation (“GDPR”). We process your Personal Data in accordance with GDPR and in accordance with the Personal Information Protection and Electronic Documents Act (Canada) and substantially similar provincial laws in Alberta, British Columbia and Quebec.” We collect Personal Data for our Services from the following sources:<\/p>\n<ul>\n<li>forms that you fill out on our Website or in our Application when you order a WES credential evaluation, use WES Website or Application tools, register for a WES event or use other online Services;<\/li>\n<li>documents that you send us related to the Services you requested;<\/li>\n<li>information provided by third parties that you list on your application and authorize to provide information to us;<\/li>\n<li>records and copies of your correspondence to us or that are submitted to us on your behalf by third parties such as educational institutions where you were a student or third party agencies;<\/li>\n<li>your responses to surveys or participation in focus groups or user testing studies that we might ask you to complete for research purposes; and<\/li>\n<li>details of the Services you order from us (including on or through our Website or in or through our Application) and when we fulfill the Services you request from us, including financial information required to place an order for Services.<\/li>\n<\/ul>\n<p>The Personal Data we collect from you may be required to enter into a contract with WES for our services to evaluate and verify your educational credentials.  If you refuse to provide such Personal Data or withdraw your consent to our processing of Personal Data, we may not be able to enter into the contract or fulfill our obligations to you under it.<\/p>\n<p><em>Information We Collect Through Automatic Data Collection Technologies<\/em><\/p>\n<p>As you navigate through and interact with our Website or use our Application, we may use the following automatic data collection technologies to collect certain information about your equipment, browsing actions, and patterns:<\/p>\n<ul>\n<li>details of your visits to our Website or use of our Application, specifically usage data, location data, logs, and other communication data and the resources that you access and use on the Website; and<\/li>\n<li>information about your computer, mobile device, and internet connection, specifically your IP address, operating system, and browser type.<\/li>\n<\/ul>\n<p>We use these technologies to collect information about your online activities on our Website, in our Application, or on other online services (behavioral tracking). Some web browsers and mobile operating systems permit you to broadcast a signal to websites and online services indicating a preference that they “do not track” your online activities. At this time, we do not honor such signals and we do not modify what information we collect or how we use that information based upon whether such signal is broadcast or received.<\/p>\n<p>The information we collect automatically may include Personal Data that we receive from third parties. This information helps us to improve our Website and our Application and to deliver a better and more personalized service, by enabling us to:<\/p>\n<ul>\n<li>estimate our audience size and usage patterns;<\/li>\n<li>store information about your preferences, allowing us to customize our Website or Application according to your individual interests;<\/li>\n<li>speed up your searches; and<\/li>\n<li>recognize you when you return to our Website or Application.<\/li>\n<\/ul>\n<p>The technologies we use for this automatic data collection include:<\/p>\n<ul>\n<li><strong>Cookies (or browser cookies).<\/strong> A cookie is a small file placed on the hard drive of your computer. We only place cookies on your hard drive with your consent. You may refuse to accept browser cookies by activating the appropriate setting on your browser or in your mobile operating system. If you select this setting, however, you may be unable to access certain parts of our Website or our Application, including as it relates to logging on to your account for a credential evaluation. You can find more information about cookies at <strong>https:\/\/www.allaboutcookies.org<\/strong> and <strong>https:\/\/youronlinechoices.eu<\/strong>.<\/li>\n<li><strong>Web Beacons. <\/strong>Pages of our Website, screens in our Application, and our e-mails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit WES, for example, to count users who have visited those pages, accessed those screens, or opened an email and for other related website and application statistics (recording the popularity of certain website and application content and verifying system and server integrity).<\/li>\n<\/ul>\n<p>We may also collect information you share regarding WES on social media, such as Facebook and Twitter.<\/p>\n<h2>3. How We Use Your Personal Data<\/h2>\n<p>We will generally use your Personal Data as part of our normal business operations in order to provide you with our products and services, through our Website and Applications, and to support our business, for research and development purposes, for marketing purposes or otherwise, with your consent or as permitted or required by law.<\/p>\n<p><em>General Business Purpose<\/em><\/p>\n<p>We use information including your Personal Data that we collect about you for the following legitimate purposes:<\/p>\n<ul>\n<li>to present our Website or Application and their respective contents to you;<\/li>\n<li>to provide you with information and Services that you request from us;<\/li>\n<li>to verify the information and credentials submitted for evaluation;<\/li>\n<li>to permit you to update or upgrade the credential services or provide you with additional copies of your existing credential evaluation in the future;<\/li>\n<li>to fulfill any other purpose for which you provide it;<\/li>\n<li>to provide you with notices about your account;<\/li>\n<li>to carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection;<\/li>\n<li>to compile research information;<\/li>\n<li>to notify you about changes to our Website, Application, or any products or services we offer or provide though them;<\/li>\n<li>in any other way we may describe when you provide the information;<\/li>\n<li>to comply with our legal and regulatory obligations; and<\/li>\n<li>for any other purpose with your consent.<\/li>\n<\/ul>\n<p>With your consent, we may also use your information to contact you about our own and third-parties’ goods and services that may be of interest to you.  If you wish to consent to this use, please check the relevant box located on the form on which we collect your data. If you no longer wish to receive this information, please inform us through our <strong>Contact Us<\/strong> page. For more information, see <strong>Choices About How We Use and Disclose Your Information.<\/strong><\/p>\n<p><em>Third-Party Use of Cookies and Other Tracking Technologies<\/em><\/p>\n<p>Some content or resources on the Website and in the Application are served by third parties. We do not control these third parties’ tracking technologies or how they may be used. If you have any questions about an advertisement or other targeted content, you should contact the responsible provider directly through the links provided on the provider’s website.  For information about how you can opt-out of receiving targeted advertising from many providers, see <strong>Choices About How We Use and Disclose Your Information.<\/strong><\/p>\n<p><em>Lawful Basis for Processing Your Personal Data<\/em><\/p>\n<p>If you are in the European Union or Canada, the processing of your Personal Data is lawful only if it is permitted under the applicable data protection laws. We have a lawful basis for the processing of your Personal Data (except when an exception applies as described below):<\/p>\n<ul>\n<li><strong>Consent.<\/strong> By using our Services and agreeing to this Privacy Policy, you consent to our collection, use, and sharing of your Personal Data as described in this Privacy Policy. If you do not consent to this Privacy Policy, please do not use the Website or the Application. If you reside in Canada, you hereby provide consent for all collection, use, and disclosure of your Personal Data as described in this Privacy Policy.<\/li>\n<li><strong>Legitimate Interests. <\/strong>We will process your Personal Data as necessary for our legitimate interests. Specifically, our legitimate interests are to: facilitate communication between WES and you; improve our Website or Application by reviewing how you use them and issues you may encounter with them; improve our products and services by analyzing statistical trends about you and other users; promote our business by using your email or other contact information to contact you; safeguard our IT infrastructure and intellectual property by logging your IP address for intrusion detection purposes; detect and prevent fraud and other crime; and perform risk assessments. Our legitimate interests are balanced against your rights and freedoms and we do not process your Personal Data if your rights and freedoms outweigh our legitimate interests. If you reside in Canada, we process your Personal Data only pursuant to the consent provided above, except for uses to safeguard our IT infrastructure and intellectual property and to detect and prevent fraud and other crime.<\/li>\n<li><strong>To Fulfill Our Obligations to You under a Contract. <\/strong>We process your Personal Data in order to fulfill our obligations to you pursuant to our Contract with you to deliver our Services to evaluate and verify your credentials and prepare your evaluation report. If you reside in Canada, we access, use, or disclose your Personal Data only pursuant to the consent provided above.<\/li>\n<li><strong>As Required by Law. <\/strong>We may also process your Personal Data when we are required or permitted to by law; to comply with government inspection, audits, and other valid requests from government or other public authorities; to respond to legal processes such as subpoenas; or as necessary for us to protect our interests or otherwise pursue our legal rights and remedies (for instance, when necessary to prevent or detect fraud, attacks against our network, or other criminal and harmful activities, defend litigation, and manage complaints or claims). If you reside in Canada, we may process your Personal Data in some of the following instances: if we have reasonable grounds to believe the information would be useful in investigating a violation of federal, provincial, or federal laws; when collecting a debt you owe to WES; to comply with a subpoena, a warrant, or an order made by a court or other body with appropriate jurisdiction; or to a government institution that has requested this information. For all other uses of your Personal Data described in this Privacy Policy, we access, use, or disclose your personal data only pursuant to the consent provided above.<\/li>\n<\/ul>\n<p><em>Sensitive Personal Data Processing<\/em><\/p>\n<p>WES does not ask for any Personal Data that is defined as any of the special categories under the GDPR (“Sensitive Personal Data”). Please do not provide information revealing your racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership or information about genetic data or data concerning health, your sex life or sexual orientation or any information not specifically requested on the WES online application form.<\/p>\n<p><em>Automated Decision Making<\/em><\/p>\n<p>WES does not use Personal Data with any automated decision-making process that produces legal effects concerning you.<\/p>\n<h2>4. Disclosure of Your Personal Data<\/h2>\n<p>We do not share, sell, or otherwise disclose your Personal Data for purposes other than those outlined in this Privacy Policy or as authorized by law. We may, however, disclose aggregated information about our users, and information that does not identify any individual, without restriction. We may disclose Personal Data that we collect or that you provide as described in this Privacy Policy:<\/p>\n<ul>\n<li>to contractors, service providers, and other third parties we use to support our business and who are bound by contractual obligations to keep Personal Data confidential and use it only for the purposes for which we disclose it to them. Specifically, these entities include:\n<ul>\n<li>IT and infrastructure support service providers, in connection with managing and maintaining our IT infrastructure;<\/li>\n<li>courier and mailing service providers, in connection with sending your information.<\/li>\n<li>to education institutions that you listed on your credential evaluation application and educational authorities that issued you educational documentation or may have information about you, and their third-party service providers, in connection with validating your credentials;<\/li>\n<li>to licensing organizations and applicable authorities that have issued you a license or that may have information about you, and their third-party service providers, in connection with validating the license or information; and<\/li>\n<li>to third parties to whom you have requested that we send our credential evaluation, and their third-party service providers, in connection with fulfilling your request;<\/li>\n<\/ul>\n<\/li>\n<li>in the event of a merger, restructuring, reorganization, dissolution, or other sale or transfer of some or all of WES’s assets, in which Personal Data held by WES about our customers is among the assets transferred;<\/li>\n<li>to third parties to market their products or services to you and assist us in marketing our services to you, if you have consented to these disclosures. We contractually require these third parties to keep Personal Data confidential and use it only for the purposes for which we disclose it to them. For more information, <strong>see Choices About How We Use and Disclose Your Information<\/strong>;<\/li>\n<li>to fulfill the purpose you requested;<\/li>\n<li>for any other purpose disclosed by us when you provide the information; and<\/li>\n<li>with your consent.<\/li>\n<\/ul>\n<p>We may also disclose your Personal Data:<\/p>\n<ul>\n<li>to comply with any court order, law, or legal process, including to respond to any government or regulatory request;<\/li>\n<li>to enforce or apply our Terms and Conditions and other agreements, including for billing and collection purposes; and<\/li>\n<li>if we believe disclosure is necessary or appropriate to protect the rights, property, safety or reputation of WES, our customers or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection and credit risk reduction.<\/li>\n<\/ul>\n<h2>5. Your Choices and Privacy Rights<\/h2>\n<p><em>Choices About How We Use and Disclose Your Personal Data<\/em><\/p>\n<p>We do not control the collection and use of your Personal Data by the recipients that you have designated or third parties described above. These third parties may provide you with ways to choose not to have your information collected or used through the links referenced above. When possible, these organizations are under contractual obligations to use Personal Data only for providing necessary services to us and maintain this information strictly confidential. These third parties may, however, aggregate the information they collect with information from their other customers for their own purposes.<\/p>\n<p>You can learn more about interest-based advertisements and your opt-out rights and options from members of the Network Advertising Initiative (“<strong>NAI<\/strong>”) on its website (<strong>www.networkadvertising.org<\/strong>) and from members of the Digital Advertising Alliance on its website (<strong>www.aboutads.info<\/strong>). You can also opt out of receiving targeted ads from members of the NAI on its website.<\/p>\n<p>In addition, we strive to provide you with choices regarding the Personal Data you provide to us. We offer the following mechanisms to provide you with control over your Personal Data:<\/p>\n<ul>\n<li><strong>Tracking Technologies. <\/strong>You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. If you disable or refuse cookies, please note that some parts of the WES Website or Application (specifically your log in to your Account that you create) may be inaccessible or not function properly.<\/li>\n<li><strong>Targeted Advertising and Promotional Offers from WES.<\/strong> We participate in interest-based advertising and we or others may use information about you to deliver to you or allow you to see certain advertising based on your interests, searches you perform, information you provide, or your activity on our website or other websites.  We will only use your Personal Data to promote our own products and services and with your consent. If you wish to consent to such use, you can check the relevant box located on the form on which we collect your Personal Data or otherwise seek such consent. If you wish to change your choice, you can adjust your user preferences on any promotional email that we send you or send us a return email informing us of your preferences. You can also communicate with us through our <strong>Contact Us<\/strong> page. This opt out choice does not apply to information provided to the Company as a result of our performance of Services you request, warranty registration, product service experience or other transactions.<\/li>\n<\/ul>\n<p><em>Your Rights Regarding Accessing and Correcting Your Personal Data<\/em><\/p>\n<p>Applicable data protection laws may provide you with certain rights with regards to our processing of your Personal Data.<\/p>\n<ul>\n<li><strong>Access and Correct. <\/strong>You can review and change some of your Personal Data by logging into the Website or the Application and visiting the “My Account” page or screen. You may also notify us through the <strong>Contact Information<\/strong> below of any changes or errors in any Personal Data we have about you to ensure that it is complete, accurate, and as current as possible. Please note that if you request access to your Personal Data other than through our Website or Application, you may be charged a fee subject to a maximum set by applicable law. We may also not be able to accommodate your request if we believe it would violate any law or legal requirement or cause the information to be incorrect.<\/li>\n<li><strong>Restrictions<\/strong>. You have the right to restrict our processing of your Personal Data under certain circumstances. In particular, you can request we restrict our use of it if you contest its accuracy, if the processing of your Personal Data is determined to be unlawful, or if we no longer need your Personal Data for processing, but we have retained it as permitted by law.<\/li>\n<li><strong>Portability.<\/strong> To the extent the Personal Data you provide WES is processed based on your consent, you have the right to request that we provide you a copy of, or access to, all or part of such Personal Data in a structured, commonly used and machine-readable format. You also have the right to request that we transmit this Personal Data to another controller, when technically feasible. Note that we are unable to return any documentation provided to us.<\/li>\n<li><strong>Withdrawal of Consent. <\/strong>For users of our Website, Applications, and marketing tools, to the extent that our processing of your Personal Data is based only on your consent, you may withdraw your consent at any time. Withdrawing your consent will not, however, affect the lawfulness of the processing based on your consent before its withdrawal, and will not affect the lawfulness of our continued processing that is based on any other lawful basis for processing your Personal Data.<\/li>\n<\/ul>\n<p>If you have contracted evaluation services with WES, you have the right to cancel your request (cancellation fees apply) as per our Terms and Conditions.  WES will no longer contact you regarding your evaluation unless we receive verification of fraud in which case we will notify you and appropriate authorities.<\/p>\n<ul>\n<li><strong>Right to be Forgotten<\/strong>. For users of our Website, Application, and marketing tools, you have the right to request that we <strong>delete all of your Personal Data<\/strong>. If you have opened an Account and applied for our educational evaluation and verification services, you have the right to cancel your file (cancellation fees apply).<\/li>\n<\/ul>\n<p>You have the right to be forgotten when we do not have a lawful basis for refusing such a request. Your Personal Data that you have supplied to WES will be retained according to our <strong>Data Retention Policy<\/strong> below. We may not accommodate a request to change information if we believe the change would violate any law or legal requirement or cause the information to be incorrect. In addition, we cannot completely delete your Personal Data as some data may rest in previous backups. These will be retained for the periods set forth in our disaster recovery policies.<\/p>\n<ul>\n<li><strong>Complaints.<\/strong> You have the right to lodge a complaint with the applicable supervisory authority in the country you live in, the country you work in, or the country where you believe your rights under applicable data protection laws have been violated. Before doing so, we request that you contact us directly in order to give us an opportunity to work directly with you to resolve any concerns about your privacy.<\/li>\n<li><strong>How You May Exercise Your Rights.<\/strong> You may exercise any of the above rights by contacting us through the <strong>Contact Information<\/strong> If you contact us to exercise any of the foregoing rights, we may ask you for additional information to verify your identity. We reserve the right to limit or deny your request if you have failed to provide sufficient information to verify your identity or to satisfy our legal and business requirements.<\/li>\n<\/ul>\n<p><em>Your California Privacy Rights<\/em><\/p>\n<p>If you are a resident of California, the California Consumer Privacy Act, as amended by the California Privacy Rights Act (together, “CCPA”) provides you with the following rights with respect to your Personal Information:<\/p>\n<ul>\n<li>The right to know what personal information we have collected, used, disclosed, and sold about you, including the categories of personal information, the categories of sources from which the personal information is collected, the business or commercial purpose for collecting, selling, or sharing personal information, the categories of third parties to whom WES discloses personal information, and the specific pieces of personal information WES has collected about you.<\/li>\n<li>The right to correct inaccuracies in your personal information, taking into account the nature of the personal information and the purposes of the processing.<\/li>\n<li>The right to request that we delete any personal information we have about you.<\/li>\n<li>The right to opt-out of the sharing of your personal information, which you can exercise through the<a href=\"https:\/\/www.wes.org\/contact-us\/\"> contact form <\/a>available on our website or by modifying your privacy preferences (e.g., Global Privacy Control), available through certain internet browsers and extensions, that signal your preference to opt out.  Please note that clearing your cookies at any time will remove the signal of your selected privacy preferences.<\/li>\n<\/ul>\n<p>To submit any of the above requests, you may contact us by calling (+1) 800.361.3106 or by emailing us at <a href=\"mailto:privacy@wes.org\">privacy@wes.org<\/a>.  If you make a request via email, please use the subject “CCPA Request.”  You may also designate an authorized agent to make a request on your behalf.  When you exercise these rights and submit a request to know, correct, or delete, we will verify your identity by asking you to provide us with additional information such as your email address or the last four digits of a credit or debit card used to make a purchase.  We also may use a third-party verification provider to verify your identity.  We will endeavor to honor such requests unless such a request conflicts with certain lawful exemptions under the CCPA.  Please note that we are only required to honor requests to know twice in a 12-month period.<\/p>\n<p>We do not discriminate against California residents who exercise any of their rights described in our Privacy Policy. Your exercise of these rights will have no adverse effect on the price and quality of our goods or services.<\/p>\n<p>In addition, and as set forth below, California law requires us to identify, for the 12-month period prior to the date of this Privacy Policy, what information we may have “sold” or “shared” about you. For the 12-month period prior to the date of this Privacy Policy, WES has not sold any personal information about its customers. For the 12-month period prior to the date of this Privacy Policy, WES has only shared personal information about its customers as described above.  WES does not use or disclose sensitive personal information, as defined in applicable laws, for any purposes other than those permitted by applicable law.<\/p>\n<p><strong>Opt-Out Preference Signals<\/strong>:  We are working towards enabling Global Privacy Control (GPC) as an additional way for you to submit a request to opt-out of the sale and sharing of your personal information through browsers and\/or browser extensions that support such a signal.  Until then, you can opt-out of the use of third-party cookies for personalized advertising as described above.<\/p>\n<p>California Civil Code Section 1798.83 (California’s “Shine the Light” law) permits users of our Website or Application that are California residents and who provide Personal Data in obtaining products and services for personal, family, or household use to request certain information regarding our disclosure of Personal Data to third parties for their own direct marketing purposes. If applicable, this information would include the categories of Personal Data and the names and addresses of those businesses with which we shared your Personal Data for the immediately prior calendar year (<em>e.g<\/em>., requests made in 2023 will receive information regarding such activities in 2022). You may request this information once per calendar year. To make such a request, please contact us using the information below in <strong>Contact Information<\/strong>. If you make this request via email, please use the subject “California Shine the Light Request.”<\/p>\n<h2>6. Data Security<\/h2>\n<p>We have implemented physical, organization, contractual and technological measures designed to secure your Personal Data from accidental loss and from unauthorized access, use, alteration, and disclosure. All browser and other network connections to the Website and to our servers through our Application are encrypted using SSL technology.  All credit card processing is handled by a third party payment gateway that is compliant with the Payment Card Industry Data Security Standard (PCI – DSS). Any information sent to WES in a physical format such as paper, is scanned into an electronic format and physical copies are securely destroyed.  All electronic information is stored securely using industry standard access control and data protection mechanisms. WES deploys various security measures to protect the integrity of our systems, including intrusion prevention and detection systems.<\/p>\n<p>The safety and security of your information also depends on you. Where we have given you (or where you have chosen) a password for access to certain parts of our Website or the Application, you are responsible for keeping this password confidential. We ask that you use a unique password for our site and that you not share your password with anyone. To protect your security, you may be prompted to change your password from time to time.  In keeping with security best practices, WES stores a cryptographic hash of your password rather than the password itself. If you forget your password we can help you reset your account and choose a new password, but we will not be able to retrieve your old password.<\/p>\n<p>Unfortunately, the transmission of information via the Internet is not completely secure. Although we do our best to protect your Personal Data, we cannot guarantee the security of your Personal Data transmitted to our Website or through our Application. Any transmission of Personal Data is at your own risk. We are not responsible for circumvention of any privacy settings or security measures contained in our Application or on the Website or our servers accessed through our Application.<\/p>\n<h2>7. Cross-Border Transfers of Personal Data<\/h2>\n<p>If you are a resident of the European Economic Area (“<strong>EEA<\/strong>”) or Canada, in order to provide our Services, we may send and store your Personal Data outside of the EEA and Canada, including in the United States. Accordingly, your Personal Data may be transferred outside the country where you reside or are located, including to countries that may not or do not provide an adequate level of protection for your Personal Data. Your information may be processed and stored in the United States and other jurisdictions, and the federal, state, and local governments, courts, law enforcement, or regulatory agencies in these jurisdictions may be able to obtain disclosure of your information through local laws. By using our Services, you represent that you have read and understood the above and consent to the storage and processing of Personal Data that you provide to our Services in locations outside of the EEA and Canada, including, but not limited to, in the United States.<\/p>\n<p>If applicable, your Personal Data is transferred by WES to another country only if it is required or permitted under applicable data protection law and provided that there are appropriate safeguards in place to protect your Personal Data. To ensure your Personal Data (other than Personal Data you provided directly to our Services located outside the EEA) is treated in accordance with this Privacy Policy, WES uses Data Protection Agreements between WES and all other recipients of your data that include, where applicable, the Standard Contractual Clauses adopted by the European Commission (the “<strong>Standard Contractual Clauses<\/strong>”). The European Commission has determined that the transfer of Personal Data pursuant to the Standard Contractual Clauses provides an adequate level of protection of your Personal Data. Under these Standard Contractual Clauses, you have the same rights as if your data was not transferred to such third parties. You may request a copy of the Data Protection Agreement by contacting us through <strong>Contact Information<\/strong> below.<\/p>\n<h2>8. Data Retention Policy<\/h2>\n<p>Data gathered on users of our Website, Application, and marketing tools is maintained:<\/p>\n<ul>\n<li>for as long as necessary to comply with the purpose for which it was collected or for any legal requirement;<\/li>\n<li>for as long as necessary to provide verification of your credentials and to prevent fraud;<\/li>\n<li>on our backup and disaster recovery systems in accordance with our backup and disaster recovery policies and procedures;<\/li>\n<li>for as long as necessary to protect our legal interests or otherwise pursue our legal rights and remedies; and<\/li>\n<li>for data that has been aggregated or otherwise rendered anonymous in such a manner that you are no longer identifiable, indefinitely.<\/li>\n<\/ul>\n<p>The criteria used to determine our retention periods include: (a) the length of time we have an ongoing relationship with you and provide services, (b) whether there is a legal obligation to which we are subject, and (c) whether retention is advisable in light of our legal position (such as in regard to applicable statutes of limitations, litigation or regulatory investigations).<\/p>\n<h2>9. Personal Data of Minors (Children Under the Age of 16)<\/h2>\n<p>WES only provides services for children under the age of 16 if their parent or legal guardian provides us with their information.  If you are under 16, do not register on the Website or in the Application, provide information to our Services, or provide any information about yourself to us, including your name, address, telephone number, email address, or any screen name or user name you may use. If we learn we have collected or received any information from a child under 16 without verification of parental or guardian consent, we will delete that information. If you believe we might have any information from or about a child under 16, please contact us at <strong>Contact Information<\/strong> below.  Minors under 18 years of age may have the personal information that they have provided to us through this Site deleted by sending an email to privacy@wes.org requesting deletion.  We do not have actual knowledge about selling or sharing personal information of consumers under the age of 16.<\/p>\n<h2>10. Changes to Our Privacy Policy<\/h2>\n<p>We may change this Privacy Policy at any time. It is our policy to post any changes we make to our Privacy Policy on this page with a notice that the Privacy Policy has been updated on the <a href=\"https:\/\/www.wes.org\/important-wes-notices\/\">Important WES Notices<\/a> page and on our Application. If we make material changes to how we treat our users’ Personal Data, we will notify you by email to the email address specified in your account and\/or through a notice on the Website home page and Application main screen. The date this Privacy Policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable email address for you, and for periodically visiting our Website or accessing the Application and this Privacy Policy to check for any changes.<\/p>\n<h2>11. Contact Information<\/h2>\n<p>WES has appointed a Data Protection Officer and a representative in the European Union (“EU”) in compliance with GDPR.  If you have any questions, concerns, complaints or suggestions regarding our Privacy Policy, have any requests related to your Personal Data pursuant to applicable laws, or otherwise need to contact us, please contact us at the contact information below or through the <strong>Contact Us<\/strong> page on our Website or in the Application.<\/p>\n<p><strong>WES (Controller)<\/strong><br \/>\nWorld Education Services<br \/>\nBowling Green Station<br \/>\nP.O. Box 5087<br \/>\nNew York, NY 10274-5087<\/p>\n<p><strong>Global WES Data Protection <\/strong><br \/>\n<strong>privacy@wes.org<\/strong><br \/>\nWorld Education Services<br \/>\nBowling Green Station<br \/>\nP.O. Box 5087<br \/>\nNew York, NY 10274-5087<\/p>\n<p>If you are a resident of the EU or if you have a question or concern about our compliance with GDPR, you must also contact our representative in the EU using the contact information below. Our EU representative will not pass along any academic records to WES, and they will be deleted in compliance with GDPR.<\/p>\n<p>For instructions on how to send academic documents to WES, please refer to our <strong><a href=\"https:\/\/applications.wes.org\/required-documents\/\">Required Documents page<\/a><\/strong>, or <strong><a href=\"https:\/\/www.wes.org\/contact-us\/\">Contact Us<\/a><\/strong> for more information.<\/p>\n<p><strong>EU Data Protection Representative<\/strong><br \/>\nDataRep<br \/>\nOffice 29, Clifton House<br \/>\nFitzwilliam Street Lower<br \/>\nDublin, Ireland<br \/>\n<strong>https:\/\/www.datarep.com\/wes <\/strong><\/p>\n","intro_item_headline":"","intro_item_text":"<style>\n.gen_page .intro__content p {margin-bottom: 1em;}\n.gen_page .intro h2 {margin-top: 1em;}\n.gen_page .intro p em {font-style: italic;}\n<\/style>\n","intro_item_image":false,"intro_more_button":"","intro_more_button_cta_link":"","intro_more_button_new_window":[],"intro_more_button_content":"","main_content_title":"","main_content_item_1_headline":"","main_content_item_1_text":"","main_content_item_1_image":false,"main_content_item_1_cta_text":"","main_content_item_1_cta_link":"","item_1_cta_link_new_window":[],"main_content_item_2_headline":"","main_content_item_2_text":"","main_content_item_2_image":false,"main_content_item_2_cta_text":"","main_content_item_2_cta_link":"","item_2_cta_link_new_window":[],"main_content_item_3_headline":"","main_content_item_3_text":"","main_content_item_3_image":false,"main_content_item_3_cta_text":"","main_content_item_3_cta_link":"","item_3_cta_link_new_window":[],"main_content_item_4_headline":"","main_content_item_4_text":"","main_content_item_4_image":false,"main_content_item_4_cta_text":"","main_content_item_4_cta_link":"","item_4_cta_link_new_window":[],"main_content_item_5_headline":"","main_content_item_5_text":"","main_content_item_5_image":false,"main_content_item_5_cta_text":"","main_content_item_5_cta_link":"","item_5_cta_link_new_window":[],"main_content_item_6_headline":"","main_content_item_6_text":"","main_content_item_6_image":false,"main_content_item_6_cta_text":"","main_content_item_6_cta_link":"","item_6_cta_link_new_window":[],"main_content_item_7_headline":"","main_content_item_7_text":"","main_content_item_7_image":false,"main_content_item_7_cta_text":"","main_content_item_7_cta_link":"","item_7_cta_link_new_window":[],"evaluation_reports":false,"page_maf":false,"custom_body_class":"","hide_language_switcher":false,"custom_menu":"","alert_msg":"default"},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - World Education Services<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy\" \/>\n<meta property=\"og:description\" content=\"World Education Services (WES) collects information required to evaluate educational credentials. WES recognizes the importance of protecting the privacy of the persons who submit their credentials for evaluation. Any information shared between applicants and WES is protected in accordance with applicable laws and the policies stated below.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-04T14:06:15+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/privacy-policy\/\",\"url\":\"https:\/\/www.wes.org\/privacy-policy\/\",\"name\":\"Privacy Policy - World Education Services\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"datePublished\":\"2017-02-23T17:33:49+00:00\",\"dateModified\":\"2023-09-04T14:06:15+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/privacy-policy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/privacy-policy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/privacy-policy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Privacy Policy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Privacy Policy - World Education Services","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/privacy-policy\/","og_locale":"en_US","og_type":"article","og_title":"Privacy Policy","og_description":"World Education Services (WES) collects information required to evaluate educational credentials. WES recognizes the importance of protecting the privacy of the persons who submit their credentials for evaluation. Any information shared between applicants and WES is protected in accordance with applicable laws and the policies stated below.","og_url":"https:\/\/www.wes.org\/privacy-policy\/","og_site_name":"World Education Services","article_modified_time":"2023-09-04T14:06:15+00:00","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/privacy-policy\/","url":"https:\/\/www.wes.org\/privacy-policy\/","name":"Privacy Policy - World Education Services","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"datePublished":"2017-02-23T17:33:49+00:00","dateModified":"2023-09-04T14:06:15+00:00","breadcrumb":{"@id":"https:\/\/www.wes.org\/privacy-policy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/privacy-policy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/privacy-policy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Privacy Policy"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/1217"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=1217"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/1217\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=1217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/categories?post=1217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/tags?post=1217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}