{"id":26180,"date":"2020-10-27T15:01:23","date_gmt":"2020-10-27T19:01:23","guid":{"rendered":"https:\/\/www.wes.org\/?page_id=26180"},"modified":"2020-10-27T15:17:20","modified_gmt":"2020-10-27T19:17:20","slug":"world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas","status":"publish","type":"page","link":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/","title":{"rendered":"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas "},"content":{"rendered":"","protected":false},"excerpt":{"rendered":"","protected":false},"author":46,"featured_media":0,"parent":195,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/student-default.php","meta":{"footnotes":""},"categories":[],"tags":[],"better_featured_image":null,"acf":{"intro_title":"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas ","intro_text":"<p>New York, NY—(October 27, 2020)- On October 26, World Education Services (WES) submitted a public comment in opposition to the U.S. Department of Homeland Security’s (DHS) proposed regulation <em>Establishing a Fixed Time Period of Admission and an Extension of Stay Procedure for Nonimmigrant Academic Students, Exchange Visitors, and Representatives of Foreign Information Media<\/em> to set fixed periods on the length of time international students can remain in the United States, arguing that the proposed rule would place an unnecessary and harmful burden on international students, higher education institutions, and the U.S. economy.<\/p>\n<p>The proposed policy would impose a considerable financial burden on international students and make their course of study in the U.S. unpredictable. This proposal provides no guarantee that international students would be able to remain in the U.S. for the duration of their academic program, fails to provide international students sufficient time to complete degrees in many academic programs, and usurps the role of academic institutions to provide their students with academic oversight. In addition, the two-year time limit on visas for students from countries DHS has designated as having more than a 10 percent visa overstay rate would disproportionately impact students from Africa.<\/p>\n<p>In its public comment, WES states that DHS has not provided a compelling reason for setting fixed time periods for student visas. WES makes the case that such a rule would have a devastating impact on the ability of the U.S. to attract talent from around the world, a ramification of which includes the loss of billions of dollars that international students contribute to the U.S. economy each year.<\/p>\n<p>Read the full comment below.<\/p>\n<hr \/>\n<p>October 26, 2020<\/p>\n<p>&nbsp;<\/p>\n<p>Sharon Hageman<br \/>\nActing Regulatory Unit Chief, Office of Policy and Planning<br \/>\nU.S. Immigration and Customs Enforcement<br \/>\nU.S. Department of Homeland Security<br \/>\n500 12th Street SW<br \/>\nWashington, D.C. 20536<\/p>\n<p>&#8211;<\/p>\n<p><strong>Re: DHS Docket No. ICEB-2019-0006-0001<\/strong><\/p>\n<p>World Education Services (WES) submits this comment in response to the U.S. Department of Homeland Security’s (DHS) Notice of Proposed Rulemaking, <em>Establishing a Fixed Time Period of Admission and an Extension of Stay Procedure for Nonimmigrant Academic Students, Exchange Visitors, and Representatives of Foreign Information Media<\/em>, published in the Federal Register on September 25, 2020.<\/p>\n<p>WES is a 501(c)3 non-profit social enterprise dedicated to helping international students, immigrants, and refugees achieve their educational and workplace goals in the United States and Canada. Founded in 1974, WES evaluates and advocates for the recognition of international education qualifications, supports the integration of immigrants and refugees into the workforce, and provides philanthropic funding to immigrant- and refugee-serving organizations. Over more than 45 years, WES has provided credential evaluations to nearly three million individuals from around the globe.<\/p>\n<p>WES urges DHS to withdraw the above-referenced proposed regulation, which would unduly burden higher education institutions and international students across the U.S. The COVID-19 pandemic has strained international students and academic institutions to an unprecedented degree. Establishing new regulations while students and educational institutions are already under such tremendous pressure is unnecessary and misguided.<\/p>\n<p><strong>Background<\/strong><\/p>\n<p>DHS’ proposed rule seeks to limit the length of time that international students and other temporary visa holders can remain in the U.S. The rule would change existing admission periods for international students and certain other non-immigrant visa holders from “duration of status” to fixed time periods. For international students, the rule proposes setting the authorized admission and extension periods as the length of the student’s specific educational program, not to exceed a two- or four-year period plus a period of 30 days following their program end date.<\/p>\n<p>Although the proposed rule would permit certain students to seek an extension of status (EOS) beyond a two- or four-year admission period, it is unclear when or how such extensions would be granted. According to the proposal, students seeking a program extension must first request the extension from a designated school official (DSO). If the DSO recommends the extension, the student must then apply for an EOS from U.S. Citizenship and Immigration Services (USCIS). Overall, the proposal would create a lengthy and opaque adjudication process for students and academic institutions.<\/p>\n<p>In addition, the proposed rule subjects some students to a limited two-year visa. To remain in the U.S. beyond the two-year period, students would be required to submit applications to USCIS for an extension of their stay. Those subject to the two-year limit include students born in or citizens of countries designated by the U.S. as state sponsors of terrorism or countries with a visa overstay rate of greater than 10 percent. The list of affected countries disproportionately impacts African nations and students. Others affected by the proposed rule’s two-year limitation include international students attending unaccredited schools or schools that do not participate in the E-Verify program. Students participating in English language programs would also be limited to one lifetime two-year admission period.<\/p>\n<p>DHS also proposes to limit a student’s period of stay to a maximum of two years based on certain other factors determined by DHS to be in the national interest. For example, the proposed rule, citing national security concerns, states that DHS could limit the length of admission of students enrolled in specific coursework, such as nuclear science. In addition to the maximum stay requirements proposed under the rule, DHS proposes to limit the number of times a student can change programs within an educational level.<\/p>\n<p>With respect to work authorization, the proposed rule does not provide an automatic extension of employment authorization while an application for an extension of stay is pending for students interning for an international organization, engaging in curricular practical training (CPT), or engaging in pre- or post-completion optional practical training (OPT). Under the proposed rule, CPT may not be granted for a period exceeding a student’s fixed date of admission; a student cannot engage in CPT until USCIS approves a timely filed EOS request.<\/p>\n<p><strong>I. The proposed rule would harm international students, academic institutions, and the economy. <\/strong><\/p>\n<p>The proposed rule would have a devastating impact on the ability of the U.S. to attract talent from around the world, and would undoubtedly exacerbate the current decreases in international student enrollment across the country.<a href=\"#_ftn1\" name=\"_ftnref1\"><sup>[1]<\/sup><\/a> Such steep declines would lead to significant financial ramifications for higher education institutions and the U.S. economy. The Bipartisan Policy Center estimates that international students contribute approximately $20 billion in tuition and fees to U.S. academic institutions each year.<a href=\"#_ftn2\" name=\"_ftnref2\"><sup>[2]<\/sup><\/a> According to the U.S. Department of Commerce, international students contributed $44.7 billion to the U.S. economy in 2018.<a href=\"#_ftn3\" name=\"_ftnref3\"><sup>[3]<\/sup><\/a><\/p>\n<p>The proposed policy would also impose considerable financial burdens on international students and make their course of study in the U.S. unpredictable. According to DHS estimates, the additional costs of each extension of stay application could total more than $1,000. Furthermore, U.S. higher education institutions would be unable to provide incoming or prospective international students with assurances that they would be able to remain in the U.S. for the duration of their academic program. As a result, the U.S. could lose a critical pipeline of talented students.<\/p>\n<p>The proposed regulation would have a negative economic impact on academic institutions and would divert needed institutional resources to comply with a rule that offers no demonstrable benefits. DHS estimates that training and implementation of the proposed rule would cost higher education institutions hundreds of millions of dollars over the next decade. However, these estimates significantly undervalue the actual costs of the proposed regulation. For example, DHS’ cost estimates do not account for the staffing required to advise students and update internal systems and processes, nor do they account for the anticipated loss in tuition revenue from projected declines in international student enrollments. At a time when academic institutions already face significant revenue losses due to the COVID-19 pandemic, these additional compliance costs coupled with a projected decrease in international student enrollment would have devastating financial consequences for the U.S. higher education system.<\/p>\n<p><strong>II.DHS has not demonstrated a compelling need for the proposed rule, nor that it is necessary to ensure compliance with visa regulations. <\/strong><\/p>\n<p>Through the existing <a href=\"https:\/\/studyinthestates.dhs.gov\/sevis-help-hub\">Student and Exchange Visitor Information System (SEVIS)<\/a>, which tracks higher education institutions and international students, DHS can monitor detailed information on students during their time in the U.S. However, the proposed rule would require students to provide USCIS information that higher education institutions <em>already provide<\/em> through SEVIS. In addition, DHS presently has the authority under current regulations to request additional information from higher education institutions to ensure compliance with visa requirements. Accordingly, the extension of stay process proposed under this rule is an unnecessary and inefficient use of government resources.<\/p>\n<p>DHS has not demonstrated a legitimate need for the proposed two-year admission limits for international students from nations that DHS has designated as having more than 10 percent visa overstay rates—the vast majority of which are African nations. DHS relies on flawed data to justify the proposed two-year maximum stay. Specifically, the data include not only estimates of visa overstay rates, but also estimates of individuals whom DHS could not identify as having departed the U.S.,<a href=\"#_ftn4\" name=\"_ftnref4\"><sup>[4]<\/sup><\/a> thus skewing the visa overstay rate.<\/p>\n<p>Lastly, the proposed rule seeks to limit the amount of time international students who attend institutions that do not participate in the E-Verify program can remain in the U.S. The E-Verify program, which has been widely criticized for its error rates and for misidentifying eligible workers as ineligible to work in the U.S., should not form the basis for limiting international students to two-year visas.<a href=\"#_ftn5\" name=\"_ftnref5\"><sup>[5]<\/sup><\/a><\/p>\n<p><strong>III. The proposed rule usurps the role of educational institutions in academic decision-making.<\/strong><\/p>\n<p>DHS proposes to eliminate the “normal progress” standard with respect to seeking a program extension. The proposed new standard for requesting an extension of status for additional time to complete a program would require: (1) compelling academic reasons; (2) a documented illness or medical condition; or (3) exceptional circumstances. This proposal would encroach on the autonomy of higher education institutions to determine whether and when to grant students additional time to complete a degree. Immigration officers are not qualified to make assessments of students’ academic progress. Furthermore, the “compelling academic reasons” standard is not clearly defined by the proposed rule, giving the federal government unfettered discretion to determine whether a student has made adequate academic progress, which could lead to inconsistent and unfair outcomes for students across the U.S.<\/p>\n<p><strong>IV. The proposed fixed periods for student admissions do not conform to academic programs and fail to address students’ reliance interests on current policy.<\/strong><\/p>\n<p>The proposed rule fundamentally alters the agreement between students and institutions midway through the program and fails to provide international students sufficient time to complete degrees in many academic programs, including doctoral programs, surgery residencies, neuroscience postdoctoral programs, joint degree programs, bachelor’s\/master’s programs. According to data from the National Center for Education Statistics (NCES), bachelor’s students needed more than four years to complete their degrees in the 2015\/16 academic year.<a href=\"#_ftn6\" name=\"_ftnref6\"><sup>[6]<\/sup><\/a> Similarly, many students interested in acquiring practical experience through the OPT or CPT programs would be unable to do so without approved extensions from USCIS.<\/p>\n<p><strong>V. The proposed rule would exacerbate existing processing delays at USCIS.<\/strong><\/p>\n<p>The proposed regulation is unworkable because of the uncertainty it creates and the lengthy processing times for extension of stay applications. Currently, extension requests for international student visas can take more than seven months to process. According to DHS estimates the proposed rule would require USCIS to process hundreds of thousands of extension of stay requests for international students each year. This volume of work would dramatically increase waiting times￼ worsening￼ existing backlogs at USCIS, and resulting in uncertainty, disruption, and harm to students and their academic institutions Increasing the number of applications USCIS must adjudicate when the agency is already facing massive backlogs and a severe budget crisis would further undermine the agency’s mission.<\/p>\n<p><strong>Conclusion<\/strong><\/p>\n<p>WES urges DHS to withdraw the proposed regulation which would have a detrimental effect on students, academic institutions, and communities. Instead, WES recommends that current regulations relating to duration of status for international students remain in effect. Thank you for the opportunity to submit comments on the <em>Notice of Proposed Rulemaking, Establishing a Fixed Time Period of Admission and an Extension of Stay Procedure for Nonimmigrant Academic Students, Exchange Visitors, and Representatives of Foreign Information Media<\/em>.<\/p>\n<p>Sincerely,<\/p>\n<p>&nbsp;<\/p>\n<p>World Education Services<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> <em>See<\/em> National Student Clearinghouse Research Center, <em>National Student Clearinghouse Research Center’s Monthly Update on Higher Education Enrollment <\/em>(October 2020), available at: https:\/\/nscresearchcenter.org\/stay-informed\/.<\/p>\n<p><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> <em>See<\/em> Bipartisan Policy Center, <em>Barring International Students Could Cost Universities Billions (June 2020)<\/em>, available at: https:\/\/bipartisanpolicy.org\/blog\/barring-international-students-could-cost-universities-billions\/.<\/p>\n<p><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> <em>See<\/em> Institute of International Education, <em>Number of International Students in the United States Hits All-Time High <\/em>(November 2019), available at: https:\/\/www.iie.org\/Why-IIE\/Announcements\/2019\/11\/Number-of-International-Students-in-the-United-States-Hits-All-Time-High.<\/p>\n<p><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> <em>See<\/em> National Foundation for American Policy, <em>Policy Brief: International Students and DHS Data<\/em> (September 2020), available at: https:\/\/nfap.com\/wp-content\/uploads\/2020\/09\/Analysis-of-DHS-Data-on-International-Students.NFAP-Policy-Brief.September-2020-1.pdf.<\/p>\n<p><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> <em>See<\/em> American Immigration Council, <em>Government Agencies and E-Verify: Erroneous Results and Misuse Cost Workers Their Jobs<\/em>(2012), available at: https:\/\/www.americanimmigrationcouncil.org\/research\/government-agencies-and-e-verify-erroneous-results-and-misuse-cost-workers-their-jobs; Cato Institute, <em>E‐​Verify Has Delayed or Cost Half a Million Jobs for Legal Workers<\/em> (2017), available at: https:\/\/www.cato.org\/blog\/e-verify-has-held-or-cost-jobs-half-million-legal-workers.<\/p>\n<p><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> <em>See<\/em> National Center for Education Statistics, <em>Median and percentage distribution of number of months from first enrollment to bachelor’s degree completion among 2015–16 first-time bachelor’s degree recipients, by demographic and enrollment characteristics: 2017, <\/em>available at: https:\/\/nces.ed.gov\/fastfacts\/display.asp?id=569.<\/p>\n","evaluation_reports":false,"intro_item_headline":"","intro_item_text":"","intro_item_image":false,"intro_more_button":"","intro_more_button_cta_link":"","intro_more_button_new_window":[],"intro_more_button_content":"","main_content_title":"","main_content_item_1_headline":"","main_content_item_1_text":"","main_content_item_1_image":false,"main_content_item_1_cta_text":"","main_content_item_1_cta_link":"","item_1_cta_link_new_window":[],"main_content_item_2_headline":"","main_content_item_2_text":"","main_content_item_2_image":false,"main_content_item_2_cta_text":"","main_content_item_2_cta_link":"","item_2_cta_link_new_window":[],"main_content_item_3_headline":"","main_content_item_3_text":"","main_content_item_3_image":false,"main_content_item_3_cta_text":"","main_content_item_3_cta_link":"","item_3_cta_link_new_window":[],"main_content_item_4_headline":"","main_content_item_4_text":"","main_content_item_4_image":false,"main_content_item_4_cta_text":"","main_content_item_4_cta_link":"","item_4_cta_link_new_window":[],"main_content_item_5_headline":"","main_content_item_5_text":"","main_content_item_5_image":false,"main_content_item_5_cta_text":"","main_content_item_5_cta_link":"","item_5_cta_link_new_window":[],"main_content_item_6_headline":"","main_content_item_6_text":"","main_content_item_6_image":false,"main_content_item_6_cta_text":"","main_content_item_6_cta_link":"","item_6_cta_link_new_window":[],"main_content_item_7_headline":"","main_content_item_7_text":"","main_content_item_7_image":false,"main_content_item_7_cta_text":"","main_content_item_7_cta_link":"","item_7_cta_link_new_window":[],"main_content_item_8_headline":"","main_content_item_8_text":"","main_content_item_8_image":false,"main_content_item_8_cta_text":"","main_content_item_8_cta_link":"","item_8_cta_link_new_window":[],"main_content_item_9_headline":"","main_content_item_9_text":"","main_content_item_9_image":false,"main_content_item_9_cta_text":"","main_content_item_9_cta_link":"","item_9_cta_link_new_window":[],"main_content_item_10_headline":"","main_content_item_10_text":"","main_content_item_10_image":false,"main_content_item_10_cta_text":"","main_content_item_10_cta_link":"","item_10_cta_link_new_window":[]},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas  - World Education Services<\/title>\n<meta name=\"description\" content=\"World Education Services (WES) Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas \" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas \" \/>\n<meta property=\"og:description\" content=\"World Education Services (WES) Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas \" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2020-10-27T19:17:20+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/\",\"url\":\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/\",\"name\":\"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas  - World Education Services\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"datePublished\":\"2020-10-27T19:01:23+00:00\",\"dateModified\":\"2020-10-27T19:17:20+00:00\",\"description\":\"World Education Services (WES) Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas \",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Resources for Journalists\",\"item\":\"https:\/\/www.wes.org\/resources-for-journalists\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas \"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas  - World Education Services","description":"World Education Services (WES) Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas ","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/","og_locale":"en_US","og_type":"article","og_title":"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas ","og_description":"World Education Services (WES) Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas ","og_url":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/","og_site_name":"World Education Services","article_modified_time":"2020-10-27T19:17:20+00:00","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/","url":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/","name":"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas  - World Education Services","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"datePublished":"2020-10-27T19:01:23+00:00","dateModified":"2020-10-27T19:17:20+00:00","description":"World Education Services (WES) Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas ","breadcrumb":{"@id":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/resources-for-journalists\/world-education-services-submits-public-comment-opposing-proposed-rule-setting-time-limits-on-international-student-visas\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"Resources for Journalists","item":"https:\/\/www.wes.org\/resources-for-journalists\/"},{"@type":"ListItem","position":3,"name":"World Education Services Submits Public Comment Opposing Proposed Rule Setting Time Limits on International Student Visas "}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":"en_US","wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/26180"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/users\/46"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=26180"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/26180\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/pages\/195"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=26180"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/categories?post=26180"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/tags?post=26180"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}