{"id":11509,"date":"2017-02-23T17:34:39","date_gmt":"2017-02-23T17:34:39","guid":{"rendered":"https:\/\/www.wes.org\/ca\/privacy-policy\/"},"modified":"2023-09-23T04:54:15","modified_gmt":"2023-09-23T08:54:15","slug":"politique-de-confidentialite","status":"publish","type":"page","link":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/","title":{"rendered":"Politique de confidentialité \\"},"content":{"rendered":"","protected":false},"excerpt":{"rendered":"<p>World Education Services, Inc. (“WES”, “us” or “we”) is committed to protecting your Personal Information (as defined below) through ensuring that all Personal Information provided to us is treated with care and, subject to this Privacy Policy (“Policy”), is not used or disclosed in ways to which you have not consented. This Policy governs the collection, use and disclosure of your Personal Information in any communication or interaction you may have with us, whether it be in person, through an authorized agent, over the telephone, in writing, or electronically.<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":4146,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/policies-default-template.php","meta":{"footnotes":""},"categories":[],"tags":[],"better_featured_image":null,"acf":{"intro_title":"<span>Politique<\/span> de confidentialité","intro_text":"<p>Dernière modification : 18 décembre 2018<\/p>\n<p>World Education Services (<strong>« WES »<\/strong>) respecte votre privée et s’engage à la protéger. La présente <strong>Politique de confidentialité<\/strong> est la description des types de renseignements que nous pouvons collecter auprès de vous et d’autres personnes, ainsi que de nos pratiques en matière d’utilisation, de conservation, de protection et de divulgation de ces renseignements. Nous collectons des renseignements auprès de vous par le biais de notre <strong>site Web<\/strong>, <a href=\"https:\/\/www.wes.org\/fr\/ca\/\">https:\/\/www.wes.org\/fr\/ca\/<\/a> et de notre application mobile « l’<strong>application <\/strong>», notamment quand vous nous demandez de l’information ou quand vous sollicitez nos services d’évaluation et de vérification des diplômes (désignés collectivement sous le terme de nos « <strong>services<\/strong> »). Nous collectons également de l’information à votre sujet auprès d’autres sources quand nous fournissons nos services à votre demande. La présente politique ne s’applique pas aux renseignements collectés par les sites Web externes, accessibles à partir de notre site Web ou sur notre site Web ou sur notre application.<\/p>\n<p>Veuillez lire la présente politique attentivement afin de comprendre nos politiques et nos pratiques relativement à vos renseignements personnels, ainsi que nos méthodes de traitement de ces renseignements. Si vous n’acceptez pas nos politiques et nos pratiques, vous pouvez choisir de ne pas utiliser nos services. En accédant à notre site Web ou en l’utilisant ou en utilisant notre application, vous acceptez la présente Politique de confidentialité. Cette politique peut changer de temps en temps (voir <a href=\"#ChangesPrivacyPolicy\"><strong>Modifications de notre Politique de confidentialité<\/strong><\/a>). Comme votre poursuite de l’utilisation de nos services après les changements que nous effectuons est considérée comme votre acceptation de ces changements, veuillez consulter régulièrement les mises à jour de la présente politique.<\/p>\n<h3>Sections de la Politique<\/h3>\n<ul>\n<li><a href=\"#information-collection\">Renseignements que nous collectons à votre sujet et par quelles méthodes<\/a><\/li>\n<li><a href=\"#third-party-cookies\">Utilisation de témoins et d’autres technologies de suivi par des tiers<\/a><\/li>\n<li><a href=\"#data-processing\">Fondement juridique du traitement de vos données à caractère personnel<\/a><\/li>\n<li><a href=\"#sensitive-data\">Traitement des données sensibles à caractère personnel<\/a><\/li>\n<li><a href=\"#automated-decisions\">Prise de décision automatisée<\/a><\/li>\n<li><a href=\"#use-of-data\">Notre utilisation de vos données à caractère personnel<\/a><\/li>\n<li><a href=\"#disclosure-of-data\">Divulgation de vos données à caractère personnel<\/a><\/li>\n<li><a href=\"#disclosure-choices\">Choix concernant notre utilisation et notre divulgation de vos données à caractère personnel<\/a><\/li>\n<li><a href=\"#your-rights\">Vos droits d’accès à vos données à caractère personnel et de rectification<\/a><\/li>\n<li><a href=\"#california-privacy\">Vos droits à la protection de la vie privée en Californie<\/a><\/li>\n<li><a href=\"#data-security\">Sécurité des données<\/a><\/li>\n<li><a href=\"#eea-consent\">Consentement au traitement des données à caractère personnel aux États-Unis et dans d’autres pays en dehors de l’Espace économique européen<\/a><\/li>\n<li><a href=\"#data-retention\">Politique de conservation des données<\/a><\/li>\n<li><a href=\"#children\">Enfants de moins de 16 ans<\/a><\/li>\n<li><a href=\"#policy-changes\">Modifications de notre Politique de confidentialité<\/a><\/li>\n<li><a href=\"#contact\">Coordonnées<\/a><\/li>\n<\/ul>\n<p>Politique pertinente : <a href=\"https:\/\/www.wes.org\/fr\/ca\/politique-d-utilisation-des-temoins\/\">Politique d’utilisation des témoins<\/a><\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"information-collection\">Renseignements que nous collectons à votre sujet et par quelles méthodes<\/h3>\n<p>La présente politique porte sur nos méthodes de collecte, d’utilisation et de protection de tous les renseignements à votre sujet, y compris les renseignements personnels qui permettent directement ou indirectement de vous identifier (« données à caractère personnel »). Les données à caractère personnel sont notamment :<\/p>\n<ul>\n<li>votre nom, adresse postale, adresse de courriel, numéro de téléphone, date de naissance, numéro d’identification d’étudiant, documents éducatifs (diplômes, suppléments aux diplômes, relevés de notes, attestations délivrées par les établissements et autres documents similaires pouvant varier selon le pays où vous avez suivi vos études), numéro d’identification de WES, moyenne pondérée cumulative (MPC), permis d’exercice, type de reconnaissance professionnelle, numéro de permis ou de reconnaissance professionnelle, pays de résidence et où vous avez effectué vos études, questions de sécurité et réponses à ces questions et autres renseignements pouvant figurer sur un document que vous présentez ou qu’une organisation présente, à votre demande, à nos services;<\/li>\n<li>renseignements sur votre connexion Internet, comme votre adresse IP et vos données de localisation, l’équipement que vous utilisez pour accéder à notre site Web ou pour vous servir de notre application (système d’exploitation, type d’appareil mobile et\/ou type de navigateur) et renseignements détaillés sur votre utilisation de notre site Web ou de notre application.<\/li>\n<\/ul>\n<h4>Renseignements fournis par vous et par des tiers<\/h4>\n<p>WES est le responsable du traitement de vos données à caractère personnel conformément à la définition du Règlement général sur la protection des données de l’Union européenne (« RGPD »). Nous traitons vos données à caractère personnel conformément au RGPD et conformément à la Loi sur la protection des renseignements personnels et les documents électroniques (Canada) et aux lois provinciales essentiellement similaires de l’Alberta, de la Colombie-Britannique et du Québec. Nous collectons les données à caractère personnel nécessaires pour nos services auprès des sources suivantes :<\/p>\n<ul>\n<li>les formulaires que vous remplissez sur notre site Web ou dans notre application quand vous commandez une évaluation de vos diplômes par WES, que vous utilisez les outils du site Web ou de l’application de WES, que vous vous inscrivez à une activité organisée par WES ou que vous utilisez d’autres services en ligne;<\/li>\n<li>les documents que vous nous envoyez en liaison avec les services que vous demandez;<\/li>\n<li>les renseignements fournis par les tiers que vous mentionnez sur votre demande et que vous autorisez à nous fournir des renseignements;<\/li>\n<li>toute la correspondance que vous nous avez adressée et ses copies ou toute la correspondance adressée pour votre compte par des tiers, comme les établissements d’enseignement où vous avez étudié ou par d’autres organismes tiers, et les copies de cette correspondance;<\/li>\n<li>vos réponses à des enquêtes ou votre participation à des groupes de discussion ou à des études de mise à l’essai auprès des utilisateurs que nous vous avons peut-être demandé de remplir pour les besoins de nos recherches;<\/li>\n<li>des renseignements détaillés sur les services que vous nous commandez (y compris sur notre site Web ou par son truchement ou dans notre application ou par son truchement) et recueillis quand nous réalisons les services que vous nous demandez, y compris les renseignements financiers exigés pour commander ces services.<\/li>\n<\/ul>\n<p>Les données à caractère personnel que nous collectons auprès de vous peuvent être nécessaires pour conclure un contrat avec WES pour avoir accès à ses services d’évaluation et de vérification de vos diplômes. Si vous refusez de fournir ces données à caractère personnel ou si vous annulez votre consentement à notre traitement de vos données à caractère personnel, nous serons peut-être dans l’impossibilité de conclure ce contrat ou de remplir nos obligations envers vous en vertu de ce contrat.<\/p>\n<h4>Renseignements que nous collectons en utilisant des technologies de collecte automatique des données<\/h4>\n<p>Quand vous naviguez dans notre site Web et que vous interagissez avec lui ou que vous utilisez notre application, nous pouvons utiliser les technologies de collecte automatique des données ci-dessous afin de recueillir certains renseignements sur votre équipement, votre navigation et vos habitudes en ligne :<\/p>\n<ul>\n<li>renseignements sur vos consultations de notre site Web ou sur votre utilisation de notre application, à savoir données d’utilisation, données de localisation, journaux et autres données relatives à la communication et aux ressources de notre site Web et de notre application auxquelles vous accédez et que vous utilisez;<\/li>\n<li>renseignements sur votre ordinateur, votre appareil mobile et connexion Internet, à savoir adresse IP, système d’exploitation et type de navigateur.<\/li>\n<\/ul>\n<p>Nous utilisons ces technologies pour collecter de l’information sur vos activités sur notre site Web, dans notre application ou dans d’autres services en lignes (suivi comportemental). Certains navigateurs Web et certains systèmes d’exploitation mobiles vous permettent d’émettre un signal aux sites Web et aux services en ligne afin de leur indiquer que vous préférez qu’ils « ne suivent pas » vos activités en ligne. À l’heure actuelle, nous ne tenons pas compte des signaux de ce type et nous ne modifions pas l’information que nous collectons ou la manière dont nous l’utilisons à la suite de l’émission ou de la réception d’un signal de ce type.<\/p>\n<p>L’information que nous collectons automatiquement peut comprendre les données à caractère personnel que nous recevons de tiers. Cette information nous permet de perfectionner notre site Web et notre application, et d’améliorer et de personnaliser notre service en nous permettant de :<\/p>\n<ul>\n<li>estimer l’importance de notre auditoire et ses schémas d’utilisation;<\/li>\n<li>stocker de l’information sur vos préférences afin d’adapter notre site Web ou notre application à vos centres d’intérêts individuels;<\/li>\n<li>accélérer vos recherches;<\/li>\n<li>vous reconnaître quand vous revenez à notre site Web ou à notre application.<\/li>\n<\/ul>\n<p>Nous utilisons notamment les technologies ci-dessous pour cette collecte automatique des données.<\/p>\n<ul>\n<li><strong>Témoins (ou témoins de connexion).<\/strong> Un témoin est un petit fichier placé sur le disque dur de votre ordinateur. Nous ne plaçons des témoins sur votre disque dur qu’avec votre consentement. Vous pouvez refuser d’accepter les témoins de connexion en activant le réglage correspondant de votre navigateur ou dans votre système d’exploitation mobile. En revanche, si vous sélectionnez ce réglage, vous ne pourrez peut-être pas accéder à certaines parties de notre site Web ou de notre application, y compris pour ouvrir une session dans votre compte pour l’évaluation de vos diplômes. Vous pourrez trouver de plus amples renseignements sur les témoins à l’adresse <a href=\"https:\/\/www.allaboutcookies.org\" target=\"_blank\" rel=\"noopener\">https:\/\/www.allaboutcookies.org<\/a> et à l’adresse <a href=\"https:\/\/youronlinechoices.eu\" target=\"_blank\" rel=\"noopener\">https:\/\/youronlinechoices.eu<\/a>.<\/li>\n<li><strong>Balises Web.<\/strong> Les pages de notre site Web, les écrans dans notre application et nos courriels peuvent contenir de petits fichiers électroniques qu’on appelle des balises Web (appelés également GIF invisibles, pixels invisibles et GIF à pixel unique) qui permettent à WES, par exemple, de compter les utilisateurs qui ont consulté certaines pages, accédé à certains écrans ou ouvert un courriel ou d’obtenir d’autres statistiques d’utilisation du site Web et de l’application (enregistrement de la popularité d’un contenu particulier du site Web et de l’application, et vérification de l’intégrité du système et du serveur).<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 id=\"third-party-cookies\">Utilisation de témoins et d’autres technologies de suivi par des tiers<\/h3>\n<p>Du contenu ou des ressources émanant de tiers sont présents sur le site Web et dans l’application. Nous ne contrôlons pas les technologies de suivi de ces tiers ni leur utilisation. Si vous avez des questions au sujet d’une publicité ou d’un autre contenu ciblé, vous devriez communiquer directement avec le fournisseur responsable en suivant les liens fournis pour conduire à son site Web. Pour obtenir de plus amples renseignements sur ce que vous pouvez faire pour refuser de recevoir de la publicité ciblée de nombreux fournisseurs, lisez <a href=\"#DisclosingPersonalData\">Choix concernant notre utilisation et notre divulgation de vos données à caractère personnel<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"data-processing\">Fondement juridique du traitement de vos données à caractère personnel<\/h3>\n<p>Si vous résidez dans l’Union européenne ou au Canada, le traitement de vos données à caractère personnel n’est légal qu’à condition d’être autorisé par les lois applicables en matière de protection des données. Notre traitement de vos données à caractère personnel repose sur un fondement juridique (sauf quand une exception s’applique comme cela est indiqué ci-dessous). <\/p>\n<ul>\n<li><strong>Consentement.<\/strong> En utilisant nos services et en acceptant la présente Politique de confidentialité, vous consentez à notre collecte, utilisation et partage de vos données à caractère personnel selon les modalités décrites dans la présente Politique de confidentialité. Si vous ne consentez pas à la présente Politique de confidentialité, veuillez ne pas utiliser ce site Web ou l’application. Si vous résidez au Canada, vous donnez par la présente votre consentement à toute la collecte, toute l’utilisation et toute la divulgation de vos données à caractère personnel selon les modalités décrites dans la présente Politique de confidentialité.<\/li>\n<li><strong>Intérêts légitimes.<\/strong> Notre traitement de vos données à caractère personnel sera fondé sur nos intérêts légitimes. Nos intérêts légitimes visent plus précisément à : faciliter la communication entre WES et vous; améliorer notre site Web ou notre application en examinant votre utilisation de ceux-ci et les difficultés que vous pourriez rencontrer en les utilisant; améliorer nos produits en services en analysant les tendances statistiques pertinentes pour vous et pour d’autres utilisateurs; promouvoir nos services en utilisant votre courriel ou d’autres coordonnées pour communiquer avec vous; protéger notre infrastructure de TI et notre propriété intellectuelle en enregistrant votre adresse IP pour détecter les intrusions; détecter et prévenir les fraudes et autres activités criminelles et évaluer les risques. Nous concilions nos intérêts légitimes et vos droits et libertés et nous ne traitons pas vos données à caractère personnel si vos droits et libertés l’emportent sur nos intérêts légitimes. Si vous résidez au Canada, nous traitons vos données à caractère personnel que conformément au consentement donné ci-dessus, sauf pour des utilisations visant à protéger notre infrastructure de TI et notre propriété intellectuelle et à détecter et à prévenir les fraudes et autres activités criminelles.<\/li>\n<li><strong>Pour nous acquitter de nos obligations contractuelles envers vous.<\/strong> Nous traitons vos données à caractère personnel pour nous acquitter de nos obligations aux termes du contrat que nous avons conclu avec vous afin d’assurer nos services d’évaluation et de vérification de vos diplômes et de préparer notre rapport d’évaluation. Si vous résidez au Canada, nous n’accédons à vos données à caractère personnel et nous ne les utilisons ou ne les divulguons que conformément au consentement donné ci-dessus.<\/li>\n<li><strong>Comme la loi l’exige.<\/strong> Nous pouvons également traiter vos données à caractère personnel quand la loi l’exige ou nous le permet; pour nous conformer à une inspection et à des vérifications gouvernementales et à d’autres demandes valides du gouvernement ou d’autres autorités publiques; pour donner suite à des processus juridiques comme des assignations; ou, s’il y a lieu, pour protéger nos intérêts ou pour exercer autrement nos droits et recours juridiques (par exemple, quand cela est nécessaire pour prévenir ou détecter une fraude, des attaques contre notre réseau ou d’autres activités criminelles et nuisibles, pour nous défendre dans un litige et gérer des plaintes ou des réclamations). Si vous résidez au Canada, nous pourrons traiter vos données à caractère personnel dans les cas suivants : si nous avons des motifs raisonnables de croire que ces renseignements seraient utiles pour enquêter sur une infraction à des lois fédérales ou provinciales; en recouvrant une somme que vous devez à WES; pour nous conformer à une assignation, à un mandat ou à une ordonnance d&rsquo;un tribunal ou d’un autre organisme compétent; ou qu’ils seraient utiles pour une institution gouvernementales les ayant demandés. Pour toutes les autres utilisations de vos données à caractère personnel décrites dans la présente Politique de confidentialité, nous n’accédons à vos données à caractère personnel et nous ne les utilisons ou ne les divulguons que conformément au consentement donné ci-dessus.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 id=\"sensitive-data\">Traitement des données sensibles à caractère personnel<\/h3>\n<p>WES ne demande aucune donnée à caractère personnel définie dans l’une des catégories particulières du RGPD (« données sensibles à caractère personnel  »). Veuillez ne fournir aucun renseignement révélant votre origine raciale ou ethnique, vos opinions politiques, vos croyances religieuses ou philosophiques, votre appartenance à un syndicat ou de l’information sur des données génétiques ou des données relatives à votre état de santé, votre vie sexuelle ou votre orientation sexuelle ou tout autre renseignement non requis expressément dans le formulaire de demande en ligne de WES.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"automated-decisions\">Prise de décision automatisée<\/h3>\n<p>WES n’utilise pas de données à caractère personnel  dans un processus de prise de décision automatisée qui produirait des effets juridiques vous concernant. <\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"use-of-data\">Notre utilisation de vos données à caractère personnel<\/h3>\n<p>Nous utilisons les renseignements, dont vos données à caractère personnel, que nous collectons à votre sujet :<\/p>\n<ul>\n<li>pour vous présenter notre site Web ou notre application et leur contenu respectif;<\/li>\n<li>pour vous fournir l’information et les services que vous nous demandez;<\/li>\n<li>pour vérifier l’information et les diplômes présentés aux fins d’évaluation;<\/li>\n<li>pour vous permettre de mettre à jour ou de choisir une catégorie supérieure de services d’évaluation des diplômes ou pour vous fournir ultérieurement des copies supplémentaires de l’évaluation existante de vos diplômes;<\/li>\n<li>pour remplir tout autre but pour lequel vous les fournissez; <\/li>\n<li>pour vous informer sur votre compte;<\/li>\n<li>nous acquitter de nos obligations et faire valoir nos droits découlant des contrats conclus entre vous et nous, y compris pour les besoins de la facturation et du recouvrement;<\/li>\n<li>pour compiler des données de recherche;<\/li>\n<li>pour vous informer des changements apportés à notre site Web, à notre application ou aux produits ou aux services que nous offrons par leur truchement; <\/li>\n<li>de toute autre façon que nous pourrions décrire quand vous fournissez ces renseignements; <\/li>\n<li>à toute autre fin avec votre consentement.<\/li>\n<\/ul>\n<p>Avec votre consentement, nous pourrons également utiliser vos coordonnées pour vous présenter nos produits et services ou ceux de tiers pouvant présenter un intérêt pour vous. Si vous consentez à cette utilisation, veuillez cocher la case correspondante du formulaire avec lequel nous recueillons vos données. Si vous ne souhaitez plus recevoir cette information, veuillez nous en informer en utilisant notre page <a href=\"https:\/\/www.wes.org\/ca\/contact-us\/\">Contactez-nous<\/a>. Pour obtenir de plus amples renseignements, lisez <a href=\"#DisclosingPersonalData\">Choix concernant notre utilisation et notre divulgation de vos données à caractère personnel<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"disclosure-of-data\">Divulgation de vos données à caractère personnel<\/h3>\n<p>Nous ne communiquons, ne vendons ni ne divulguons autrement vos données à caractère personnel à d’autres fins que celles décrites dans la présente Politique de confidentialité. Nous pouvons, en revanche, divulguer une information synthétique au sujet de nos utilisateurs et des renseignements qui ne permettent pas d’identifier qui que ce soit, et ce, sans exception. <\/p>\n<p>Nous pouvons divulguer les données à caractère personnel que nous recueillons ou que vous fournissez selon les modalités décrites dans la présente Politique de confidentialité : <\/p>\n<ul>\n<li>aux entrepreneurs, fournisseurs de services et autres tiers auxquels nous faisons appel pour appuyer nos activités et qui sont liés par des obligations contractuelles qui leur imposent de maintenir la confidentialité des données à caractère personnel et de ne les utiliser qu’aux fins pour lesquelles nous les leur divulguons. Plus précisément, ces entités fournissent des services de TI et de soutien de l’infrastructure, des services de messagerie et des services postaux;<\/li>\n<li>aux établissements d’enseignement que vous avez indiqués dans votre demande d’évaluation de vos diplômes et aux autorités éducatives qui vous ont délivré votre documentation éducative ou qui peuvent détenir des renseignements vous concernant et à leurs fournisseurs de services tiers;<\/li>\n<li>aux organismes de réglementation professionnelle et aux autorités compétentes qui vous ont délivré un permis d’exercice ou qui peuvent détenir des renseignements vous concernant et à leurs fournisseurs de services tiers;<\/li>\n<li>aux tiers auxquels vous nous avez demandé d’envoyer l’évaluation de vos diplômes et à leurs fournisseurs de services tiers; <\/li>\n<li>en cas de fusion, de restructuration, de réorganisation, de dissolution, ou d’une autre forme de vente ou de transfert d’une partie ou de la totalité des actifs de WES, dont les données à caractère personnel détenues par WES au sujet de ses clients font partie des actifs transférés; <\/li>\n<li>à des tiers afin qu’ils puissent commercialiser leurs produits ou services auprès de vous si vous avez consenti à ces divulgations. Nous imposons par contrat à ces tiers d’assurer la confidentialité des données à caractère personnel et de les utiliser exclusivement dans les buts pour lesquels nous les leur divulguons. Pour obtenir de plus amples renseignements, lisez <a href=\"#DisclosingPersonalData\">Choix concernant notre utilisation et notre divulgation de vos données à caractère personnel<\/a>;<\/li>\n<li>pour remplir le but que vous avez demandé;<\/li>\n<li>pour tout autre but divulgué par nos soins quand vous fournissez ces renseignements;<\/li>\n<li>avec votre consentement.<\/li>\n<\/ul>\n<p>Nous pouvons également divulguer vos données à caractère personnel :<\/p>\n<ul>\n<li>pour nous conformer à toute ordonnance d’un tribunal, toute loi ou à tout processus juridique, y compris en réponse à une demande présentée par un gouvernement ou de nature réglementaire;<\/li>\n<li>pour appliquer nos conditions et d’autres ententes, notamment à des fins de facturation et de recouvrement; <\/li>\n<li>si nous croyons que la divulgation est nécessaire ou appropriée pour protéger les droits, la propriété, la sécurité ou la réputation de WES, de nos clients ou d’autres. Cela comprend l’échange d’information avec d’autres entreprises et organisations pour les besoins de la protection contre la fraude et de la réduction du risque de crédit.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 id=\"disclosure-choices\">Choix concernant notre utilisation et notre divulgation de vos données à caractère personnel<\/h3>\n<p>Nous ne contrôlons pas la collecte ni l’utilisation de vos données à caractère personnel par les destinataires que vous avez désignés ou par les tiers mentionnés ci-dessus à la section 7. Ces tiers peuvent vous proposer des solutions pour que vous puissiez choisir d’empêcher la collecte de vos renseignements personnels ou leur utilisation en utilisant les liens indiqués à la section 2. Dans la mesure du possible, ces organisations sont soumises à des obligations contractuelles qui leur imposent de n’utiliser les données à caractère personnel que pour nous fournir les services nécessaires et d’assurer la stricte confidentialité de ces renseignements. Ces tiers peuvent, en revanche, effectuer la synthèse des renseignements qu’ils recueillent et ceux de leurs autres clients et utiliser celle-ci à leurs propres fins.<\/p>\n<p>Vous pouvez vous renseigner sur les publicités fondées sur les intérêts et sur vos droits et options pour refuser celles des membres de la Network Advertising Initiative (« NAI ») en consultant son site Web (<a href=\"https:\/\/www.networkadvertising.org\">www.networkadvertising.org<\/a>) et celles des membres de la Digital Advertising Alliance en consultant son site Web (<a href=\"https:\/\/www.aboutads.info\">www.aboutads.info<\/a>). Vous pouvez également refuser de recevoir les publicités ciblées des membres de la NAI sur son site Web.<\/p>\n<p>De plus, nous nous efforçons de vous offrir des options concernant les données à caractère personnel que vous nous fournissez. Nous vous proposons les mécanismes ci-dessous pour vous donner le contrôle de vos données à caractère personnel.<\/p>\n<ul>\n<li><strong>Technologies de suivi.<\/strong> Vous pouvez régler votre navigateur pour refuser tous les témoins de connexion ou certains d’entre eux ou pour vous alerter quand des témoins sont envoyés. Si vous désactivez ou refusez les témoins, veuillez noter que certaines parties du site Web de WES ou de son application (plus précisément votre ouverture de sessions dans le compte que vous créez) risquent d’être inaccessibles ou de ne pas fonctionner correctement.<\/li>\n<li><strong>Publicité ciblée et offres promotionnelles de WES.<\/strong> Nous n’utiliserons vos données à caractère personnel que pour promouvoir nos propres produits et services et avec votre consentement. Si vous souhaitez consentir à cette utilisation de vos données, vous pouvez cocher la case pertinente sur le formulaire avec lequel nous recueillons vos données à caractère personnel ou quand nous sollicitons ce consentement par d’autres moyens. Si vous souhaitez modifier votre choix, vous pouvez modifier vos préférences d’utilisateur sur n’importe lequel des courriels promotionnels que nous vous adressons ou nous adresser, en réponse, un courriel pour nous informer de vos préférences. Vous pouvez également communiquer avec nous en utilisant notre page <a href=\"https:\/\/www.wes.org\/ca\/contact-us\/\">Contactez-nous<\/a>. Cette option de refus ne s’applique pas aux renseignements fournis à l’entreprise à la suite de l’exécution des services que vous demandez, de l’enregistrement de la garantie, de l’expérience de la gestion des produits ou d’autres transactions.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 id=\"your-rights\">Vos droits d’accès à vos données à caractère personnel et de rectification<\/h3>\n<p>Les lois de protection des données applicables peuvent vous conférer certains droits concernant notre traitement de vos données à caractère personnel.<\/p>\n<ul>\n<li><strong>Accès et mise à jour.<\/strong> Vous pouvez examiner et modifier certaines de vos données à caractère personnel en ouvrant une session dans le site Web ou l’application et en allant à votre page ou à l’écran « Mon compte ». Vous pouvez également nous signaler, en utilisant la page <a href=\"#ContactInformation\">Coordonnées<\/a> ci-dessous, tous les changements ou toutes les erreurs dans vos données à caractère personnel en notre possession pour vous assurer qu’elles sont complètes, exactes et le plus à jour possible. Veuillez noter que si vous demandez à accéder à vos données à caractère personnel autrement qu’en utilisant notre site Web ou notre application, des frais pourront vous être facturés, jusqu’à concurrence d’un plafond fixé par la loi applicable. Nous risquons également de ne pas pouvoir donner suite à votre demande si nous croyons qu’elle constituerait une infraction à une loi ou à une exigence légale ou que la modification de ces renseignements les rendrait incorrects.<\/li>\n<li><strong>Limitations.<\/strong>. Vous avez le droit de limiter notre traitement de vos données à caractère personnel dans certaines circonstances. Vous pouvez notamment nous demander de limiter notre utilisation de ces données si vous contestez leur exactitude, si le traitement de vos données à caractère personnel s’avère illégal ou si nous n’avons plus besoin de traiter vos données à caractère personnel, mais si nous les avons conservées comme la loi nous le permet.<\/li>\n<li><strong>Portabilité. <\/strong>Dans la mesure où le traitement des données à caractère personnel que vous fournissez à WES repose sur votre consentement, vous avez le droit de nous demander une copie de, ou l’accès à, tout ou partie de ces données à caractère personnel sous une forme structurée, couramment utilisée et lisible par machine. Vous avez également le droit de nous demander de transmettre ces données à caractère personnel à un autre responsable du traitement des données, à condition que cela soit techniquement réalisable. Veuillez noter que nous ne sommes pas en mesure de vous retourner la documentation que vous nous fournissez sur support physique.<\/li>\n<li><strong>Retrait du consentement.<\/strong> Pour les utilisateurs de notre site Web, de notre application et de nos outils de marketing, comme notre traitement de vos données à caractère personnel repose exclusivement sur votre consentement, vous pouvez annuler votre consentement à tout moment. En revanche, le retrait de votre consentement sera sans effet sur la légalité du traitement qui reposait sur votre consentement avant son retrait et il sera sans effet sur la légalité de notre poursuite du traitement du traitement de vos données à caractère personnel reposant sur tout autre fondement juridique.<\/li>\n<\/ul>\n<p>Si vous êtes sous contrat avec WES pour recevoir des services d’évaluation, vous avez le droit d’annuler votre demande (des frais d’annulation s’appliquent). WES ne communiquera plus avec vous au sujet de votre évaluation, sauf si nous recevons l’attestation d’une fraude, auquel cas nous vous en informerons, ainsi que les autorités compétentes.<\/p>\n<ul>\n<li><strong>Droit à l’oubli.<\/strong> Pour les utilisateurs de notre site Web, de notre application et de nos outils de marketing, vous avez le droit de nous demander de supprimer toutes vos données à caractère personnel. Si vous avez ouvert un compte et sollicité nos services d’évaluation et de vérification de vos études, vous avez le droit d’annuler votre dossier (des frais d’annulation s’appliquent).<\/li>\n<\/ul>\n<p>Vous avez le droit à l’oubli si notre refus d’une telle demande ne repose sur aucun fondement juridique. Vos données à caractère personnel que vous avez fournies à WES seront conservées conformément à notre <a href=\"#DataRetentionPolicy\">Politique de conservation des données<\/a> ci-dessous. ci-dessous. Nous risquons de ne pas donner suite à votre demande de modification de vos renseignements personnels si nous croyons qu’elle constituerait une infraction à une loi ou à une exigence légale ou que la modification de ces renseignements les rendrait incorrects. De plus, nous ne pouvons pas supprimer complètement vos données à caractère personnel, puisque certaines données peuvent rester dans des sauvegardes antérieures. Celles-ci seront conservées pendant les périodes fixées par nos politiques de récupération d’urgence.<\/p>\n<ul>\n<li><strong>Plaintes.<\/strong> Vous avez le droit de porter plainte auprès de l’autorité de contrôle compétente dans le pays où vous résidez, dans le pays où vous travaillez ou dans le pays où vous croyez qu’une violation de vos droits a été commise, en infraction avec les lois applicables en matière de protection des données. Avant de le faire, nous vous demandons de communiquer directement avec nous afin de nous permettre de collaborer avec vous à la résolution de tout sujet de préoccupation en matière de protection de votre vie privée.<\/li>\n<li><strong>Modalités d’exercice de vos droits.<\/strong> Vous pouvez exercer tous les droits ci-dessus en communiquant avec nous aux <a href=\"#ContactInformation\">coordonnées<\/a> ci-dessous. Si vous communiquez avec nous pour exercer n’importe lequel des droits précités, nous pourrons vous demander des renseignements supplémentaires pour vérifier votre identité. Nous nous réservons le droit de limiter ou de refuser de donner suite à votre demande si vous ne fournissez pas une information suffisante pour apporter la preuve de votre identité ou pour satisfaire à nos exigences légales et opérationnelles.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 id=\"california-privacy\">Vos droits à la protection de la vie privée en Californie<\/h3>\n<p>L’article 1798.83 du Code civil de la Californie (loi « Faire la lumière » de la Californie) permet aux utilisateurs de notre site Web ou de notre application qui résident en Californie et qui fournissent des données à caractère personnel pour obtenir des produits et des services à usage personnel, familial ou domestique de demander certains renseignements au sujet de notre divulgation des données à caractère personnel à des tiers pour les besoins de leur propre marketing direct. S’il y a lieu, ces renseignements comprendraient les catégories de données à caractère personnel et les noms et adresses des entreprises auxquelles nous avons communiqué vos données à caractère personnel pendant l’année civile immédiatement antérieure (p. ex. pour les demandes adressées en 2018, ce sera l’information sur les activités de ce type en 2017 qui sera fournie). Vous pouvez demander cette information une fois par année civile. Pour présenter une telle demande, veuillez communiquer avec nous aux <a href=\"#ContactInformation\">coordonnées<\/a> ci-dessous. Si vous nous adressez cette demande par courriel, veuillez utiliser l’objet « Demande au titre de la loi californienne Faire la lumière ».<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"data-security\">Sécurité des données<\/h3>\n<p>Nous avons mis en œuvre des mesures conçues pour protéger vos données à caractère personnel contre la perte accidentelle et l’accès, l’utilisation, la modification ou la divulgation non autorisés. Toutes les connexions au site Web et à nos serveurs par le truchement de notre application par via un navigateur et d’autres réseaux sont chiffrées en utilisant la technologie SSL. Le traitement des paiements par carte de crédit est entièrement assuré par une passerelle de paiement tierce, conforme aux normes de sécurité des données de l’industrie des cartes de paiement (PCI DSS). Tous les renseignements envoyés à WES sur support matériel, par exemple sur papier, sont numérisés sous forme électronique et les copies papier sont détruites en toute sécurité. Toute l’information électronique est stockée en sécurité en utilisant les mécanismes types de l’industrie pour contrôler l’accès et protéger les données. WES emploie diverses mesures de sécurité pour protéger l’intégrité de ses systèmes, y compris des systèmes de prévention et de détection des intrusions.<\/p>\n<p>La sécurité de vos renseignements dépend également de vous. Quand nous vous donnons (ou quand vous choisissez) un mot de passe pour accéder à certaines parties de notre site Web ou de l’application, la responsabilité d’assurer sa confidentialité vous incombe. Nous vous demandons d’utiliser un mot de passe unique pour notre site et de ne le communiquer à personne. Pour protéger votre sécurité, le changement de votre mot de passe pourra vous être demandé de temps en temps. Conformément à ses pratiques exemplaires en matière de sécurité, WES stocke le hachis cryptographique de votre mot de passe au lieu du mot de passe lui-même. Si vous oubliez votre mot de passe, nous pourrons vous aider à réinitialiser votre compte et à choisir un nouveau mot de passe, mais vous ne pourrez pas récupérer votre ancien mot de passe.<\/p>\n<p>La transmission d’informations dans Internet n’est malheureusement pas complètement sécurisée. Bien que nous fassions tout notre possible pour protéger vos données à caractère personnel, nous ne pouvons pas garantir la sécurité de la transmission de vos données à caractère personnel à notre site Web ou par le truchement de notre application. Toute transmission de vos données à caractère personnel s’effectue à votre propre risque. Nous ne sommes pas responsables du contournement des paramètres de sécurité ou des mesures de sécurité en vigueur dans notre application ou dans le site Web ou dans les serveurs auxquels notre application donne l’accès.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"eea-consent\">Consentement au traitement des données à caractère personnel aux États-Unis et dans d’autres pays en dehors de l’Espace économique européen<\/h3>\n<p>Si vous résidez dans l’Espace économique européen (« l’<strong>EÉE »<\/strong>), afin de pouvoir offrir nos services, nous pourrons envoyer vos données à caractère personnel, pour les stocker, en dehors de l’EÉE, y compris aux États-Unis et au Canada. Par conséquent, vos données à caractère personnel pourront être transférées à l’extérieur du pays où vous résidez ou séjournez, y compris à des pays où le niveau de protection de vos données à caractère personnel peut être adéquat ou non. Vos renseignements personnels pourront être traités et stockés aux États-Unis et les gouvernements, tribunaux, organismes d’application de la loi ou de réglementation fédéraux, des divers États ou locaux pourront obtenir la divulgation de vos renseignements personnels selon les lois applicables aux États-Unis. En utilisant nos services, vous déclarez avoir lu et compris ce qui précède et consentir au stockage et au traitement des données à caractère personnel que vous communiquez à nos services situés en dehors de l’EÉE et du Canada, y compris aux États-Unis.<\/p>\n<p>WES ne transfère, au besoin, vos données à caractère personnel à un autre pays qu’à condition que les lois applicables en matière de protection des données l’exigent ou le permettent et que des mesures adéquates soient en place pour protéger vos données à caractère personnel.. Pour assurer la conformité du traitement de vos données à caractère personnel (autres que les données à caractère personnel que vous avez fournies directement à nos services situés en dehors de l’EÉE) à la présente Politique de confidentialité, WES utilise, avec tous les autres destinataires de vos données, des ententes de protection des données qui comprennent, lorsqu’il y a lieu, les clauses contractuelles types adoptées par la Commission européenne (les « <strong>clauses contractuelles types<\/strong> »). La Commission européenne a décidé que le transfert des données à caractère personnel conformément aux clauses contractuelles types offre un niveau de protection adéquat pour vos données à caractère personnel. En vertu de ces clauses contractuelles types, vos droits sont les mêmes que si vos données ne sont pas transférées à de tels tiers. Vous pouvez demander une copie de l’entente de protection des données en communiquant avec nous aux <a href=\"#ContactInformation\">coordonnées<\/a> ci-dessous.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"data-retention\">Politique de conservation des données<\/h3>\n<p>Les données recueillies sur les utilisateurs de notre site Web, de notre application et de nos outils de marketing sont conservées : <\/p>\n<ul>\n<li>aussi longtemps que le respect d’une obligation légale l’exige;<\/li>\n<li>aussi longtemps que la vérification de vos diplômes et la prévention des fraudes l’exigent;<\/li>\n<li>dans nos systèmes de sauvegarde et de récupération d’urgence, conformément à nos politiques de sauvegarde et de récupération d’urgence; <\/li>\n<li>aussi longtemps que la protection de nos intérêts juridiques l’exige ou que nous exerçons autrement nos droits et recours juridiques; <\/li>\n<li>pour les données qui ont été agrégées ou rendues anonymes autrement d’une manière telle que vous n’êtes plus identifiable, indéfiniment.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3 id=\"children\">Enfants de moins de 16 ans<\/h3>\n<p>WES n’offre des services aux enfants de moins de 16 ans que si leur parent ou leur tuteur légal nous communique leurs renseignements personnels. Si vous avez moins de 16 ans, ne vous inscrivez pas au site Web ou dans l’application ni ne nous fournissez aucun renseignement à votre sujet, y compris votre nom, adresse, numéro de téléphone, adresse de courriel ou votre pseudonyme ou nom d’utilisateur. Si nous apprenons que nous avons collecté ou reçu des renseignements d’un enfant de moins de 16 ans sans l’attestation du consentement d’un parent ou d’un tuteur, nous supprimons ces renseignements. Si vous croyez que nous pouvons avoir en notre possession des renseignements émanant ou au sujet d’un enfant de moins de 16 ans, veuillez communiquer avec nous aux <a href=\"#ContactInformation\">coordonnées<\/a> ci-dessous.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"policy-changes\">Modifications de notre Politique de confidentialité<\/h3>\n<p>Nous pouvons modifier la présente Politique de confidentialité à tout moment. Conformément à notre politique, nous affichons toutes les modifications de notre Politique de confidentialité sur cette page, ainsi qu’un avis de mise à jour de la Politique de confidentialité sur la page d’accueil du site Web et sur l’écran principal de notre application. Si nous apportons des modifications importantes à notre traitement des données à caractère personnel de nos utilisateurs, nous vous en informerons par courriel à l’adresse de courriel indiquée dans votre compte et en affichant un avis sur la page d’accueil du site Web et sur l’écran principal de l’application. La date de la dernière modification de la présente Politique de confidentialité figure en haut de sa première page. Il vous incombe de vous assurer que l’adresse de courriel en notre possession est en service pour que nous puissions vous joindre et de d’accéder à notre site Web ou à l’application et de consulter la présente Politique de confidentialité régulièrement pour connaître ses modifications.<\/p>\n<p>&nbsp;<\/p>\n<h3 id=\"contact\">Coordonnées<\/h3>\n<p>WES a nommé un responsable de la protection des données et un représentant dans l’Union européenne conformément au RGPD. Si vous avez des questions, des sujets de préoccupation, des plaintes ou des suggestions à l’égard de notre Politique de confidentialité ou des demandes liées à vos données à caractère personnel en vertu des lois applicables, ou si vous avez besoin de communiquer avec nous pour une autre raison, veuillez communiquer avec nous aux coordonnées ci-dessous ou en utilisant la page <a href=\"https:\/\/www.wes.org\/ca\/contact-us\/\">Communiquez avec nous<\/a> de notre site Web ou dans l’application. <\/p>\n<p style=\"text-align: center;\"><strong>WES (Responsable du traitement)<\/strong><br \/>\nWorld Education Services<br \/>\nBowling Green Station<br \/>\nP.O. Box 5087<br \/>\nNew York, NY 10274-5087<br \/>\nÉTATS-UNIS<\/p>\n<p style=\"text-align: center;\"><strong>Responsable de la protection des données de WES<\/strong><br \/>\n<a href=\"mailto:privacy@wes.org\">privacy@wes.org<\/a><br \/>\nWorld Education Services<br \/>\nBowling Green Station<br \/>\nP.O. Box 5087<br \/>\nNew York, NY 10274-5087<br \/>\nÉTATS-UNIS<\/p>\n<p>Si vous résidez dans l’UE ou si vous avez une question ou un sujet de préoccupation au sujet de notre conformité au RGPD, vous devez également communiquer avec notre représentant de la protection des données à l’UE en utilisant les coordonnées ci-dessous. Notre représentant à l’UE ne transmettra pas des dossiers scolaires et universitaires à WES et ceux-ci seront détruits conformément au RGPD.<\/p>\n<p>Pour connaître les instructions sur l’envoi des dossiers scolaires et universitaires à WES, veuillez consulter notre page Documents requis ou Communiquez avec nous pour obtenir de plus amples renseignements.<\/p>\n<p style=\"text-align: center;\"><strong>Représentant de la protection des données à l’UE<\/strong><br \/>\n<a style=\"text-align: center;\" href=\"mailto:wes@dpr.eu.com\">wes@dpr.eu.com<\/a><br style=\"text-align: center;\" \/><span style=\"text-align: center;\">DPR Group<\/span><br style=\"text-align: center;\" \/><span style=\"text-align: center;\">Office 29, Clifton House<\/span><br style=\"text-align: center;\" \/><span style=\"text-align: center;\">Fitzwilliam Street Lower<\/span><br style=\"text-align: center;\" \/><span style=\"text-align: center;\">Dublin<br \/>\nIRLANDE<\/span><br style=\"text-align: center;\" \/><a style=\"text-align: center;\" href=\"https:\/\/www.dpr.eu.com\/wes\">www.dpr.eu.com\/wes<\/a><\/p>\n","intro_item_headline":"","intro_item_text":"","intro_item_image":false,"intro_more_button":"","intro_more_button_cta_link":"","intro_more_button_new_window":[],"intro_more_button_content":"","main_content_title":"","main_content_item_1_headline":"","main_content_item_1_text":"","main_content_item_1_image":false,"main_content_item_1_cta_text":"","main_content_item_1_cta_link":"","item_1_cta_link_new_window":[],"main_content_item_2_headline":"","main_content_item_2_text":"","main_content_item_2_image":false,"main_content_item_2_cta_text":"","main_content_item_2_cta_link":"","item_2_cta_link_new_window":[],"main_content_item_3_headline":"","main_content_item_3_text":"","main_content_item_3_image":false,"main_content_item_3_cta_text":"","main_content_item_3_cta_link":"","item_3_cta_link_new_window":[],"main_content_item_4_headline":"","main_content_item_4_text":"","main_content_item_4_image":false,"main_content_item_4_cta_text":"","main_content_item_4_cta_link":"","item_4_cta_link_new_window":[],"main_content_item_5_headline":"","main_content_item_5_text":"","main_content_item_5_image":false,"main_content_item_5_cta_text":"","main_content_item_5_cta_link":"","item_5_cta_link_new_window":[],"main_content_item_6_headline":"","main_content_item_6_text":"","main_content_item_6_image":false,"main_content_item_6_cta_text":"","main_content_item_6_cta_link":"","item_6_cta_link_new_window":[],"main_content_item_7_headline":"","main_content_item_7_text":"","main_content_item_7_image":false,"main_content_item_7_cta_text":"","main_content_item_7_cta_link":"","item_7_cta_link_new_window":[],"evaluation_reports":false,"page_maf":false,"custom_body_class":"","hide_language_switcher":false,"custom_menu":"","alert_msg":"default"},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Politique de confidentialité \\ - World Education Services<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/\" \/>\n<meta property=\"og:locale\" content=\"fr_FR\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Politique de confidentialité \\\" \/>\n<meta property=\"og:description\" content=\"World Education Services, Inc. (“WES”, “us” or “we”) is committed to protecting your Personal Information (as defined below) through ensuring that all Personal Information provided to us is treated with care and, subject to this Privacy Policy (“Policy”), is not used or disclosed in ways to which you have not consented. This Policy governs the collection, use and disclosure of your Personal Information in any communication or interaction you may have with us, whether it be in person, through an authorized agent, over the telephone, in writing, or electronically.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-23T08:54:15+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/\",\"url\":\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/\",\"name\":\"Politique de confidentialité \\\\ - World Education Services\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/fr\/#website\"},\"datePublished\":\"2017-02-23T17:34:39+00:00\",\"dateModified\":\"2023-09-23T08:54:15+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/#breadcrumb\"},\"inLanguage\":\"fr-FR\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/fr\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Home Page CA\",\"item\":\"https:\/\/www.wes.org\/fr\/ca\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Politique de confidentialité \\\\\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/fr\/#website\",\"url\":\"https:\/\/www.wes.org\/fr\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/fr\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"fr-FR\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Politique de confidentialité \\ - World Education Services","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/","og_locale":"fr_FR","og_type":"article","og_title":"Politique de confidentialité \\","og_description":"World Education Services, Inc. (“WES”, “us” or “we”) is committed to protecting your Personal Information (as defined below) through ensuring that all Personal Information provided to us is treated with care and, subject to this Privacy Policy (“Policy”), is not used or disclosed in ways to which you have not consented. This Policy governs the collection, use and disclosure of your Personal Information in any communication or interaction you may have with us, whether it be in person, through an authorized agent, over the telephone, in writing, or electronically.","og_url":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/","og_site_name":"World Education Services","article_modified_time":"2023-09-23T08:54:15+00:00","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/","url":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/","name":"Politique de confidentialité \\ - World Education Services","isPartOf":{"@id":"https:\/\/www.wes.org\/fr\/#website"},"datePublished":"2017-02-23T17:34:39+00:00","dateModified":"2023-09-23T08:54:15+00:00","breadcrumb":{"@id":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/#breadcrumb"},"inLanguage":"fr-FR","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/fr\/ca\/politique-de-confidentialite\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/fr\/"},{"@type":"ListItem","position":2,"name":"Home Page CA","item":"https:\/\/www.wes.org\/fr\/ca\/"},{"@type":"ListItem","position":3,"name":"Politique de confidentialité \\"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/fr\/#website","url":"https:\/\/www.wes.org\/fr\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/fr\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"fr-FR"}]}},"wpml_current_locale":"fr_FR","wpml_translations":[{"locale":"en_US","id":1218,"post_title":"Privacy Policy","href":"https:\/\/www.wes.org\/privacy-policy\/"}],"_links":{"self":[{"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/pages\/11509"}],"collection":[{"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/comments?post=11509"}],"version-history":[{"count":0,"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/pages\/11509\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/pages\/4146"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/media?parent=11509"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/categories?post=11509"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wes.org\/fr\/wp-json\/wp\/v2\/tags?post=11509"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}