{"id":37612,"date":"2023-01-03T12:36:25","date_gmt":"2023-01-03T17:36:25","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=gtb_blog&#038;p=37612"},"modified":"2023-10-13T16:44:45","modified_gmt":"2023-10-13T20:44:45","slug":"will-just-in-time-immigration-policy-changes-meet-canadas-needs","status":"publish","type":"gtb_blog","link":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/","title":{"rendered":"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs?"},"content":{"rendered":"<p>In 2022, the job vacancy rate surged to a new record – one million jobs went unfilled. Meanwhile our population continues to age, and the workforce is shrinking. Labour and skills shortages are growing more acute in every sector. Policymakers are looking to increase immigration intake levels alongside streamlined measures to get more newcomers into the labour force as a fast-track solution to complex, long-standing problems.<\/p>\n<p>Historically, immigration has been the driver of population and labour growth in Canada. In the 2010s, immigrants accounted for <a href=\"https:\/\/www150.statcan.gc.ca\/n1\/daily-quotidien\/220622\/dq220622c-eng.htm\" target=\"_blank\" rel=\"noopener\">84 percent of growth<\/a> in the total labour force. Today, we are almost 100 percent dependent on immigration for net labour force growth and by the 2040s immigration will be the <a href=\"https:\/\/www150.statcan.gc.ca\/n1\/daily-quotidien\/220822\/dq220822b-eng.htm\" target=\"_blank\" rel=\"noopener\">sole driver of population growth<\/a>.<\/p>\n<p>In his newly released plan for immigration levels for the next three years, Immigration Minister Sean Fraser announced that Canada will admit close to <a href=\"https:\/\/www.canada.ca\/en\/immigration-refugees-citizenship\/news\/notices\/supplementary-immigration-levels-2023-2025.html\" target=\"_blank\" rel=\"noopener\">1.5 million permanent residents<\/a> by 2025 to address demographic, economic, and regional needs. This is an all-time record for immigration, setting immigration levels at a rate of almost 1.2 percent of the population. The planned targets had been less or around 1 percent for the past three decades.<\/p>\n<p>Changes to the selection of economic immigrants are underway to enable record levels of newcomers to swiftly meet the urgent needs of the economy. For the most part, however, Immigration, Refugees and Citizenship Canada (IRCC) has provided only the broad strokes of the changes, leaving many questions unanswered.<\/p>\n<p>This policy analysis provides an overview of the planned changes, raises questions for debate, and recommends strategies for devising an immigration system that is transparent and predictable while also promoting inclusive and commensurate labour market integration of immigrants.<\/p>\n<p>There are planned changes in two key areas: (1) the Express Entry system and (2) pathways for persons with temporary status to secure permanent residency.<\/p>\n<h3>Upcoming Changes to the Express Entry System<\/h3>\n<p>Under the current Express Entry system, immigration candidates are given points based on factors such as their language competency in the two official languages, educational credentials, and work experience. Candidates are then ranked under a Comprehensive Ranking System (CRS), and those who rank highest receive an invitation to apply for permanent residency. Draws are usually conducted on a regular basis (about every two weeks). Each cycle includes newcomers whose score was above the cutoff number for that cycle. This system does not always result in a match between a newcomer’s skills and abilities and the pressing needs of the economy.<\/p>\n<p>To respond to economic, demographic, and regional needs more effectively, Bill C-19 was drafted to amend the Immigration Refugee Protection Act (IRPA). The bill introduces major changes to the current Express Entry system. It became law on June 23, 2022.<\/p>\n<p>As a result, the immigration minister now has greater authority to use a vehicle that operates outside of parliament. The minister can issue Ministerial Instructions to select candidates from the Express Entry pool who meet specific economic needs. A higher CRS score would not necessarily increase the likelihood of a candidate’s being invited to immigrate to Canada. Starting next spring, candidates who have specific skills or work experience will be prioritized.<\/p>\n<p>The bill does not define which occupational categories will be featured. Minister Fraser will identify which occupational groups will be prioritized based on economic needs for each round of invitations. In one of his recent press conferences, Minister Fraser has <a href=\"https:\/\/www.youtube.com\/watch?v=AxrVddVes7o\" target=\"_blank\" rel=\"noopener\">signaled<\/a> that building trades, health care, and the services sector will be targeted. These are also the <a href=\"https:\/\/www150.statcan.gc.ca\/t1\/tbl1\/en\/tv.action?pid=1410032601\" target=\"_blank\" rel=\"noopener\">sectors with the highest job vacancies<\/a>.<\/p>\n<p>The economic goal of each invitation round and the eligibility criteria will be published on the IRCC website. The minister will report to parliament annually on the outcomes of these targeted draws.<\/p>\n<p>The targeted Express Entry draws are expected to begin by spring 2023.<\/p>\n<p>Bill C-19 requires Minister Fraser to engage in public consultations with stakeholders to determine which occupations are most critical Canada’s economic goals. Stakeholders include provinces and territories, industries, unions, employers, workers, worker advocacy groups, settlement provider organizations, and immigration researchers and practitioners.<\/p>\n<p><a href=\"https:\/\/www.canada.ca\/en\/immigration-refugees-citizenship\/corporate\/transparency\/consultations\/2022-consultations-express-entry-selection.html?utm_campaign=not-applicable&amp;utm_medium=vanity-url&amp;utm_source=canada-ca_express-entry-selection-consultations\" target=\"_blank\" rel=\"noopener\">Public consultations<\/a> started on November 28 and stakeholders can provide their comments by January 8, 2023. IRCC is seeking feedback and suggestions in four major areas: selecting candidates based on work experience in a particular occupation or sector, transitioning international student graduates to permanent residence, transitioning work permit holders to permanent residence, and selecting Francophone and bilingual candidates.<\/p>\n<p>However, there is still scant information about how the economic goals will be formulated and whose interests will be prioritized. As seen in the past, consultations generally mobilize specific business interests. The goal of immigration policy has long shifted from nation-building to short-term economic needs. But apart from economic calculations, immigration goals should consider how commensurate employment would be achieved. Underutilization of immigrant talent has been a serious and long-standing problem. Many immigrants are not able to find work in the same sector and at the same level as that of their previous work experience. Without a concrete plan to address this problem, upcoming changes to the Express Entry draws and immigration levels may add more immigrants to a precarious labour market supply.<\/p>\n<h3>Upcoming Changes to Pathways to Permanent Residency for Those with Temporary Status<\/h3>\n<p>There are also plans to utilize the revamped Express Entry system to make the path from temporary to permanent residency easier.<\/p>\n<p>The one-time <a href=\"https:\/\/www.canada.ca\/en\/immigration-refugees-citizenship\/services\/immigrate-canada\/tr-pr-pathway.html\" target=\"_blank\" rel=\"noopener\">Temporary Residence to Permanent Residence (TR to PR) Pathway<\/a> offered in 2021 during the height of the pandemic will not be reinstated. This special program was developed so that different categories of migrant workers, frontline workers, and international graduates could transition to permanent resident status. Like other immigration pathways, TR to PR Pathway had a <a href=\"https:\/\/www.torontomu.ca\/cerc-migration\/Policy\/CERCMigration_PolicyPaper03_June2021.pdf\" target=\"_blank\" rel=\"noopener\">complex, time-consuming<\/a> application process. Those without the technical skills, education, and competence to navigate the application portal were left with few options. Settlement organizations could not help them, because temporary status makes these individuals ineligible for such assistance.<\/p>\n<p>Minister Fraser has indicated that a new approach to work permit holders will review the points awarded for Canadian work experience and education, and the government will consider holding draws targeting international graduates and work permit holders.<\/p>\n<p>There are <a href=\"https:\/\/www.canada.ca\/en\/immigration-refugees-citizenship\/corporate\/publications-manuals\/annual-report-parliament-immigration-2022.html#tr\" target=\"_blank\" rel=\"noopener\">approximately 1 million<\/a> international students and temporary work permit holders, a portion of whom could be eligible for permanent residence under the targeted draws.<\/p>\n<p>Holding draws focused on individuals with temporary status could help to shift the language from “high skills” and “low skills” and to focus on “essential skills.” In the current system, workers in so-called “low-skilled” jobs are <a href=\"https:\/\/colourofpoverty.ca\/wp-content\/uploads\/2019\/03\/cop-coc-fact-sheet-5-racialized-poverty-in-employment-2.pdf\" target=\"_blank\" rel=\"noopener\">disproportionately racialized<\/a>. These workers have a <a href=\"https:\/\/www.torontomu.ca\/content\/dam\/cerc-migration\/Policy\/CERCMigration_PolicyPaper03_June2021.pdf\" target=\"_blank\" rel=\"noopener\">slim chance of receiving an invitation to permanent residency<\/a> mainly because their education levels and language skills are not high enough to obtain competitive CRS scores. But as the pandemic has shown, these workers are <a href=\"https:\/\/www.torontomu.ca\/content\/dam\/cerc-migration\/Policy\/CERC_02_PolicyPaper_May2021.pdf\" target=\"_blank\" rel=\"noopener\">essential to the economy and fulfill long-term needs in sectors with ongoing demand<\/a>.<\/p>\n<h3>What Do These Changes Mean?<\/h3>\n<p>While the changes to the Express Entry system are both welcome and necessary, there are reasons to be concerned.<\/p>\n<h4>Transparency<\/h4>\n<p>Targeted draws can come at the cost of transparency. For example, what will be the frequency of the consultations? Who or what would determine the major labour market and regional needs? Would there be a representative and balanced committee formed to provide recommendations?<\/p>\n<p>When the government make use of Ministerial Instructions the goal is to act swiftly, but the cost of swift action is little meaningful parliamentary or public oversight. The <a href=\"https:\/\/www.cba.org\/getattachment\/Our-Work\/Resolutions\/Resolutions\/2012\/Ministerial-Instructions\/12-06-A-ct.pdf\" target=\"_blank\" rel=\"noopener\">Council of the Canadian Bar Association<\/a> notes that while “Ministerial Instructions can increase the speed with which the Minister can implement changes to the Canadian immigration system, [they] also decrease the system’s predictability and transparency.” Reporting to parliament on an annual basis after the fact reduces accountability. Critics call for the creation of an <a href=\"https:\/\/biv.com\/article\/2022\/06\/canadas-immigration-processes-need-open-and-independent-oversight\" target=\"_blank\" rel=\"noopener\">arms-length oversight mechanism<\/a> that would scrutinize how IRCC is managing the Express Entry system and the immigration system generally.<\/p>\n<h4>Predictability<\/h4>\n<p>The existing Express Entry draws provide candidates with predictability regarding their likelihood of receiving an invitation to immigrate and how to increase their CSR points. This gives them the ability to plan for the long term. For example, a candidate may acquire additional educational credentials or may improve their language skills to increase their chances of being selected in one of the regular draws. The Ministerial Instructions changes reduce predictability and impact candidates’ ability to plan for the long term. Candidates are also unclear about whether details will be announced in advance, leaving them in the dark about possibly needing to adjust their migration plans.<\/p>\n<p>Candidates need greater transparency and predictability than the IRCC is currently offering.<\/p>\n<h4>Underutilization and Access to the Labour Market<\/h4>\n<p>We know from existing research that immigrants face significant barriers to employment in Canada, including the devaluation of their educational credentials and experience, bias in favor of Canadian work experience rather than assessment of competencies, limited social capital, and overt and covert xenophobia and racism. For example, despite the health care workforce crisis, <a href=\"https:\/\/knowledge.wes.org\/canada-report-addressing-the-underutilization-of-iehps-in-canada.html\" target=\"_blank\" rel=\"noopener\">nearly half of internationally educated health care workers<\/a> are either unemployed or employed in positions that do not make full use of their skills, education, and experience. Only <a href=\"https:\/\/www.ospe.on.ca\/public\/documents\/advocacy\/2015-crisis-in-engineering-labour-market.pdf\" target=\"_blank\" rel=\"noopener\">one in five internationally trained engineers<\/a> in Canada works in their field of training.<\/p>\n<p>Immigrants, especially those who are racialized, are overrepresented in jobs with low educational requirements and pay despite possessing university credentials. The number of university-educated immigrants working in jobs requiring a university degree fell to 38 percent in 2016 from 46 percent in 2001, compared with 60 percent for Canadian-born workers, according to <a href=\"https:\/\/www150.statcan.gc.ca\/n1\/daily-quotidien\/220622\/dq220622c-eng.htm\" target=\"_blank\" rel=\"noopener\">Statistics Canada<\/a>.<\/p>\n<p>There is a <a href=\"https:\/\/files.eric.ed.gov\/fulltext\/ED602857.pdf\" target=\"_blank\" rel=\"noopener\">fundamental mismatch<\/a> between the immigration policy, which assesses the value of an immigrant’s skills and experience, and the value that employers place on those skills.<\/p>\n<p>Changes to the Express Entry system need to be coupled with concrete policies addressing the underutilization of immigrants’ skills and which strive for commensurate labour market integration. Without addressing the labour market integration needs of immigrants already here and planning for an additional 1.5 million to enter the labour market risks accelerating underutilization.<\/p>\n<p>Although the government plans to make the transition of international graduates and work permit holders into permanent residency through targeted draws, these individuals are <a href=\"https:\/\/www.canada.ca\/en\/immigration-refugees-citizenship\/corporate\/transparency\/program-terms-conditions\/settlement.html\" target=\"_blank\" rel=\"noopener\">not eligible for IRCC-funded settlement and employment services<\/a>. This ineligibility erects additional barriers to gaining valuable Canadian experience, which would enhance their chances of becoming a permanent resident and provide access to essential support for social integration. Also, the restricted eligibility criteria deprive this group of assistance to complete and submit their permanent residency application.<\/p>\n<h3>Recommendations<\/h3>\n<p>The recommendations below call on the government to develop an immigration system that is transparent, predictable, and responsive to the settlement needs of immigrants. Adapting an integrated approach that focuses not only on bringing immigrants to Canada but also on commensurate labour market integration can improve policy objectives and outcomes.<\/p>\n<p>Create an accessible, transparent, and ongoing consultation process, and make a concerted effort to consider the interests of stakeholders representing different groups in the development and implementation of the groupings. Ensure that targeted draws are not only responsive to the needs and demands of business; instead, they should be guided by the principle of nation-building which includes the development of a strong economy, a nurturing society, and resilient, welcoming communities.<\/p>\n<ul>\n<li>Create an independent oversight body to monitor targeted draws and report to parliament.<\/li>\n<li>To increase the predictability for all stakeholders, including the candidates, release the targeted draw plans for each quarter in advance, and report on the profile of candidates in the Express Entry pool after each round of invitations (for example, the number of candidates with a particular NOC code).<\/li>\n<li>Improve access to timely, disaggregated labour market information and tools so that immigrants and businesses are able to make informed decisions about training and employment options.<\/li>\n<li>Collaborate with provincial or territorial governments and regulatory bodies to create pathways to ensure that immigrants who have regulated occupational experience can be quickly and effectively assessed and integrated into the labour market.<\/li>\n<li>Increase investments in newcomer-centred employment programs and allocate adequate funding for settlement services. Further, extend the eligibility of IRCC-funded settlement and employment services to international students, international graduates, and work permit holders.<\/li>\n<li>Communicate employment opportunities to new immigrants through enhanced pre-arrival information.<\/li>\n<li>Promote competency-based assessment and hiring practices among employers as critical keys to recognizing needed and available talent.<\/li>\n<li>Take concrete measures to address persistent and rising xenophobia and racism. Also, develop accountability measures and provide funding to community-based anti-racism and anti-hate initiatives.<\/li>\n<li>Conduct evaluations of the Express Entry system on set intervals to assess the effectiveness of the system in terms of immigrants’ labour market integration and the country’s economic needs.<\/li>\n<\/ul>\n<h3>Conclusion<\/h3>\n<p>The objectives of the targeted Express Entry draws cannot be fully achieved without creating a transparent and predictable implementation system, and without addressing the issue of underutilization of immigrant talent. Coupling targeted draws with these two measures will help immigrants thrive in Canada and help the country to meet its economic needs more effectively.<\/p>\n","protected":false},"featured_media":37613,"comment_status":"closed","ping_status":"closed","template":"","gtb_blog_categories":[1198,1169],"gtb_tags":[781,1332],"better_featured_image":{"id":37613,"alt_text":"","caption":"Aerial view of the Ottawa, winter, snow","description":"","media_type":"image","media_details":{"width":2560,"height":1440,"file":"2023\/01\/iStock-1219382788-1-scaled.jpg","filesize":888978,"sizes":{"medium":{"file":"iStock-1219382788-1-300x169.jpg","width":300,"height":169,"mime-type":"image\/jpeg","filesize":35507,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-300x169.jpg"},"large":{"file":"iStock-1219382788-1-1024x576.jpg","width":1024,"height":576,"mime-type":"image\/jpeg","filesize":174975,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-1024x576.jpg"},"thumbnail":{"file":"iStock-1219382788-1-150x150.jpg","width":150,"height":150,"mime-type":"image\/jpeg","filesize":26576,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-150x150.jpg"},"medium_large":{"file":"iStock-1219382788-1-768x432.jpg","width":768,"height":432,"mime-type":"image\/jpeg","filesize":109430,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-768x432.jpg"},"1536x1536":{"file":"iStock-1219382788-1-1536x864.jpg","width":1536,"height":864,"mime-type":"image\/jpeg","filesize":354546,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-1536x864.jpg"},"2048x2048":{"file":"iStock-1219382788-1-2048x1152.jpg","width":2048,"height":1152,"mime-type":"image\/jpeg","filesize":595568,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-2048x1152.jpg"},"testimonial-thumb":{"file":"iStock-1219382788-1-165x190.jpg","width":165,"height":190,"mime-type":"image\/jpeg","filesize":28905,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-165x190.jpg"},"carousel-post-thumb":{"file":"iStock-1219382788-1-540x277.jpg","width":540,"height":277,"mime-type":"image\/jpeg","filesize":63856,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-540x277.jpg"},"col-profile-thumb":{"file":"iStock-1219382788-1-195x195.jpg","width":195,"height":195,"mime-type":"image\/jpeg","filesize":31063,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-195x195.jpg"},"builder-feed-lg":{"file":"iStock-1219382788-1-981x517.jpg","width":981,"height":517,"mime-type":"image\/jpeg","filesize":158135,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-981x517.jpg"},"team":{"file":"iStock-1219382788-1-185x185.jpg","width":185,"height":185,"mime-type":"image\/jpeg","filesize":30015,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-185x185.jpg"},"people":{"file":"iStock-1219382788-1-394x276.jpg","width":394,"height":276,"mime-type":"image\/jpeg","filesize":50902,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-394x276.jpg"},"insight":{"file":"iStock-1219382788-1-541x362.jpg","width":541,"height":362,"mime-type":"image\/jpeg","filesize":74514,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-541x362.jpg"}},"image_meta":{"aperture":"2.2","credit":"Getty Images\/iStockphoto","camera":"FC220","caption":"Aerial view of the Ottawa, winter, snow","created_timestamp":"1575990967","copyright":"","focal_length":"4.73","iso":"100","shutter_speed":"0.00133333333333","title":"Aerial view of the Ottawa, winter, snow","orientation":"1","keywords":["droneottawa"]},"original_image":"iStock-1219382788-1.jpg","ShortPixel":{"type":"lossy","exifKept":"0","date":"2023-01-03 17:39:15","thumbsOpt":14,"thumbsOptList":["iStock-1219382788-1.jpg","iStock-1219382788-1-300x169.jpg","iStock-1219382788-1-1024x576.jpg","iStock-1219382788-1-150x150.jpg","iStock-1219382788-1-768x432.jpg","iStock-1219382788-1-1536x864.jpg","iStock-1219382788-1-2048x1152.jpg","iStock-1219382788-1-165x190.jpg","iStock-1219382788-1-540x277.jpg","iStock-1219382788-1-195x195.jpg","iStock-1219382788-1-981x517.jpg","iStock-1219382788-1-185x185.jpg","iStock-1219382788-1-394x276.jpg","iStock-1219382788-1-541x362.jpg"],"excludeSizes":[],"retinasOpt":0},"ShortPixelImprovement":"78.78"},"post":37612,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg"},"acf":{"author_name":"Guliz Akkaymak","author":{"ID":37611,"post_author":"41","post_date":"2023-01-03 12:05:34","post_date_gmt":"2023-01-03 17:05:34","post_content":"Guliz Akkaymak is the Manager, Policy and Advocacy, with the Strategy, Policy, and Research team in Canada.","post_title":"Guliz Akkaymak","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"guliz-akkaymak","to_ping":"","pinged":"","post_modified":"2023-01-03 12:05:34","post_modified_gmt":"2023-01-03 17:05:34","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=37611","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"}},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs? - World Education Services<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs?\" \/>\n<meta property=\"og:description\" content=\"In 2022, the job vacancy rate surged to a new record – one million jobs went unfilled. Meanwhile our population continues to age, and the workforce is shrinking. Labour and skills shortages are growing more acute in every sector. Policymakers are looking to ...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2023-10-13T20:44:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1440\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/\",\"url\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/\",\"name\":\"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs? - World Education Services\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg\",\"datePublished\":\"2023-01-03T17:36:25+00:00\",\"dateModified\":\"2023-10-13T20:44:45+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg\",\"width\":2560,\"height\":1440,\"caption\":\"Aerial view of the Ottawa, winter, snow\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"GTB Blog\",\"item\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs? - World Education Services","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/","og_locale":"en_US","og_type":"article","og_title":"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs?","og_description":"In 2022, the job vacancy rate surged to a new record – one million jobs went unfilled. Meanwhile our population continues to age, and the workforce is shrinking. Labour and skills shortages are growing more acute in every sector. Policymakers are looking to ...","og_url":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/","og_site_name":"World Education Services","article_modified_time":"2023-10-13T20:44:45+00:00","og_image":[{"width":2560,"height":1440,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/","url":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/","name":"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs? - World Education Services","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg","datePublished":"2023-01-03T17:36:25+00:00","dateModified":"2023-10-13T20:44:45+00:00","breadcrumb":{"@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/01\/iStock-1219382788-1-scaled.jpg","width":2560,"height":1440,"caption":"Aerial view of the Ottawa, winter, snow"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/will-just-in-time-immigration-policy-changes-meet-canadas-needs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"GTB Blog","item":"https:\/\/www.wes.org\/partners\/gtb-blog\/"},{"@type":"ListItem","position":3,"name":"Will Just-in-Time Immigration Policy Changes Meet Canada’s Needs?"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":false,"wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb-blogs\/37612"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/gtb_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=37612"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/37613"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=37612"}],"wp:term":[{"taxonomy":"gtb_blog_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb_blog_categories?post=37612"},{"taxonomy":"gtb_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb_tags?post=37612"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}