{"id":38761,"date":"2023-05-02T12:44:11","date_gmt":"2023-05-02T16:44:11","guid":{"rendered":"https:\/\/www.wes.org\/?post_type=gtb_blog&#038;p=38761"},"modified":"2024-02-29T12:21:30","modified_gmt":"2024-02-29T17:21:30","slug":"celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day","status":"publish","type":"gtb_blog","link":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/","title":{"rendered":"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day"},"content":{"rendered":"<p>In 2015, Nabaa Alobaidi resettled in Portland, Maine, having fled her home in Iraq as a refugee. With a master’s degree and experience practicing interior design and teaching at the university level, she hoped to continue her craft and her love of teaching. At a time when schools across the country are facing chronic <a href=\"https:\/\/www.washingtonpost.com\/education\/2022\/09\/27\/school-teacher-staff-shortages\/\" target=\"_blank\" rel=\"noopener\">teacher shortages<\/a>—a deficit <a href=\"https:\/\/www.epi.org\/publication\/shortage-of-teachers\/\" target=\"_blank\" rel=\"noopener\">heightened in recent years by the COVID-19 pandemic<\/a>—internationally trained immigrants and refugees like Nabaa who are interested in teaching are a key <a href=\"https:\/\/www.migrationpolicy.org\/sites\/default\/files\/publications\/FactSheet_BrainWaste_US-FINAL.pdf\" target=\"_blank\" rel=\"noopener\">source of educational talent<\/a> that would ensure a more inclusive and robust teacher workforce.<\/p>\n<h3>Teacher Shortage and Impact<\/h3>\n<p>According to a 2022 study from the Annenberg Institute for School Reform at Brown University, school districts across the United States <a href=\"https:\/\/www.edworkingpapers.com\/ai22-631\" target=\"_blank\" rel=\"noopener\">had at least 36,000 vacant teaching positions<\/a>. As of the 2022\/23 academic year, Maine’s K-12 schools are experiencing <a href=\"https:\/\/www.maine.gov\/doe\/sites\/maine.gov.doe\/files\/inline-files\/shortage%20list%2022-23.pdf\" target=\"_blank\" rel=\"noopener\">teacher shortages in early childhood education<\/a>, special education, elementary education, mathematics, language arts, and science, among several other subjects.<\/p>\n<p>In addition to facing teacher shortages, the teacher workforce in school districts across the country does not reflect the demographic makeup of increasingly diverse student bodies. According to the National Center for Education Statistics, nearly <a href=\"https:\/\/nces.ed.gov\/pubs2020\/2020103\/index.asp\" target=\"_blank\" rel=\"noopener\">80 percent of public school teachers are White<\/a>, at a time when <a href=\"https:\/\/nces.ed.gov\/programs\/coe\/indicator\/cge\/racial-ethnic-enrollment\" target=\"_blank\" rel=\"noopener\">fewer than 50 percent of students are White<\/a>. Yet numerous studies have shown that<a href=\"https:\/\/www.brookings.edu\/blog\/how-we-rise\/2022\/02\/28\/prioritize-educator-diversity-to-address-racial-injustices\/\" target=\"_blank\" rel=\"noopener\"> a racially diverse teacher workforce has a significant positive impact on the academic performance<\/a> of all students, especially students of color. In Portland, <a href=\"https:\/\/drive.google.com\/file\/d\/1_tIjd7XXabmueG8SP5rTFIUY2bvJDGqW\/view\" target=\"_blank\" rel=\"noopener\">the public school system illustrates this disparity<\/a>: Although nearly half of Portland’s public school students are students of color, 90 percent of the district’s educators are White.<\/p>\n<p>Portland is <a href=\"https:\/\/www.mainepublic.org\/news\/2021-12-09\/portland-public-schools-receive-a-new-grant-to-help-diversify-its-teaching-force\" target=\"_blank\" rel=\"noopener\">investing in strategies<\/a> to address these shortfalls. Recent demographic trends in Maine and throughout the U.S. suggest a promising solution to teacher workforce shortages and lack of diversity among existing educators. Although historically one of the least diverse states in the U.S., Maine has become a <a href=\"https:\/\/maineimmigrantrights.org\/who-we-are\/\" target=\"_blank\" rel=\"noopener\">destination for growing numbers of immigrants and refugees<\/a>, nearly <a href=\"https:\/\/www.migrationpolicy.org\/data\/state-profiles\/state\/demographics\/ME\" target=\"_blank\" rel=\"noopener\">half of whom are people of color<\/a>. Nationwide, <a href=\"https:\/\/www.migrationpolicy.org\/research\/brain-waste-college-educated-immigrants\" target=\"_blank\" rel=\"noopener\">nearly 60 percent<\/a> of recently arrived immigrants have a university education from another country, with more than <a href=\"https:\/\/www.migrationpolicy.org\/sites\/default\/files\/publications\/FactSheet_BrainWaste_US-FINAL.pdf\" target=\"_blank\" rel=\"noopener\">263,000 of them holding a bachelor’s degree in teaching<\/a>. Nevertheless, many of these potential teachers don’t practice their profession, with <a href=\"https:\/\/www.migrationpolicy.org\/sites\/default\/files\/publications\/FactSheet_BrainWaste_US-FINAL.pdf\" target=\"_blank\" rel=\"noopener\">more than 65 percent unemployed or underemployed<\/a>, because of systemic barriers to licensure. School districts, states, teacher preparation programs, and education advocates should look to internationally trained and educated immigrants and refugees who have teaching experience, like Nabaa, to help address the current teacher shortage and in turn create a qualified, diverse education workforce.<\/p>\n<h3>Nabaa’s Journey<\/h3>\n<p>Seeking to restart her professional life in her new country, Nabaa was directed to <a href=\"https:\/\/www.portlandadulted.org\/\" target=\"_blank\" rel=\"noopener\">Portland Adult Education<\/a> shortly after her arrival. In addition to hosting community programs for the greater Portland area, Portland Adult Education offers classes in English, job skills, personal enrichment courses, and the <a href=\"https:\/\/nmrcmaine.org\/\" target=\"_blank\" rel=\"noopener\">New Mainers Resource Center<\/a> (NMRC), dedicated to serving the career needs of immigrants and refugees, is one of its programs.<\/p>\n<p>Nabaa quickly signed up for intensive English classes and a job training program that filled her days for the next year. Upon completing these courses, she sought work that would allow her to pursue her passions in art and education, eventually juggling several jobs as an interpreter, handcrafting accessories at a local business, and designing and baking cakes.<\/p>\n<p>In the spring of 2018, Nabaa was contacted by Sally Sutton, program coordinator at NMRC. Under Sally’s leadership, NMRC had recently established the <a href=\"https:\/\/gcc02.safelinks.protection.outlook.com\/?url=https%3A%2F%2Fdocs.google.com%2Fpresentation%2Fd%2F1jdTxhQka1jnbu_ts_1Dm6f4T6mJ7APoYnhrLZwRNRrc%2Fedit%3Fusp%3Dsharing&amp;data=05%7C01%7CRachel.Paling%40maine.gov%7Ca7c0668abf854f9c971608da80898866%7C413fa8ab207d4b629bcdea1a8f2f864e%7C0%7C0%7C637963625429152590%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=BFXuKzRXkVPGzDk8q%2BQh9zyd70Bv6HX0lVRRgADQDic%3D&amp;reserved=0\" target=\"_blank\" rel=\"noopener\">Education Academy<\/a>, a program created to prepare internationally trained immigrants and refugees to enter the education workforce. Remembering Nabaa’s professional background as an educator and her continued desire to re-enter the classroom, Sally hoped to recruit her as one of the program’s first students.<\/p>\n<blockquote><p>“[Prior to establishing Education Academy] there was not a clear understanding on the part of educational programs or public schools about what it would take to get foreign trained teachers certified or into traditional teacher training programs. Seeing this gap, we began to have conversations with Portland Public Schools and the Maine Department of Labor, both of whom were very supportive of the initiative, about the specific barriers immigrant and refugee teachers faced and what it would take to help them get hired.” – Sally Sutton<\/p><\/blockquote>\n<p>As a result of these conversations and with financial support from the Maine Department of Labor, NMRC developed a robust curriculum which became Education Academy. Up until that point, NMRC had occasionally served immigrants and refugees with professional backgrounds in education, helping them obtain education technician certifications to get them back in classrooms and working with students; but without the resources of a dedicated program, NMRC employees could provide only limited assistance—leaving many clients without the information and support they needed to pursue teacher preparation programs and fulfill state certification requirements. Education Academy changed that, allowing NMRC to help far more individuals obtain educational technician or even teacher certification.<\/p>\n<h3>Education Academy Experience<\/h3>\n<p>Now in its fifth year, Education Academy’s curriculum combines coursework with classroom teaching experience in a local public school to help its internationally educated students meet the requirements for Maine teacher certification. The academy’s participants are also offered additional English proficiency classes, career guidance, networking opportunities with local schools, guidance on degree evaluation and teacher certification requirements, financial support for fees associated with certification, and job referrals upon graduation.<\/p>\n<div id=\"attachment_38765\" style=\"width: 561px\" class=\"wp-caption alignnone\"><img decoding=\"async\" aria-describedby=\"caption-attachment-38765\" class=\"wp-image-38765 size-full\" src=\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/Education-Academy-1.png\" alt=\"\" width=\"551\" height=\"419\" srcset=\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/Education-Academy-1.png 551w, https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/Education-Academy-1-300x228.png 300w\" sizes=\"(max-width: 551px) 100vw, 551px\" \/><p id=\"caption-attachment-38765\" class=\"wp-caption-text\">An instructor and students attending Education Academy&#8217;s graduation ceremony.<\/p><\/div>\n<p>The goal is to help program graduates meet the state’s requirements to be employed as an Education Technician III or a substitute teacher in a local school district; or, if qualified, to obtain full teacher certification. “Upon completion of the program, many of our teaching students are in fact eligible for conditional teacher certifications in several subject matter areas and\/or grade levels,” says Sally. Once hired with a conditional teacher certification, these internationally trained educators can then work toward attaining full Maine teacher certification, which requires passing more skills tests, gaining additional classroom experience, and filling any gaps in their academic preparation.<\/p>\n<blockquote><p>“Everyone who wants to be an educator should enroll in a program like Education Academy. When you build a house, the most important thing is the foundation, and this program helps you build that and opens doors.” – Nabaa Alobaidi<\/p><\/blockquote>\n<p>Once enrolled, Nabaa found the Education Academy program to be a critical pathway to gaining American classroom experience and jumpstarting her goal of teaching again. “The program was very helpful because we were walked through the licensing journey and given real experience with different classroom situations,” Nabaa says. In particular, she found that her classmates –all immigrants or refugees—helped to boost her confidence in the classroom. “We work in the same way and experience many of the same challenges, so having other [immigrant and refugee peers] was very helpful to go to for advice and feel comfortable.”<\/p>\n<p>In 2019, a year after enrolling in Education Academy, Nabaa was certified by Maine’s Department of Education as an Education Technician III and hired by Deering High School to teach Arabic, her native language, on a conditional teacher certification. “My background in the arts has allowed me to make posters, create games, and make class fun for students who shy away because [Arabic is] such a difficult language,” Nabaa notes. With the support of NMRC’s Education Academy, Nabaa not only filled a vacant teaching position but also brought linguistic and cultural competence to her educator role.<\/p>\n<h3>Teacher Bridge Project<\/h3>\n<p>Seeking to nurture proven program models like Education Academy at the national level, WES Global Talent Bridge launched the <a href=\"https:\/\/www.wes.org\/partners\/global-talent-bridge\/skilled-immigrant-integration-project\/the-teacher-bridge-project\/\">Teacher Bridge Project<\/a> in 2021 to convene <a href=\"https:\/\/www.wes.org\/partners\/global-talent-bridge\/skilled-immigrant-integration-project\/\">Skilled Immigrant Integration Program<\/a> partners that have demonstrated leadership in the field of immigrant and refugee teacher workforce inclusion. Inaugural partners included non-profits, educational bodies, and government agencies.<\/p>\n<p>Participation in the Teacher Bridge Project community of practice offered these organizations monthly workshops and individualized technical assistance to expand access to educator preparation programs and increase diversity in the teacher workforce. Members also had a chance to participate<span class=\"ui-provider gr b c d e f g h i j k l m n o p q r s t u v w x y z ab ac ae af ag ah ai aj ak\" dir=\"ltr\"> in a <a class=\"fui-Link ___1qmgydl f3rmtva f1ewtqcl fyind8e f1k6fduh f1w7gpdv fk6fouc fjoy568 figsok6 f1hu3pq6 f11qmguv f19f4twv f1tyq0we f1g0x7ka fhxju0i f1qch9an f1cnd47f fqv5qza f1vmzxwi f1o700av f13mvf36 f1cmlufx f9n3di6 f1ids18y f1tx3yz7 f1deo86v f1eh06m1 f1iescvh ftqa4ok f2hkw1w fhgqx19 f1olyrje f1p93eir f1h8hb77 f1x7u7e9 f10aw75t fsle3fq\" title=\"https:\/\/knowledge.wes.org\/globaltalentbridge-webinar-pathways-to-teaching-for-immigrants-and-refugees.html\" href=\"https:\/\/knowledge.wes.org\/globaltalentbridge-webinar-pathways-to-teaching-for-immigrants-and-refugees.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Link public webinar series\"><u>public webinar series<\/u><\/a><\/span>, where they could share innovative program and policy models that support the career advancement of internationally trained educators. The Teacher Bridge Project continues in 2023 with an expanded group of partners.<\/p>\n<p>Teacher Bridge Project participants have found great benefits in having access to a national network of other organizations and experts invested in supporting internationally trained educators. According to Sally Sutton, being connected to programs beyond NMRC’s Education Academy has allowed her to “hear what’s happening nationally and across the country, to learn what successful policies or programs can be replicated locally.” In building this robust community of practice, WES Global Talent Bridge hopes to inspire greater support for internationally trained educators across the country. Says WES Senior Advisor Jeff Gross, who leads the Teacher Bridge Project, “We all have a lot to learn from the unique experience and expertise these teachers can bring to American classrooms. WES Global Talent Bridge is proud to support their professional journeys.”<\/p>\n<h3>National Teacher Appreciation Day<\/h3>\n<p>After years of hard work, dedication to pursuing her career goals, and several more English and teaching content courses, Nabaa is now a certified professional Arabic teacher; she also instructs students in studio art. Although a fully certified teacher, Nabaa hopes to expand her impact beyond the classroom. “Being an art instructor is not my end goal. I will never stop dreaming big—I wish to be a principal in the future,” she says.<\/p>\n<p>In honor of National Teacher Appreciation Day, WES Global Talent Bridge and the Teacher Bridge Project recognize the impact of internationally educated teachers like Nabaa Alobaidi, and the importance of comprehensive bridge programs like the New Mainers Resource Center’s Education Academy.<\/p>\n","protected":false},"featured_media":41105,"comment_status":"closed","ping_status":"closed","template":"","gtb_blog_categories":[1197,1169],"gtb_tags":[712,913,1209,970,1314,705,1210,1208,1002,1163],"better_featured_image":{"id":41105,"alt_text":"Headshot of Nabaa Alobaidi and quote","caption":"Headshot of Nabaa Alobaidi and quote","description":"Portrait of woman and the quote \"When you build a house, the most important thing is the foundation, and Education Academy helps you build that and opens doors.\"","media_type":"image","media_details":{"width":1351,"height":901,"file":"2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png","filesize":208674,"sizes":{"medium":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-300x200.png","width":300,"height":200,"mime-type":"image\/png","filesize":18130,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-300x200.png"},"large":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-1024x683.png","width":1024,"height":683,"mime-type":"image\/png","filesize":133619,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-1024x683.png"},"thumbnail":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-150x150.png","width":150,"height":150,"mime-type":"image\/png","filesize":8316,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-150x150.png"},"medium_large":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-768x512.png","width":768,"height":512,"mime-type":"image\/png","filesize":83459,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-768x512.png"},"testimonial-thumb":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-165x190.png","width":165,"height":190,"mime-type":"image\/png","filesize":10385,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-165x190.png"},"carousel-post-thumb":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-540x277.png","width":540,"height":277,"mime-type":"image\/png","filesize":40452,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-540x277.png"},"col-profile-thumb":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-195x195.png","width":195,"height":195,"mime-type":"image\/png","filesize":12227,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-195x195.png"},"builder-feed-lg":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-981x517.png","width":981,"height":517,"mime-type":"image\/png","filesize":107135,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-981x517.png"},"team":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-185x185.png","width":185,"height":185,"mime-type":"image\/png","filesize":11422,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-185x185.png"},"people":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-394x276.png","width":394,"height":276,"mime-type":"image\/png","filesize":30223,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-394x276.png"},"insight":{"file":"0423-Teacher-Bridge-Blog-Header-V2-1-541x362.png","width":541,"height":362,"mime-type":"image\/png","filesize":46990,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1-541x362.png"}},"image_meta":{"aperture":"0","credit":"","camera":"","caption":"","created_timestamp":"0","copyright":"","focal_length":"0","iso":"0","shutter_speed":"0","title":"","orientation":"0","keywords":[]}},"post":38761,"source_url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png"},"acf":{"author_name":"Trevor Shealy","author":{"ID":38771,"post_author":"54","post_date":"2023-05-01 16:01:50","post_date_gmt":"2023-05-01 20:01:50","post_content":"Trevor Shealy is Program Specialist, State and Local Initiatives, at WES Global Talent Bridge.","post_title":"Trevor Shealy","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"trevor-shealy","to_ping":"","pinged":"","post_modified":"2023-05-02 12:43:32","post_modified_gmt":"2023-05-02 16:43:32","post_content_filtered":"","post_parent":0,"guid":"https:\/\/www.wes.org\/?post_type=authors&#038;p=38771","menu_order":0,"post_type":"authors","post_mime_type":"","comment_count":"0","filter":"raw"}},"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.3 (Yoast SEO v22.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day<\/title>\n<meta name=\"description\" content=\"Internationally trained immigrants and refugees are a key source of educational talent for the 36,000 vacant teaching positions in school districts across the United States.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day\" \/>\n<meta property=\"og:description\" content=\"This National Teacher Appreciation Day, WES Global Talent Bridge and the Teacher Bridge Project recognize the impact of internationally educated teachers like Nabaa Alobaidi, and the importance of comprehensive bridge programs like the New Mainers Resource Center’s Education Academy.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/\" \/>\n<meta property=\"og:site_name\" content=\"World Education Services\" \/>\n<meta property=\"article:modified_time\" content=\"2024-02-29T17:21:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Social-Card-V1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1921\" \/>\n\t<meta property=\"og:image:height\" content=\"1081\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day\" \/>\n<meta name=\"twitter:description\" content=\"This National Teacher Appreciation Day, WES Global Talent Bridge and the Teacher Bridge Project recognize the impact of internationally educated teachers like Nabaa Alobaidi, and the importance of comprehensive bridge programs like the New Mainers Resource Center’s Education Academy.\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/\",\"url\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/\",\"name\":\"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day\",\"isPartOf\":{\"@id\":\"https:\/\/www.wes.org\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png\",\"datePublished\":\"2023-05-02T16:44:11+00:00\",\"dateModified\":\"2024-02-29T17:21:30+00:00\",\"description\":\"Internationally trained immigrants and refugees are a key source of educational talent for the 36,000 vacant teaching positions in school districts across the United States.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#primaryimage\",\"url\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png\",\"contentUrl\":\"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png\",\"width\":1351,\"height\":901,\"caption\":\"Headshot of Nabaa Alobaidi and quote\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wes.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"GTB Blog\",\"item\":\"https:\/\/www.wes.org\/partners\/gtb-blog\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wes.org\/#website\",\"url\":\"https:\/\/www.wes.org\/\",\"name\":\"World Education Services\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wes.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day","description":"Internationally trained immigrants and refugees are a key source of educational talent for the 36,000 vacant teaching positions in school districts across the United States.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/","og_locale":"en_US","og_type":"article","og_title":"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day","og_description":"This National Teacher Appreciation Day, WES Global Talent Bridge and the Teacher Bridge Project recognize the impact of internationally educated teachers like Nabaa Alobaidi, and the importance of comprehensive bridge programs like the New Mainers Resource Center’s Education Academy.","og_url":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/","og_site_name":"World Education Services","article_modified_time":"2024-02-29T17:21:30+00:00","og_image":[{"width":1921,"height":1081,"url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Social-Card-V1.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_title":"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day","twitter_description":"This National Teacher Appreciation Day, WES Global Talent Bridge and the Teacher Bridge Project recognize the impact of internationally educated teachers like Nabaa Alobaidi, and the importance of comprehensive bridge programs like the New Mainers Resource Center’s Education Academy.","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/","url":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/","name":"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day","isPartOf":{"@id":"https:\/\/www.wes.org\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#primaryimage"},"image":{"@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png","datePublished":"2023-05-02T16:44:11+00:00","dateModified":"2024-02-29T17:21:30+00:00","description":"Internationally trained immigrants and refugees are a key source of educational talent for the 36,000 vacant teaching positions in school districts across the United States.","breadcrumb":{"@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#primaryimage","url":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png","contentUrl":"https:\/\/www.wes.org\/wp-content\/uploads\/2023\/05\/0423-Teacher-Bridge-Blog-Header-V2-1.png","width":1351,"height":901,"caption":"Headshot of Nabaa Alobaidi and quote"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wes.org\/partners\/gtb-blog\/celebrating-immigrant-and-refugee-educators-in-maine-on-national-teacher-appreciation-day\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wes.org\/"},{"@type":"ListItem","position":2,"name":"GTB Blog","item":"https:\/\/www.wes.org\/partners\/gtb-blog\/"},{"@type":"ListItem","position":3,"name":"Celebrating Immigrant and Refugee Educators in Maine on National Teacher Appreciation Day"}]},{"@type":"WebSite","@id":"https:\/\/www.wes.org\/#website","url":"https:\/\/www.wes.org\/","name":"World Education Services","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wes.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"wpml_current_locale":false,"wpml_translations":[],"_links":{"self":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb-blogs\/38761"}],"collection":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb-blogs"}],"about":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/types\/gtb_blog"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/comments?post=38761"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media\/41105"}],"wp:attachment":[{"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/media?parent=38761"}],"wp:term":[{"taxonomy":"gtb_blog_categories","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb_blog_categories?post=38761"},{"taxonomy":"gtb_tags","embeddable":true,"href":"https:\/\/www.wes.org\/wp-json\/wp\/v2\/gtb_tags?post=38761"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}